{
  "https://aclanthology.org/2020.aacl-main.1": {
    "title": "Touch Editing: A Flexible One-Time Interaction Approach for Translation",
    "volume": "main",
    "abstract": "We propose a touch-based editing method for translation, which is more flexible than traditional keyboard-mouse-based translation postediting. This approach relies on touch actions that users perform to indicate translation errors. We present a dual-encoder model to handle the actions and generate refined translations. To mimic the user feedback, we adopt the TER algorithm comparing between draft translations and references to automatically extract the simulated actions for training data construction. Experiments on translation datasets with simulated editing actions show that our method significantly improves original translation of Transformer (up to 25.31 BLEU) and outperforms existing interactive translation methods (up to 16.64 BLEU). We also conduct experiments on post-editing dataset to further prove the robustness and effectiveness of our method",
    "checked": true,
    "id": "d1eefbe384c294ebc7e83d9d3b933fdc51569009",
    "semantic_title": "touch editing: a flexible one-time interaction approach for translation",
    "citation_count": 13,
    "authors": [
      "Qian Wang",
      "Jiajun Zhang",
      "Lemao Liu",
      "Guoping Huang",
      "Chengqing Zong"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.2": {
    "title": "Can Monolingual Pretrained Models Help Cross-Lingual Classification?",
    "volume": "main",
    "abstract": "Multilingual pretrained language models (such as multilingual BERT) have achieved impressive results for cross-lingual transfer. However, due to the constant model capacity, multilingual pre-training usually lags behind the monolingual competitors. In this work, we present two approaches to improve zero-shot cross-lingual classification, by transferring the knowledge from monolingual pretrained models to multilingual ones. Experimental results on two cross-lingual classification benchmarks show that our methods outperform vanilla multilingual fine-tuning",
    "checked": true,
    "id": "1687275b21d2c59fb09999768f1f07794fa50d7b",
    "semantic_title": "can monolingual pretrained models help cross-lingual classification?",
    "citation_count": 13,
    "authors": [
      "Zewen Chi",
      "Li Dong",
      "Furu Wei",
      "Xianling Mao",
      "Heyan Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.3": {
    "title": "Rumor Detection on Twitter Using Multiloss Hierarchical BiLSTM with an Attenuation Factor",
    "volume": "main",
    "abstract": "Social media platforms such as Twitter have become a breeding ground for unverified information or rumors. These rumors can threaten people's health, endanger the economy, and affect the stability of a country. Many researchers have developed models to classify rumors using traditional machine learning or vanilla deep learning models. However, previous studies on rumor detection have achieved low precision and are time consuming. Inspired by the hierarchical model and multitask learning, a multiloss hierarchical BiLSTM model with an attenuation factor is proposed in this paper. The model is divided into two BiLSTM modules: post level and event level. By means of this hierarchical structure, the model can extract deep information from limited quantities of text. Each module has a loss function that helps to learn bilateral features and reduce the training time. An attenuation factor is added at the post level to increase the accuracy. The results on two rumor datasets demonstrate that our model achieves better performance than that of state-of-the-art machine learning and vanilla deep learning models",
    "checked": true,
    "id": "27f66163897f41a9d9a414ce75a01ac9cc3ac4d8",
    "semantic_title": "rumor detection on twitter using multiloss hierarchical bilstm with an attenuation factor",
    "citation_count": 9,
    "authors": [
      "Yudianto Sujana",
      "Jiawen Li",
      "Hung-Yu Kao"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.4": {
    "title": "Graph Attention Network with Memory Fusion for Aspect-level Sentiment Analysis",
    "volume": "main",
    "abstract": "Aspect-level sentiment analysis(ASC) predicts each specific aspect term's sentiment polarity in a given text or review. Recent studies used attention-based methods that can effectively improve the performance of aspect-level sentiment analysis. These methods ignored the syntactic relationship between the aspect and its corresponding context words, leading the model to focus on syntactically unrelated words mistakenly. One proposed solution, the graph convolutional network (GCN), cannot completely avoid the problem. While it does incorporate useful information about syntax, it assigns equal weight to all the edges between connected words. It may still incorrectly associate unrelated words to the target aspect through the iterations of graph convolutional propagation. In this study, a graph attention network with memory fusion is proposed to extend GCN's idea by assigning different weights to edges. Syntactic constraints can be imposed to block the graph convolutional propagation of unrelated words. A convolutional layer and a memory fusion were applied to learn and exploit multiword relations and draw different weights of words to improve performance further. Experimental results on five datasets show that the proposed method yields better performance than existing methods",
    "checked": true,
    "id": "7cab2f53abc6593f6461d75baebdc8700cdab984",
    "semantic_title": "graph attention network with memory fusion for aspect-level sentiment analysis",
    "citation_count": 15,
    "authors": [
      "Li Yuan",
      "Jin Wang",
      "Liang-Chih Yu",
      "Xuejie Zhang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.5": {
    "title": "FERNet: Fine-grained Extraction and Reasoning Network for Emotion Recognition in Dialogues",
    "volume": "main",
    "abstract": "Unlike non-conversation scenes, emotion recognition in dialogues (ERD) poses more complicated challenges due to its interactive nature and intricate contextual information. All present methods model historical utterances without considering the content of the target utterance. However, different parts of a historical utterance may contribute differently to emotion inference of different target utterances. Therefore we propose Fine-grained Extraction and Reasoning Network (FERNet) to generate target-specific historical utterance representations. The reasoning module effectively handles both local and global sequential dependencies to reason over context, and updates target utterance representations to more informed vectors. Experiments on two benchmarks show that our method achieves competitive performance compared with previous methods",
    "checked": true,
    "id": "89656a7d105154b65a904529b7bcfa777ce25194",
    "semantic_title": "fernet: fine-grained extraction and reasoning network for emotion recognition in dialogues",
    "citation_count": 1,
    "authors": [
      "Yingmei Guo",
      "Zhiyong Wu",
      "Mingxing Xu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.6": {
    "title": "SentiRec: Sentiment Diversity-aware Neural News Recommendation",
    "volume": "main",
    "abstract": "Personalized news recommendation is important for online news services. Many news recommendation methods recommend news based on their relevance to users' historical browsed news, and the recommended news usually have similar sentiment with browsed news. However, if browsed news is dominated by certain kinds of sentiment, the model may intensively recommend news with the same sentiment orientation, making it difficult for users to receive diverse opinions and news events. In this paper, we propose a sentiment diversity-aware neural news recommendation approach, which can recommend news with more diverse sentiment. In our approach, we propose a sentiment-aware news encoder, which is jointly trained with an auxiliary sentiment prediction task, to learn sentiment-aware news representations. We learn user representations from browsed news representations, and compute click scores based on user and candidate news representations. In addition, we propose a sentiment diversity regularization method to penalize the model by combining the overall sentiment orientation of browsed news as well as the click and sentiment scores of candidate news. Extensive experiments on real-world dataset show that our approach can effectively improve the sentiment diversity in news recommendation without performance sacrifice",
    "checked": true,
    "id": "8605cc3fe1b7d8b29453bd2d22e08b4aa6f9f876",
    "semantic_title": "sentirec: sentiment diversity-aware neural news recommendation",
    "citation_count": 43,
    "authors": [
      "Chuhan Wu",
      "Fangzhao Wu",
      "Tao Qi",
      "Yongfeng Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.7": {
    "title": "BCTH: A Novel Text Hashing Approach via Bayesian Clustering",
    "volume": "main",
    "abstract": "Similarity search is to find the most similar items for a certain target item. The ability of similarity search at large scale plays a significant role in many information retrieval applications, and thus has received much attention. Text hashing is a promising strategy, which utilizes binary encoding to represent documents, obtaining attractive performance. This paper makes the first attempt to utilize Bayesian Clustering for Text Hashing, dubbed as BCTH. Specifically, BCTH is able to map documents to binary codes by utilizing multiple Bayesian Clusterings in parallel, where each Bayesian Clustering is responsible for one bit. Our approach employs the bit-balanced constraint to maximize the amount of information in each bit. Meanwhile, the bit-uncorrected constraint is adopted to keep the independence among all bits. The time complexity of BCTH is linear, where the hash codes and hash function are jointly learned. The experimental results, based on four widely-used datasets, demonstrate that BCTH is competitive, compared with currently competitive baselines in the perspective of both precision and training speed",
    "checked": true,
    "id": "33881c0b83d86afdc910372aa55d85b05a04a78e",
    "semantic_title": "bcth: a novel text hashing approach via bayesian clustering",
    "citation_count": 0,
    "authors": [
      "Ying Wenjie",
      "Yuquan Le",
      "Hantao Xiong"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.8": {
    "title": "Lightweight Text Classifier using Sinusoidal Positional Encoding",
    "volume": "main",
    "abstract": "Large and complex models have recently been developed that require many parameters and much time to solve various problems in natural language processing. This paper explores an efficient way to avoid models being too complicated and ensure nearly equal performance to models showing the state-of-the-art. We propose a single convolutional neural network (CNN) using the sinusoidal positional encoding (SPE) in text classification. The SPE provides useful position information of a word and can construct a more efficient model architecture than before in a CNN-based approach. Our model can significantly reduce the parameter size (at least 67%) and training time (up to 85%) while maintaining similar performance to the CNN-based approach on multiple benchmark datasets",
    "checked": true,
    "id": "6cee38c9634c843efb2bddca043b6aa316a748d9",
    "semantic_title": "lightweight text classifier using sinusoidal positional encoding",
    "citation_count": 1,
    "authors": [
      "Byoung-Doo Oh",
      "Yu-Seop Kim"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.9": {
    "title": "Towards Non-task-specific Distillation of BERT via Sentence Representation Approximation",
    "volume": "main",
    "abstract": "Recently, BERT has become an essential ingredient of various NLP deep models due to its effectiveness and universal-usability. However, the online deployment of BERT is often blocked by its large-scale parameters and high computational cost. There are plenty of studies showing that the knowledge distillation is efficient in transferring the knowledge from BERT into the model with a smaller size of parameters. Nevertheless, current BERT distillation approaches mainly focus on task-specified distillation, such methodologies lead to the loss of the general semantic knowledge of BERT for universal-usability. In this paper, we propose a sentence representation approximating oriented distillation framework that can distill the pre-trained BERT into a simple LSTM based model without specifying tasks. Consistent with BERT, our distilled model is able to perform transfer learning via fine-tuning to adapt to any sentence-level downstream task. Besides, our model can further cooperate with task-specific distillation procedures. The experimental results on multiple NLP tasks from the GLUE benchmark show that our approach outperforms other task-specific distillation methods or even much larger models, i.e., ELMO, with efficiency well-improved",
    "checked": true,
    "id": "c4a4305a31006b143ba9818eb2c1690bdd96bad4",
    "semantic_title": "towards non-task-specific distillation of bert via sentence representation approximation",
    "citation_count": 4,
    "authors": [
      "Bowen Wu",
      "Huan Zhang",
      "MengYuan Li",
      "Zongsheng Wang",
      "Qihang Feng",
      "Junhong Huang",
      "Baoxun Wang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.10": {
    "title": "A Simple and Effective Usage of Word Clusters for CBOW Model",
    "volume": "main",
    "abstract": "We propose a simple and effective method for incorporating word clusters into the Continuous Bag-of-Words (CBOW) model. Specifically, we propose to replace infrequent input and output words in CBOW model with their clusters. The resulting cluster-incorporated CBOW model produces embeddings of frequent words and a small amount of cluster embeddings, which will be fine-tuned in downstream tasks. We empirically show our replacing method works well on several downstream tasks. Through our analysis, we show that our method might be also useful for other similar models which produce word embeddings",
    "checked": true,
    "id": "47a9776e471a033c082159afdcaaf9f6ca5521d0",
    "semantic_title": "a simple and effective usage of word clusters for cbow model",
    "citation_count": 4,
    "authors": [
      "Yukun Feng",
      "Chenlong Hu",
      "Hidetaka Kamigaito",
      "Hiroya Takamura",
      "Manabu Okumura"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.11": {
    "title": "Investigating Learning Dynamics of BERT Fine-Tuning",
    "volume": "main",
    "abstract": "The recently introduced pre-trained language model BERT advances the state-of-the-art on many NLP tasks through the fine-tuning approach, but few studies investigate how the fine-tuning process improves the model performance on downstream tasks. In this paper, we inspect the learning dynamics of BERT fine-tuning with two indicators. We use JS divergence to detect the change of the attention mode and use SVCCA distance to examine the change to the feature extraction mode during BERT fine-tuning. We conclude that BERT fine-tuning mainly changes the attention mode of the last layers and modifies the feature extraction mode of the intermediate and last layers. Moreover, we analyze the consistency of BERT fine-tuning between different random seeds and different datasets. In summary, we provide a distinctive understanding of the learning dynamics of BERT fine-tuning, which sheds some light on improving the fine-tuning results",
    "checked": true,
    "id": "888c3a3788c52d6637d45dc4238691083884589d",
    "semantic_title": "investigating learning dynamics of bert fine-tuning",
    "citation_count": 27,
    "authors": [
      "Yaru Hao",
      "Li Dong",
      "Furu Wei",
      "Ke Xu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.12": {
    "title": "Second-Order Neural Dependency Parsing with Message Passing and End-to-End Training",
    "volume": "main",
    "abstract": "In this paper, we propose second-order graph-based neural dependency parsing using message passing and end-to-end neural networks. We empirically show that our approaches match the accuracy of very recent state-of-the-art second-order graph-based neural dependency parsers and have significantly faster speed in both training and testing. We also empirically show the advantage of second-order parsing over first-order parsing and observe that the usefulness of the head-selection structured constraint vanishes when using BERT embedding",
    "checked": true,
    "id": "632b91567ab3b6897c821649f3e99fef8304f2ab",
    "semantic_title": "second-order neural dependency parsing with message passing and end-to-end training",
    "citation_count": 34,
    "authors": [
      "Xinyu Wang",
      "Kewei Tu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.13": {
    "title": "High-order Refining for End-to-end Chinese Semantic Role Labeling",
    "volume": "main",
    "abstract": "Current end-to-end semantic role labeling is mostly accomplished via graph-based neural models. However, these all are first-order models, where each decision for detecting any predicate-argument pair is made in isolation with local features. In this paper, we present a high-order refining mechanism to perform interaction between all predicate-argument pairs. Based on the baseline graph model, our high-order refining module learns higher-order features between all candidate pairs via attention calculation, which are later used to update the original token representations. After several iterations of refinement, the underlying token representations can be enriched with globally interacted features. Our high-order model achieves state-of-the-art results on Chinese SRL data, including CoNLL09 and Universal Proposition Bank, meanwhile relieving the long-range dependency issues",
    "checked": true,
    "id": "3a9c5d5cd7a64676d83349af3952eba4a3886ea9",
    "semantic_title": "high-order refining for end-to-end chinese semantic role labeling",
    "citation_count": 6,
    "authors": [
      "Hao Fei",
      "Yafeng Ren",
      "Donghong Ji"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.14": {
    "title": "Exploiting WordNet Synset and Hypernym Representations for Answer Selection",
    "volume": "main",
    "abstract": "Answer selection (AS) is an important subtask of document-based question answering (DQA). In this task, the candidate answers come from the same document, and each answer sentence is semantically related to the given question, which makes it more challenging to select the true answer. WordNet provides powerful knowledge about concepts and their semantic relations so we employ WordNet to enrich the abilities of paraphrasing and reasoning of the network-based question answering model. Specifically, we exploit the synset and hypernym concepts to enrich the word representation and incorporate the similarity scores of two concepts that share the synset or hypernym relations into the attention mechanism. The proposed WordNet-enhanced hierarchical model (WEHM) consists of four modules, including WordNet-enhanced word representation, sentence encoding, WordNet-enhanced attention mechanism, and hierarchical document encoding. Extensive experiments on the public WikiQA and SelQA datasets demonstrate that our proposed model significantly improves the baseline system and outperforms all existing state-of-the-art methods by a large margin",
    "checked": true,
    "id": "011f06193781e5dd573c75bb358d2e453692da37",
    "semantic_title": "exploiting wordnet synset and hypernym representations for answer selection",
    "citation_count": 1,
    "authors": [
      "Weikang Li",
      "Yunfang Wu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.15": {
    "title": "A Simple Text-based Relevant Location Prediction Method using Knowledge Base",
    "volume": "main",
    "abstract": "In this paper, we propose a simple method to predict salient locations from news article text using a knowledge base (KB). The proposed method uses a dictionary of locations created from the KB to identify occurrences of locations in the text and uses the hierarchical information between entities in the KB for assigning appropriate saliency scores to regions. It allows prediction at arbitrary region units and has only a few hyperparameters that need to be tuned. We show using manually annotated news articles that the proposed method improves the f-measure by > 0.12 compared to multiple baselines",
    "checked": true,
    "id": "ed03a67c0106fbce7d46b369fdc240fcccc07093",
    "semantic_title": "a simple text-based relevant location prediction method using knowledge base",
    "citation_count": 1,
    "authors": [
      "Mei Sasaki",
      "Shumpei Okura",
      "Shingo Ono"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.16": {
    "title": "Learning Goal-oriented Dialogue Policy with opposite Agent Awareness",
    "volume": "main",
    "abstract": "Most existing approaches for goal-oriented dialogue policy learning used reinforcement learning, which focuses on the target agent policy and simply treats the opposite agent policy as part of the environment. While in real-world scenarios, the behavior of an opposite agent often exhibits certain patterns or underlies hidden policies, which can be inferred and utilized by the target agent to facilitate its own decision making. This strategy is common in human mental simulation by first imaging a specific action and the probable results before really acting it. We therefore propose an opposite behavior aware framework for policy learning in goal-oriented dialogues. We estimate the opposite agent's policy from its behavior and use this estimation to improve the target agent by regarding it as part of the target policy. We evaluate our model on both cooperative and competitive dialogue tasks, showing superior performance over state-of-the-art baselines",
    "checked": true,
    "id": "95b95f69dba4735c57e26960a531ff478b1acd99",
    "semantic_title": "learning goal-oriented dialogue policy with opposite agent awareness",
    "citation_count": 15,
    "authors": [
      "Zheng Zhang",
      "Lizi Liao",
      "Xiaoyan Zhu",
      "Tat-Seng Chua",
      "Zitao Liu",
      "Yan Huang",
      "Minlie Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.17": {
    "title": "An Empirical Study of Tokenization Strategies for Various Korean NLP Tasks",
    "volume": "main",
    "abstract": "Typically, tokenization is the very first step in most text processing works. As a token serves as an atomic unit that embeds the contextual information of text, how to define a token plays a decisive role in the performance of a model. Even though Byte Pair Encoding (BPE) has been considered the de facto standard tokenization method due to its simplicity and universality, it still remains unclear whether BPE works best across all languages and tasks. In this paper, we test several tokenization strategies in order to answer our primary research question, that is, \"What is the best tokenization strategy for Korean NLP tasks?\" Experimental results demonstrate that a hybrid approach of morphological segmentation followed by BPE works best in Korean to/from English machine translation and natural language understanding tasks such as KorNLI, KorSTS, NSMC, and PAWS-X. As an exception, for KorQuAD, the Korean extension of SQuAD, BPE segmentation turns out to be the most effective. Our code and pre-trained models are publicly available at https://github.com/kakaobrain/kortok",
    "checked": true,
    "id": "68f2d74f82ec544433f3936dbbf6b6f5255fee10",
    "semantic_title": "an empirical study of tokenization strategies for various korean nlp tasks",
    "citation_count": 42,
    "authors": [
      "Kyubyong Park",
      "Joohong Lee",
      "Seongbo Jang",
      "Dawoon Jung"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.18": {
    "title": "BERT-Based Neural Collaborative Filtering and Fixed-Length Contiguous Tokens Explanation",
    "volume": "main",
    "abstract": "We propose a novel, accurate, and explainable recommender model (BENEFICT) that addresses two drawbacks that most review-based recommender systems face. First is their utilization of traditional word embeddings that could influence prediction performance due to their inability to model the word semantics' dynamic characteristic. Second is their black-box nature that makes the explanations behind every prediction obscure. Our model uniquely integrates three key elements: BERT, multilayer perceptron, and maximum subarray problem to derive contextualized review features, model user-item interactions, and generate explanations, respectively. Our experiments show that BENEFICT consistently outperforms other state-of-the-art models by an average improvement gain of nearly 7%. Based on the human judges' assessment, the BENEFICT-produced explanations can capture the essence of the customer's preference and help future customers make purchasing decisions. To the best of our knowledge, our model is one of the first recommender models to utilize BERT for neural collaborative filtering",
    "checked": true,
    "id": "131ed2ee32a400bb5b594ad95d9046af7bf2e19d",
    "semantic_title": "bert-based neural collaborative filtering and fixed-length contiguous tokens explanation",
    "citation_count": 9,
    "authors": [
      "Reinald Adrian Pugoy",
      "Hung-Yu Kao"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.19": {
    "title": "Transformer-based Approach for Predicting Chemical Compound Structures",
    "volume": "main",
    "abstract": "By predicting chemical compound structures from their names, we can better comprehend chemical compounds written in text and identify the same chemical compound given different notations for database creation. Previous methods have predicted the chemical compound structures from their names and represented them by Simplified Molecular Input Line Entry System (SMILES) strings. However, these methods mainly apply handcrafted rules, and cannot predict the structures of chemical compound names not covered by the rules. Instead of handcrafted rules, we propose Transformer-based models that predict SMILES strings from chemical compound names. We improve the conventional Transformer-based model by introducing two features: (1) a loss function that constrains the number of atoms of each element in the structure, and (2) a multi-task learning approach that predicts both SMILES strings and InChI strings (another string representation of chemical compound structures). In evaluation experiments, our methods achieved higher F-measures than previous rule-based approaches (Open Parser for Systematic IUPAC Nomenclature and two commercially used products), and the conventional Transformer-based model. We release the dataset used in this paper as a benchmark for the future research",
    "checked": true,
    "id": "6815296204c1b20ff3e3c8ea94098fd2b5939090",
    "semantic_title": "transformer-based approach for predicting chemical compound structures",
    "citation_count": 7,
    "authors": [
      "Yutaro Omote",
      "Kyoumoto Matsushita",
      "Tomoya Iwakura",
      "Akihiro Tamura",
      "Takashi Ninomiya"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.20": {
    "title": "Chinese Grammatical Correction Using BERT-based Pre-trained Model",
    "volume": "main",
    "abstract": "In recent years, pre-trained models have been extensively studied, and several downstream tasks have benefited from their utilization. In this study, we verify the effectiveness of two methods that incorporate a pre-trained model into an encoder-decoder model on Chinese grammatical error correction tasks. We also analyze the error type and conclude that sentence-level errors are yet to be addressed",
    "checked": true,
    "id": "6814afa3f5dae75f48824e21193b8068d42b7858",
    "semantic_title": "chinese grammatical correction using bert-based pre-trained model",
    "citation_count": 11,
    "authors": [
      "Hongfei Wang",
      "Michiki Kurosawa",
      "Satoru Katsumata",
      "Mamoru Komachi"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.21": {
    "title": "Neural Gibbs Sampling for Joint Event Argument Extraction",
    "volume": "main",
    "abstract": "Event Argument Extraction (EAE) aims at predicting event argument roles of entities in text, which is a crucial subtask and bottleneck of event extraction. Existing EAE methods either extract each event argument roles independently or sequentially, which cannot adequately model the joint probability distribution among event arguments and their roles. In this paper, we propose a Bayesian model named Neural Gibbs Sampling (NGS) to jointly extract event arguments. Specifically, we train two neural networks to model the prior distribution and conditional distribution over event arguments respectively and then use Gibbs sampling to approximate the joint distribution with the learned distributions. For overcoming the shortcoming of the high complexity of the original Gibbs sampling algorithm, we further apply simulated annealing to efficiently estimate the joint probability distribution over event arguments and make predictions. We conduct experiments on the two widely-used benchmark datasets ACE 2005 and TAC KBP 2016. The Experimental results show that our NGS model can achieve comparable results to existing state-of-the-art EAE methods. The source code can be obtained from https://github.com/THU-KEG/NGS",
    "checked": true,
    "id": "798805ec349de8440398342ee3b1521db931467a",
    "semantic_title": "neural gibbs sampling for joint event argument extraction",
    "citation_count": 6,
    "authors": [
      "Xiaozhi Wang",
      "Shengyu Jia",
      "Xu Han",
      "Zhiyuan Liu",
      "Juanzi Li",
      "Peng Li",
      "Jie Zhou"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.22": {
    "title": "Named Entity Recognition in Multi-level Contexts",
    "volume": "main",
    "abstract": "Named entity recognition is a critical task in the natural language processing field. Most existing methods for this task can only exploit contextual information within a sentence. However, their performance on recognizing entities in limited or ambiguous sentence-level contexts is usually unsatisfactory. Fortunately, other sentences in the same document can provide supplementary document-level contexts to help recognize these entities. In addition, words themselves contain word-level contextual information since they usually have different preferences of entity type and relative position from named entities. In this paper, we propose a unified framework to incorporate multi-level contexts for named entity recognition. We use TagLM as our basic model to capture sentence-level contexts. To incorporate document-level contexts, we propose to capture interactions between sentences via a multi-head self attention network. To mine word-level contexts, we propose an auxiliary task to predict the type of each word to capture its type preference. We jointly train our model in entity recognition and the auxiliary classification task via multi-task learning. The experimental results on several benchmark datasets validate the effectiveness of our method",
    "checked": true,
    "id": "b383296ab8a991aed4ba62eb170ec22e1c1f4a09",
    "semantic_title": "named entity recognition in multi-level contexts",
    "citation_count": 2,
    "authors": [
      "Yubo Chen",
      "Chuhan Wu",
      "Tao Qi",
      "Zhigang Yuan",
      "Yongfeng Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.23": {
    "title": "A General Framework for Adaptation of Neural Machine Translation to Simultaneous Translation",
    "volume": "main",
    "abstract": "Despite the success of neural machine translation (NMT), simultaneous neural machine translation (SNMT), the task of translating in real time before a full sentence has been observed, remains challenging due to the syntactic structure difference and simultaneity requirements. In this paper, we propose a general framework for adapting neural machine translation to translate simultaneously. Our framework contains two parts: prefix translation that utilizes a consecutive NMT model to translate source prefixes and a stopping criterion that determines when to stop the prefix translation. Experiments on three translation corpora and two language pairs show the efficacy of the proposed framework on balancing the quality and latency in adapting NMT to perform simultaneous translation",
    "checked": true,
    "id": "284bcd883b440e4d0c3016f32f3c6588d60e70b2",
    "semantic_title": "a general framework for adaptation of neural machine translation to simultaneous translation",
    "citation_count": 2,
    "authors": [
      "Yun Chen",
      "Liangyou Li",
      "Xin Jiang",
      "Xiao Chen",
      "Qun Liu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.24": {
    "title": "UnihanLM: Coarse-to-Fine Chinese-Japanese Language Model Pretraining with the Unihan Database",
    "volume": "main",
    "abstract": "Chinese and Japanese share many characters with similar surface morphology. To better utilize the shared knowledge across the languages, we propose UnihanLM, a self-supervised Chinese-Japanese pretrained masked language model (MLM) with a novel two-stage coarse-to-fine training approach. We exploit Unihan, a ready-made database constructed by linguistic experts to first merge morphologically similar characters into clusters. The resulting clusters are used to replace the original characters in sentences for the coarse-grained pretraining of the MLM. Then, we restore the clusters back to the original characters in sentences for the fine-grained pretraining to learn the representation of the specific characters. We conduct extensive experiments on a variety of Chinese and Japanese NLP benchmarks, showing that our proposed UnihanLM is effective on both mono- and cross-lingual Chinese and Japanese tasks, shedding light on a new path to exploit the homology of languages",
    "checked": true,
    "id": "d619570b03e629653d69b5157764be183e8521bf",
    "semantic_title": "unihanlm: coarse-to-fine chinese-japanese language model pretraining with the unihan database",
    "citation_count": 2,
    "authors": [
      "Canwen Xu",
      "Tao Ge",
      "Chenliang Li",
      "Furu Wei"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.25": {
    "title": "Towards a Better Understanding of Label Smoothing in Neural Machine Translation",
    "volume": "main",
    "abstract": "In order to combat overfitting and in pursuit of better generalization, label smoothing is widely applied in modern neural machine translation systems. The core idea is to penalize over-confident outputs and regularize the model so that its outputs do not diverge too much from some prior distribution. While training perplexity generally gets worse, label smoothing is found to consistently improve test performance. In this work, we aim to better understand label smoothing in the context of neural machine translation. Theoretically, we derive and explain exactly what label smoothing is optimizing for. Practically, we conduct extensive experiments by varying which tokens to smooth, tuning the probability mass to be deducted from the true targets and considering different prior distributions. We show that label smoothing is theoretically well-motivated, and by carefully choosing hyperparameters, the practical performance of strong neural machine translation systems can be further improved",
    "checked": true,
    "id": "6d828bd874fddf10bbe059503aa8a38a7b56ead2",
    "semantic_title": "towards a better understanding of label smoothing in neural machine translation",
    "citation_count": 25,
    "authors": [
      "Yingbo Gao",
      "Weiyue Wang",
      "Christian Herold",
      "Zijian Yang",
      "Hermann Ney"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.26": {
    "title": "Comparing Probabilistic, Distributional and Transformer-Based Models on Logical Metonymy Interpretation",
    "volume": "main",
    "abstract": "In linguistics and cognitive science, Logical metonymies are defined as type clashes between an event-selecting verb and an entity-denoting noun (e.g. The editor finished the article), which are typically interpreted by inferring a hidden event (e.g. reading) on the basis of contextual cues. This paper tackles the problem of logical metonymy interpretation, that is, the retrieval of the covert event via computational methods. We compare different types of models, including the probabilistic and the distributional ones previously introduced in the literature on the topic. For the first time, we also tested on this task some of the recent Transformer-based models, such as BERT, RoBERTa, XLNet, and GPT-2. Our results show a complex scenario, in which the best Transformer-based models and some traditional distributional models perform very similarly. However, the low performance on some of the testing datasets suggests that logical metonymy is still a challenging phenomenon for computational modeling",
    "checked": true,
    "id": "9a19e9e8639e3a7bf7d8ca1209e838f60a7a8e28",
    "semantic_title": "comparing probabilistic, distributional and transformer-based models on logical metonymy interpretation",
    "citation_count": 11,
    "authors": [
      "Giulia Rambelli",
      "Emmanuele Chersoni",
      "Alessandro Lenci",
      "Philippe Blache",
      "Chu-Ren Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.27": {
    "title": "AMR Quality Rating with a Lightweight CNN",
    "volume": "main",
    "abstract": "Structured semantic sentence representations such as Abstract Meaning Representations (AMRs) are potentially useful in various NLP tasks. However, the quality of automatic parses can vary greatly and jeopardizes their usefulness. This can be mitigated by models that can accurately rate AMR quality in the absence of costly gold data, allowing us to inform downstream systems about an incorporated parse's trustworthiness or select among different candidate parses. In this work, we propose to transfer the AMR graph to the domain of images. This allows us to create a simple convolutional neural network (CNN) that imitates a human judge tasked with rating graph quality. Our experiments show that the method can rate quality more accurately than strong baselines, in several quality dimensions. Moreover, the method proves to be efficient and reduces the incurred energy consumption",
    "checked": true,
    "id": "02faee71f82794879e5c9962a03312708be19867",
    "semantic_title": "amr quality rating with a lightweight cnn",
    "citation_count": 7,
    "authors": [
      "Juri Opitz"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.28": {
    "title": "Generating Commonsense Explanation by Extracting Bridge Concepts from Reasoning Paths",
    "volume": "main",
    "abstract": "Commonsense explanation generation aims to empower the machine's sense-making capability by generating plausible explanations to statements against commonsense. While this task is easy to human, the machine still struggles to generate reasonable and informative explanations. In this work, we propose a method that first extracts the underlying concepts which are served as bridges in the reasoning chain and then integrates these concepts to generate the final explanation. To facilitate the reasoning process, we utilize external commonsense knowledge to build the connection between a statement and the bridge concepts by extracting and pruning multi-hop paths to build a subgraph. We design a bridge concept extraction model that first scores the triples, routes the paths in the subgraph, and further selects bridge concepts with weak supervision at both the triple level and the concept level. We conduct experiments on the commonsense explanation generation task and our model outperforms the state-of-the-art baselines in both automatic and human evaluation",
    "checked": true,
    "id": "8dadb14480a66f5ddb9ce565875fd26b23d1ac57",
    "semantic_title": "generating commonsense explanation by extracting bridge concepts from reasoning paths",
    "citation_count": 20,
    "authors": [
      "Haozhe Ji",
      "Pei Ke",
      "Shaohan Huang",
      "Furu Wei",
      "Minlie Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.29": {
    "title": "Unsupervised KB-to-Text Generation with Auxiliary Triple Extraction using Dual Learning",
    "volume": "main",
    "abstract": "KB-to-text task aims at generating texts based on the given KB triples. Traditional methods usually map KB triples to sentences via a supervised seq-to-seq model. However, existing annotated datasets are very limited and human labeling is very expensive. In this paper, we propose a method which trains the generation model in a completely unsupervised way with unaligned raw text data and KB triples. Our method exploits a novel dual training framework which leverages the inverse relationship between the KB-to-text generation task and an auxiliary triple extraction task. In our architecture, we reconstruct KB triples or texts via a closed-loop framework via linking a generator and an extractor. Therefore the loss function that accounts for the reconstruction error of KB triples and texts can be used to train the generator and extractor. To resolve the cold start problem in training, we propose a method using a pseudo data generator which generates pseudo texts and KB triples for learning an initial model. To resolve the multiple-triple problem, we design an allocated reinforcement learning component to optimize the reconstruction loss. The experimental results demonstrate that our model can outperform other unsupervised generation methods and close to the bound of supervised methods",
    "checked": true,
    "id": "a4fe6cf1465cea5281e08340fc3d40e55ba6050f",
    "semantic_title": "unsupervised kb-to-text generation with auxiliary triple extraction using dual learning",
    "citation_count": 2,
    "authors": [
      "Zihao Fu",
      "Bei Shi",
      "Lidong Bing",
      "Wai Lam"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.30": {
    "title": "Modality-Transferable Emotion Embeddings for Low-Resource Multimodal Emotion Recognition",
    "volume": "main",
    "abstract": "Despite the recent achievements made in the multi-modal emotion recognition task, two problems still exist and have not been well investigated: 1) the relationship between different emotion categories are not utilized, which leads to sub-optimal performance; and 2) current models fail to cope well with low-resource emotions, especially for unseen emotions. In this paper, we propose a modality-transferable model with emotion embeddings to tackle the aforementioned issues. We use pre-trained word embeddings to represent emotion categories for textual data. Then, two mapping functions are learned to transfer these embeddings into visual and acoustic spaces. For each modality, the model calculates the representation distance between the input sequence and target emotions and makes predictions based on the distances. By doing so, our model can directly adapt to the unseen emotions in any modality since we have their pre-trained embeddings and modality mapping functions. Experiments show that our model achieves state-of-the-art performance on most of the emotion categories. Besides, our model also outperforms existing baselines in the zero-shot and few-shot scenarios for unseen emotions",
    "checked": true,
    "id": "06d420c2c40f3d117634579f12885c0a00780085",
    "semantic_title": "modality-transferable emotion embeddings for low-resource multimodal emotion recognition",
    "citation_count": 29,
    "authors": [
      "Wenliang Dai",
      "Zihan Liu",
      "Tiezheng Yu",
      "Pascale Fung"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.31": {
    "title": "All-in-One: A Deep Attentive Multi-task Learning Framework for Humour, Sarcasm, Offensive, Motivation, and Sentiment on Memes",
    "volume": "main",
    "abstract": "In this paper, we aim at learning the relationships and similarities of a variety of tasks, such as humour detection, sarcasm detection, offensive content detection, motivational content detection and sentiment analysis on a somewhat complicated form of information, i.e., memes. We propose a multi-task, multi-modal deep learning framework to solve multiple tasks simultaneously. For multi-tasking, we propose two attention-like mechanisms viz., Inter-task Relationship Module (iTRM) and Inter-class Relationship Module (iCRM). The main motivation of iTRM is to learn the relationship between the tasks to realize how they help each other. In contrast, iCRM develops relations between the different classes of tasks. Finally, representations from both the attentions are concatenated and shared across the five tasks (i.e., humour, sarcasm, offensive, motivational, and sentiment) for multi-tasking. We use the recently released dataset in the Memotion Analysis task @ SemEval 2020, which consists of memes annotated for the classes as mentioned above. Empirical results on Memotion dataset show the efficacy of our proposed approach over the existing state-of-the-art systems (Baseline and SemEval 2020 winner). The evaluation also indicates that the proposed multi-task framework yields better performance over the single-task learning",
    "checked": true,
    "id": "b6cd5f380675fb43a0e9ae0935cdb30661cf9c04",
    "semantic_title": "all-in-one: a deep attentive multi-task learning framework for humour, sarcasm, offensive, motivation, and sentiment on memes",
    "citation_count": 22,
    "authors": [
      "Dushyant Singh Chauhan",
      "Dhanush S R",
      "Asif Ekbal",
      "Pushpak Bhattacharyya"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.32": {
    "title": "Identifying Implicit Quotes for Unsupervised Extractive Summarization of Conversations",
    "volume": "main",
    "abstract": "We propose Implicit Quote Extractor, an end-to-end unsupervised extractive neural summarization model for conversational texts. When we reply to posts, quotes are used to highlight important part of texts. We aim to extract quoted sentences as summaries. Most replies do not explicitly include quotes, so it is difficult to use quotes as supervision. However, even if it is not explicitly shown, replies always refer to certain parts of texts; we call them implicit quotes. Implicit Quote Extractor aims to extract implicit quotes as summaries. The training task of the model is to predict whether a reply candidate is a true reply to a post. For prediction, the model has to choose a few sentences from the post. To predict accurately, the model learns to extract sentences that replies frequently refer to. We evaluate our model on two email datasets and one social media dataset, and confirm that our model is useful for extractive summarization. We further discuss two topics; one is whether quote extraction is an important factor for summarization, and the other is whether our model can capture salient sentences that conventional methods cannot",
    "checked": true,
    "id": "64abeef57bf3bee9cdd2450c7bf933d037d5081f",
    "semantic_title": "identifying implicit quotes for unsupervised extractive summarization of conversations",
    "citation_count": 3,
    "authors": [
      "Ryuji Kano",
      "Yasuhide Miura",
      "Tomoki Taniguchi",
      "Tomoko Ohkuma"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.33": {
    "title": "Unsupervised Aspect-Level Sentiment Controllable Style Transfer",
    "volume": "main",
    "abstract": "Unsupervised style transfer in text has previously been explored through the sentiment transfer task. The task entails inverting the overall sentiment polarity in a given input sentence, while preserving its content. From the Aspect-Based Sentiment Analysis (ABSA) task, we know that multiple sentiment polarities can often be present together in a sentence with multiple aspects. In this paper, the task of aspect-level sentiment controllable style transfer is introduced, where each of the aspect-level sentiments can individually be controlled at the output. To achieve this goal, a BERT-based encoder-decoder architecture with saliency weighted polarity injection is proposed, with unsupervised training strategies, such as ABSA masked-language-modelling. Through both automatic and manual evaluation, we show that the system is successful in controlling aspect-level sentiments",
    "checked": true,
    "id": "1bf7159ff13aa4f1811b75febb84044e56ada0ee",
    "semantic_title": "unsupervised aspect-level sentiment controllable style transfer",
    "citation_count": 5,
    "authors": [
      "Mukuntha Narayanan Sundararaman",
      "Zishan Ahmad",
      "Asif Ekbal",
      "Pushpak Bhattacharyya"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.34": {
    "title": "Energy-based Self-attentive Learning of Abstractive Communities for Spoken Language Understanding",
    "volume": "main",
    "abstract": "Abstractive community detection is an important spoken language understanding task, whose goal is to group utterances in a conversation according to whether they can be jointly summarized by a common abstractive sentence. This paper provides a novel approach to this task. We first introduce a neural contextual utterance encoder featuring three types of self-attention mechanisms. We then train it using the siamese and triplet energy-based meta-architectures. Experiments on the AMI corpus show that our system outperforms multiple energy-based and non-energy based baselines from the state-of-the-art. Code and data are publicly available",
    "checked": true,
    "id": "dca7ed42b77bcab36f4d77d075384d38f6c17767",
    "semantic_title": "energy-based self-attentive learning of abstractive communities for spoken language understanding",
    "citation_count": 9,
    "authors": [
      "Guokan Shang",
      "Antoine Tixier",
      "Michalis Vazirgiannis",
      "Jean-Pierre Lorr"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.35": {
    "title": "Intent Detection with WikiHow",
    "volume": "main",
    "abstract": "Modern task-oriented dialog systems need to reliably understand users' intents. Intent detection is even more challenging when moving to new domains or new languages, since there is little annotated data. To address this challenge, we present a suite of pretrained intent detection models which can predict a broad range of intended goals from many actions because they are trained on wikiHow, a comprehensive instructional website. Our models achieve state-of-the-art results on the Snips dataset, the Schema-Guided Dialogue dataset, and all 3 languages of the Facebook multilingual dialog datasets. Our models also demonstrate strong zero- and few-shot performance, reaching over 75% accuracy using only 100 training examples in all datasets",
    "checked": true,
    "id": "c13e1e5346e8897283517ab5e60580366491ceea",
    "semantic_title": "intent detection with wikihow",
    "citation_count": 28,
    "authors": [
      "Li Zhang",
      "Qing Lyu",
      "Chris Callison-Burch"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.36": {
    "title": "A Systematic Characterization of Sampling Algorithms for Open-ended Language Generation",
    "volume": "main",
    "abstract": "This work studies the widely adopted ancestral sampling algorithms for auto-regressive language models. We use the quality-diversity (Q-D) trade-off to investigate three popular sampling methods (top-k, nucleus and tempered sampling). We focus on the task of open-ended language generation, and first show that the existing sampling algorithms have similar performance. By carefully inspecting the transformations defined by different sampling algorithms, we identify three key properties that are shared among them: entropy reduction, order preservation, and slope preservation. To validate the importance of the identified properties, we design two sets of new sampling methods: one set in which each algorithm satisfies all three properties, and one set in which each algorithm violates at least one of the properties. We compare their performance with existing algorithms, and find that violating the identified properties could lead to drastic performance degradation, as measured by the Q-D trade-off. On the other hand, we find that the set of sampling algorithms that satisfy these properties performs on par with the existing sampling algorithms",
    "checked": true,
    "id": "9b713f5ab3429586f773557afa58a931fba997c1",
    "semantic_title": "a systematic characterization of sampling algorithms for open-ended language generation",
    "citation_count": 28,
    "authors": [
      "Moin Nadeem",
      "Tianxing He",
      "Kyunghyun Cho",
      "James Glass"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.37": {
    "title": "Chinese Content Scoring: Open-Access Datasets and Features on Different Segmentation Levels",
    "volume": "main",
    "abstract": "In this paper, we analyse the challenges of Chinese content scoring in comparison to English. As a review of prior work for Chinese content scoring shows a lack of open-access data in the field, we present two short-answer data sets for Chinese. The Chinese Educational Short Answers data set (CESA) contains 1800 student answers for five science-related questions. As a second data set, we collected ASAP-ZH with 942 answers by re-using three existing prompts from the ASAP data set. We adapt a state-of-the-art content scoring system for Chinese and evaluate it in several settings on these data sets. Results show that features on lower segmentation levels such as character n-grams tend to have better performance than features on token level",
    "checked": true,
    "id": "4b3d3bf67e14814e5b845390e80d708ed9fac034",
    "semantic_title": "chinese content scoring: open-access datasets and features on different segmentation levels",
    "citation_count": 2,
    "authors": [
      "Yuning Ding",
      "Andrea Horbach",
      "Torsten Zesch"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.38": {
    "title": "Analysis of Hierarchical Multi-Content Text Classification Model on B-SHARP Dataset for Early Detection of Alzheimer's Disease",
    "volume": "main",
    "abstract": "This paper presents a new dataset, B-SHARP, that can be used to develop NLP models for the detection of Mild Cognitive Impairment (MCI) known as an early sign of Alzheimer's disease. Our dataset contains 1-2 min speech segments from 326 human subjects for 3 topics, (1) daily activity, (2) room environment, and (3) picture description, and their transcripts so that a total of 650 speech segments are collected. Given the B-SHARP dataset, several hierarchical text classification models are developed that jointly learn combinatory features across all 3 topics. The best performance of 74.1% is achieved by an ensemble model that adapts 3 types of transformer encoders. To the best of our knowledge, this is the first work that builds deep learning-based text classification models on multiple contents for the detection of MCI",
    "checked": true,
    "id": "f7d423233e8aca189a736e5bbe83f90d6bb971df",
    "semantic_title": "analysis of hierarchical multi-content text classification model on b-sharp dataset for early detection of alzheimer's disease",
    "citation_count": 4,
    "authors": [
      "Renxuan Albert Li",
      "Ihab Hajjar",
      "Felicia Goldstein",
      "Jinho D. Choi"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.39": {
    "title": "An Exploratory Study on Multilingual Quality Estimation",
    "volume": "main",
    "abstract": "Predicting the quality of machine translation has traditionally been addressed with language-specific models, under the assumption that the quality label distribution or linguistic features exhibit traits that are not shared across languages. An obvious disadvantage of this approach is the need for labelled data for each given language pair. We challenge this assumption by exploring different approaches to multilingual Quality Estimation (QE), including using scores from translation models. We show that these outperform single-language models, particularly in less balanced quality label distributions and low-resource settings. In the extreme case of zero-shot QE, we show that it is possible to accurately predict quality for any given new language from models trained on other languages. Our findings indicate that state-of-the-art neural QE models based on powerful pre-trained representations generalise well across languages, making them more applicable in real-world settings",
    "checked": true,
    "id": "04748a086d709d7c15cf9704efd75df09cfff44e",
    "semantic_title": "an exploratory study on multilingual quality estimation",
    "citation_count": 11,
    "authors": [
      "Shuo Sun",
      "Marina Fomicheva",
      "Frdric Blain",
      "Vishrav Chaudhary",
      "Ahmed El-Kishky",
      "Adithya Renduchintala",
      "Francisco Guzmn",
      "Lucia Specia"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.40": {
    "title": "English-to-Chinese Transliteration with Phonetic Auxiliary Task",
    "volume": "main",
    "abstract": "Approaching named entities transliteration as a Neural Machine Translation (NMT) problem is common practice. While many have applied various NMT techniques to enhance machine transliteration models, few focus on the linguistic features particular to the relevant languages. In this paper, we investigate the effect of incorporating phonetic features for English-to-Chinese transliteration under the multi-task learning (MTL) settingwhere we define a phonetic auxiliary task aimed to improve the generalization performance of the main transliteration task. In addition to our system, we also release a new English-to-Chinese dataset and propose a novel evaluation metric which considers multiple possible transliterations given a source name. Our results show that the multi-task model achieves similar performance as the previous state of the art with a model of a much smaller size",
    "checked": true,
    "id": "e37ccb1d715a849e4f2a60bc437690c7fa1dd16e",
    "semantic_title": "english-to-chinese transliteration with phonetic auxiliary task",
    "citation_count": 3,
    "authors": [
      "Yuan He",
      "Shay B. Cohen"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.41": {
    "title": "Predicting and Using Target Length in Neural Machine Translation",
    "volume": "main",
    "abstract": "Attention-based encoder-decoder models have achieved great success in neural machine translation tasks. However, the lengths of the target sequences are not explicitly predicted in these models. This work proposes length prediction as an auxiliary task and set up a sub-network to obtain the length information from the encoder. Experimental results show that the length prediction sub-network brings improvements over the strong baseline system and that the predicted length can be used as an alternative to length normalization during decoding",
    "checked": true,
    "id": "030c3a895a3079a22ece11e7e2aa2659fdedc010",
    "semantic_title": "predicting and using target length in neural machine translation",
    "citation_count": 8,
    "authors": [
      "Zijian Yang",
      "Yingbo Gao",
      "Weiyue Wang",
      "Hermann Ney"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.42": {
    "title": "Grounded PCFG Induction with Images",
    "volume": "main",
    "abstract": "Recent work in unsupervised parsing has tried to incorporate visual information into learning, but results suggest that these models need linguistic bias to compete against models that only rely on text. This work proposes grammar induction models which use visual information from images for labeled parsing, and achieve state-of-the-art results on grounded grammar induction on several languages. Results indicate that visual information is especially helpful in languages where high frequency words are more broadly distributed. Comparison between models with and without visual information shows that the grounded models are able to use visual information for proposing noun phrases, gathering useful information from images for unknown words, and achieving better performance at prepositional phrase attachment prediction",
    "checked": true,
    "id": "a13a180aa995ce2a03d17ea1550813ef4336964b",
    "semantic_title": "grounded pcfg induction with images",
    "citation_count": 16,
    "authors": [
      "Lifeng Jin",
      "William Schuler"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.43": {
    "title": "Heads-up! Unsupervised Constituency Parsing via Self-Attention Heads",
    "volume": "main",
    "abstract": "Transformer-based pre-trained language models (PLMs) have dramatically improved the state of the art in NLP across many tasks. This has led to substantial interest in analyzing the syntactic knowledge PLMs learn. Previous approaches to this question have been limited, mostly using test suites or probes. Here, we propose a novel fully unsupervised parsing approach that extracts constituency trees from PLM attention heads. We rank transformer attention heads based on their inherent properties, and create an ensemble of high-ranking heads to produce the final tree. Our method is adaptable to low-resource languages, as it does not rely on development sets, which can be expensive to annotate. Our experiments show that the proposed method often outperform existing approaches if there is no development set present. Our unsupervised parser can also be used as a tool to analyze the grammars PLMs learn implicitly. For this, we use the parse trees induced by our method to train a neural PCFG and compare it to a grammar derived from a human-annotated treebank",
    "checked": true,
    "id": "237490f4a1814e52384dd6f16cdf9a7318dabe66",
    "semantic_title": "heads-up! unsupervised constituency parsing via self-attention heads",
    "citation_count": 15,
    "authors": [
      "Bowen Li",
      "Taeuk Kim",
      "Reinald Kim Amplayo",
      "Frank Keller"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.44": {
    "title": "Building Location Embeddings from Physical Trajectories and Textual Representations",
    "volume": "main",
    "abstract": "Word embedding methods have become the de-facto way to represent words, having been successfully applied to a wide array of natural language processing tasks. In this paper, we explore the hypothesis that embedding methods can also be effectively used to represent spatial locations. Using a new dataset consisting of the location trajectories of 729 students over a seven month period and text data related to those locations, we implement several strategies to create location embeddings, which we then use to create embeddings of the sequences of locations a student has visited. To identify the surface level properties captured in the representations, we propose a number of probing tasks such as the presence of a specific location in a sequence or the type of activities that take place at a location. We then leverage the representations we generated and employ them in more complex downstream tasks ranging from predicting a student's area of study to a student's depression level, showing the effectiveness of these location embeddings",
    "checked": true,
    "id": "c82cc544f420cb0609568d594bf92048e0283ce7",
    "semantic_title": "building location embeddings from physical trajectories and textual representations",
    "citation_count": 1,
    "authors": [
      "Laura Biester",
      "Carmen Banea",
      "Rada Mihalcea"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.45": {
    "title": "Self-Supervised Learning for Pairwise Data Refinement",
    "volume": "main",
    "abstract": "Pairwise data automatically constructed from weakly supervised signals has been widely used for training deep learning models. Pairwise datasets such as parallel texts can have uneven quality levels overall, but usually contain data subsets that are more useful as learning examples. We present two methods to refine data that are aimed to obtain that kind of subsets in a self-supervised way. Our methods are based on iteratively training dual-encoder models to compute similarity scores. We evaluate our methods on de-noising parallel texts and training neural machine translation models. We find that: (i) The self-supervised refinement achieves most machine translation gains in the first iteration, but following iterations further improve its intrinsic evaluation. (ii) Machine translations can improve the de-noising performance when combined with selection steps. (iii) Our methods are able to reach the performance of a supervised method. Being entirely self-supervised, our methods are well-suited to handle pairwise data without the need of prior knowledge or human annotations",
    "checked": true,
    "id": "c9309306e8f080d116813484edf04d91d9c3454b",
    "semantic_title": "self-supervised learning for pairwise data refinement",
    "citation_count": 0,
    "authors": [
      "Gustavo Hernandez Abrego",
      "Bowen Liang",
      "Wei Wang",
      "Zarana Parekh",
      "Yinfei Yang",
      "Yunhsuan Sung"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.46": {
    "title": "A Survey of the State of Explainable AI for Natural Language Processing",
    "volume": "main",
    "abstract": "Recent years have seen important advances in the quality of state-of-the-art models, but this has come at the expense of models becoming less interpretable. This survey presents an overview of the current state of Explainable AI (XAI), considered within the domain of Natural Language Processing (NLP). We discuss the main categorization of explanations, as well as the various ways explanations can be arrived at and visualized. We detail the operations and explainability techniques currently available for generating explanations for NLP model predictions, to serve as a resource for model developers in the community. Finally, we point out the current gaps and encourage directions for future work in this important research area",
    "checked": true,
    "id": "4b322cf280f459deb6d9e2eb2430d1a28141934c",
    "semantic_title": "a survey of the state of explainable ai for natural language processing",
    "citation_count": 306,
    "authors": [
      "Marina Danilevsky",
      "Kun Qian",
      "Ranit Aharonov",
      "Yannis Katsis",
      "Ban Kawas",
      "Prithviraj Sen"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.47": {
    "title": "Beyond Fine-tuning: Few-Sample Sentence Embedding Transfer",
    "volume": "main",
    "abstract": "Fine-tuning (FT) pre-trained sentence embedding models on small datasets has been shown to have limitations. In this paper we show that concatenating the embeddings from the pre-trained model with those from a simple sentence embedding model trained only on the target data, can improve over the performance of FT for few-sample tasks. To this end, a linear classifier is trained on the combined embeddings, either by freezing the embedding model weights or training the classifier and embedding models end-to-end. We perform evaluation on seven small datasets from NLP tasks and show that our approach with end-to-end training outperforms FT with negligible computational overhead. Further, we also show that sophisticated combination techniques like CCA and KCCA do not work as well in practice as concatenation. We provide theoretical analysis to explain this empirical observation",
    "checked": true,
    "id": "52d144a8108647b85af3cbaf14d0e09f2e1d0291",
    "semantic_title": "beyond fine-tuning: few-sample sentence embedding transfer",
    "citation_count": 0,
    "authors": [
      "Siddhant Garg",
      "Rohit Kumar Sharma",
      "Yingyu Liang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.48": {
    "title": "Multimodal Pretraining for Dense Video Captioning",
    "volume": "main",
    "abstract": "Learning specific hands-on skills such as cooking, car maintenance, and home repairs increasingly happens via instructional videos. The user experience with such videos is known to be improved by meta-information such as time-stamped annotations for the main steps involved. Generating such annotations automatically is challenging, and we describe here two relevant contributions. First, we construct and release a new dense video captioning dataset, Video Timeline Tags (ViTT), featuring a variety of instructional videos together with time-stamped annotations. Second, we explore several multimodal sequence-to-sequence pretraining strategies that leverage large unsupervised datasets of videos and caption-like texts. We pretrain and subsequently finetune dense video captioning models using both YouCook2 and ViTT. We show that such models generalize well and are robust over a wide variety of instructional videos",
    "checked": true,
    "id": "2bacd2f2a70d756f108ad889b6bcddc79cc1ce51",
    "semantic_title": "multimodal pretraining for dense video captioning",
    "citation_count": 54,
    "authors": [
      "Gabriel Huang",
      "Bo Pang",
      "Zhenhai Zhu",
      "Clara Rivera",
      "Radu Soricut"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.49": {
    "title": "Systematic Generalization on gSCAN with Language Conditioned Embedding",
    "volume": "main",
    "abstract": "Systematic Generalization refers to a learning algorithm's ability to extrapolate learned behavior to unseen situations that are distinct but semantically similar to its training data. As shown in recent work, state-of-the-art deep learning models fail dramatically even on tasks for which they are designed when the test set is systematically different from the training data. We hypothesize that explicitly modeling the relations between objects in their contexts while learning their representations will help achieve systematic generalization. Therefore, we propose a novel method that learns objects' contextualized embeddings with dynamic message passing conditioned on the input natural language and end-to-end trainable with other downstream deep learning modules. To our knowledge, this model is the first one that significantly outperforms the provided baseline and reaches state-of-the-art performance on grounded SCAN (gSCAN), a grounded natural language navigation dataset designed to require systematic generalization in its test splits",
    "checked": true,
    "id": "3ecc8f61418f6afdbb600d9f6fbb286143e56026",
    "semantic_title": "systematic generalization on gscan with language conditioned embedding",
    "citation_count": 20,
    "authors": [
      "Tong Gao",
      "Qi Huang",
      "Raymond Mooney"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.50": {
    "title": "Are Scene Graphs Good Enough to Improve Image Captioning?",
    "volume": "main",
    "abstract": "Many top-performing image captioning models rely solely on object features computed with an object detection model to generate image descriptions. However, recent studies propose to directly use scene graphs to introduce information about object relations into captioning, hoping to better describe interactions between objects. In this work, we thoroughly investigate the use of scene graphs in image captioning. We empirically study whether using additional scene graph encoders can lead to better image descriptions and propose a conditional graph attention network (C-GAT), where the image captioning decoder state is used to condition the graph updates. Finally, we determine to what extent noise in the predicted scene graphs influence caption quality. Overall, we find no significant difference between models that use scene graph features and models that only use object detection features across different captioning metrics, which suggests that existing scene graph generation models are still too noisy to be useful in image captioning. Moreover, although the quality of predicted scene graphs is very low in general, when using high quality scene graphs we obtain gains of up to 3.3 CIDEr compared to a strong Bottom-Up Top-Down baseline",
    "checked": true,
    "id": "b89e002625b0703f08b7590a1763ca7c8be66ad4",
    "semantic_title": "are scene graphs good enough to improve image captioning?",
    "citation_count": 20,
    "authors": [
      "Victor Milewski",
      "Marie-Francine Moens",
      "Iacer Calixto"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.51": {
    "title": "Systematically Exploring Redundancy Reduction in Summarizing Long Documents",
    "volume": "main",
    "abstract": "Our analysis of large summarization datasets indicates that redundancy is a very serious problem when summarizing long documents. Yet, redundancy reduction has not been thoroughly investigated in neural summarization. In this work, we systematically explore and compare different ways to deal with redundancy when summarizing long documents. Specifically, we organize existing methods into categories based on when and how the redundancy is considered. Then, in the context of these categories, we propose three additional methods balancing non-redundancy and importance in a general and flexible way. In a series of experiments, we show that our proposed methods achieve the state-of-the-art with respect to ROUGE scores on two scientific paper datasets, Pubmed and arXiv, while reducing redundancy significantly",
    "checked": true,
    "id": "21c3cb93aea616720276ed23d871abc582a0f56c",
    "semantic_title": "systematically exploring redundancy reduction in summarizing long documents",
    "citation_count": 36,
    "authors": [
      "Wen Xiao",
      "Giuseppe Carenini"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.52": {
    "title": "A Cascade Approach to Neural Abstractive Summarization with Content Selection and Fusion",
    "volume": "main",
    "abstract": "We present an empirical study in favor of a cascade architecture to neural text summarization. Summarization practices vary widely but few other than news summarization can provide a sufficient amount of training data enough to meet the requirement of end-to-end neural abstractive systems which perform content selection and surface realization jointly to generate abstracts. Such systems also pose a challenge to summarization evaluation, as they force content selection to be evaluated along with text generation, yet evaluation of the latter remains an unsolved problem. In this paper, we present empirical results showing that the performance of a cascaded pipeline that separately identifies important content pieces and stitches them together into a coherent text is comparable to or outranks that of end-to-end systems, whereas a pipeline architecture allows for flexible content selection. We finally discuss how we can take advantage of a cascaded pipeline in neural text summarization and shed light on important directions for future research",
    "checked": true,
    "id": "587a83a209a82e753b7df25e90fc2c46e4b59fde",
    "semantic_title": "a cascade approach to neural abstractive summarization with content selection and fusion",
    "citation_count": 14,
    "authors": [
      "Logan Lebanoff",
      "Franck Dernoncourt",
      "Doo Soon Kim",
      "Walter Chang",
      "Fei Liu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.53": {
    "title": "Mixed-Lingual Pre-training for Cross-lingual Summarization",
    "volume": "main",
    "abstract": "Cross-lingual Summarization (CLS) aims at producing a summary in the target language for an article in the source language. Traditional solutions employ a two-step approach, i.e. translate -> summarize or summarize -> translate. Recently, end-to-end models have achieved better results, but these approaches are mostly limited by their dependence on large-scale labeled data. We propose a solution based on mixed-lingual pre-training that leverages both cross-lingual tasks such as translation and monolingual tasks like masked language models. Thus, our model can leverage the massive monolingual data to enhance its modeling of language. Moreover, the architecture has no task-specific components, which saves memory and increases optimization efficiency. We show in experiments that this pre-training scheme can effectively boost the performance of cross-lingual summarization. In NCLS dataset, our model achieves an improvement of 2.82 (English to Chinese) and 1.15 (Chinese to English) ROUGE-1 scores over state-of-the-art results",
    "checked": true,
    "id": "16079da90a793270649f91e5e1dd76d8673505bb",
    "semantic_title": "mixed-lingual pre-training for cross-lingual summarization",
    "citation_count": 25,
    "authors": [
      "Ruochen Xu",
      "Chenguang Zhu",
      "Yu Shi",
      "Michael Zeng",
      "Xuedong Huang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.54": {
    "title": "Point-of-Interest Oriented Question Answering with Joint Inference of Semantic Matching and Distance Correlation",
    "volume": "main",
    "abstract": "Point-of-Interest (POI) oriented question answering (QA) aims to return a list of POIs given a question issued by a user. Recent advances in intelligent virtual assistants have opened the possibility of engaging the client software more actively in the provision of location-based services, thereby showing great promise for automatic POI retrieval. Some existing QA methods can be adopted on this task such as QA similarity calculation and semantic parsing using pre-defined rules. The returned results, however, are subject to inherent limitations due to the lack of the ability for handling some important POI related information, including tags, location entities, and proximity-related terms (e.g. \"nearby\", \"close\"). In this paper, we present a novel deep learning framework integrated with joint inference to capture both tag semantic and geographic correlation between question and POIs. One characteristic of our model is to propose a special cross attention question embedding neural network structure to obtain question-to-POI and POI-to-question information. Besides, we utilize a skewed distribution to simulate the spatial relationship between questions and POIs. By measuring the results offered by the model against existing methods, we demonstrate its robustness and practicability, and supplement our conclusions with empirical evidence",
    "checked": true,
    "id": "94419a6fbd9c52cd5a0d45e83bd11a6df80633e5",
    "semantic_title": "point-of-interest oriented question answering with joint inference of semantic matching and distance correlation",
    "citation_count": 1,
    "authors": [
      "Yifei Yuan",
      "Jingbo Zhou",
      "Wai Lam"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.55": {
    "title": "Leveraging Structured Metadata for Improving Question Answering on the Web",
    "volume": "main",
    "abstract": "We show that leveraging metadata information from web pages can improve the performance of models for answer passage selection/reranking. We propose a neural passage selection model that leverages metadata information with a fine-grained encoding strategy, which learns the representation for metadata predicates in a hierarchical way. The models are evaluated on the MS MARCO (Nguyen et al., 2016) and Recipe-MARCO datasets. Results show that our models significantly outperform baseline models, which do not incorporate metadata. We also show that the fine-grained encoding's advantage over other strategies for encoding the metadata",
    "checked": true,
    "id": "5e5e91986e5134dee16d07c5fa5f5288b9aded3c",
    "semantic_title": "leveraging structured metadata for improving question answering on the web",
    "citation_count": 0,
    "authors": [
      "Xinya Du",
      "Ahmed Hassan Awadallah",
      "Adam Fourney",
      "Robert Sim",
      "Paul Bennett",
      "Claire Cardie"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.56": {
    "title": "English Intermediate-Task Training Improves Zero-Shot Cross-Lingual Transfer Too",
    "volume": "main",
    "abstract": "Intermediate-task trainingfine-tuning a pretrained model on an intermediate task before fine-tuning again on the target taskoften improves model performance substantially on language understanding tasks in monolingual English settings. We investigate whether English intermediate-task training is still helpful on non-English target tasks. Using nine intermediate language-understanding tasks, we evaluate intermediate-task transfer in a zero-shot cross-lingual setting on the XTREME benchmark. We see large improvements from intermediate training on the BUCC and Tatoeba sentence retrieval tasks and moderate improvements on question-answering target tasks. MNLI, SQuAD and HellaSwag achieve the best overall results as intermediate tasks, while multi-task intermediate offers small additional improvements. Using our best intermediate-task models for each target task, we obtain a 5.4 point improvement over XLM-R Large on the XTREME benchmark, setting the state of the art as of June 2020. We also investigate continuing multilingual MLM during intermediate-task training and using machine-translated intermediate-task data, but neither consistently outperforms simply performing English intermediate-task training",
    "checked": true,
    "id": "b1a71677a13299755a12375f0c982484088aa9ef",
    "semantic_title": "english intermediate-task training improves zero-shot cross-lingual transfer too",
    "citation_count": 59,
    "authors": [
      "Jason Phang",
      "Iacer Calixto",
      "Phu Mon Htut",
      "Yada Pruksachatkun",
      "Haokun Liu",
      "Clara Vania",
      "Katharina Kann",
      "Samuel R. Bowman"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.57": {
    "title": "STIL - Simultaneous Slot Filling, Translation, Intent Classification, and Language Identification: Initial Results using mBART on MultiATIS++",
    "volume": "main",
    "abstract": "Slot-filling, Translation, Intent classification, and Language identification, or STIL, is a newly-proposed task for multilingual Natural Language Understanding (NLU). By performing simultaneous slot filling and translation into a single output language (English in this case), some portion of downstream system components can be monolingual, reducing development and maintenance cost. Results are given using the multilingual BART model (Liu et al., 2020) fine-tuned on 7 languages using the MultiATIS++ dataset. When no translation is performed, mBART's performance is comparable to the current state of the art system (Cross-Lingual BERT by Xu et al. (2020)) for the languages tested, with better average intent classification accuracy (96.07% versus 95.50%) but worse average slot F1 (89.87% versus 90.81%). When simultaneous translation is performed, average intent classification accuracy degrades by only 1.7% relative and average slot F1 degrades by only 1.2% relative",
    "checked": true,
    "id": "f720c011b04f9ceb8b78efaddd3d9bfbd9bb87ac",
    "semantic_title": "stil - simultaneous slot filling, translation, intent classification, and language identification: initial results using mbart on multiatis++",
    "citation_count": 11,
    "authors": [
      "Jack FitzGerald"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.58": {
    "title": "SimulMT to SimulST: Adapting Simultaneous Text Translation to End-to-End Simultaneous Speech Translation",
    "volume": "main",
    "abstract": "We investigate how to adapt simultaneous text translation methods such as wait-k and monotonic multihead attention to end-to-end simultaneous speech translation by introducing a pre-decision module. A detailed analysis is provided on the latency-quality trade-offs of combining fixed and flexible pre-decision with fixed and flexible policies. We also design a novel computation-aware latency metric, adapted from Average Lagging",
    "checked": true,
    "id": "cfb5549c36b4d673cb509fee066579d4fd581daf",
    "semantic_title": "simulmt to simulst: adapting simultaneous text translation to end-to-end simultaneous speech translation",
    "citation_count": 84,
    "authors": [
      "Xutai Ma",
      "Juan Pino",
      "Philipp Koehn"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.59": {
    "title": "Cue Me In: Content-Inducing Approaches to Interactive Story Generation",
    "volume": "main",
    "abstract": "Automatically generating stories is a challenging problem that requires producing causally related and logical sequences of events about a topic. Previous approaches in this domain have focused largely on one-shot generation, where a language model outputs a complete story based on limited initial input from a user. Here, we instead focus on the task of interactive story generation, where the user provides the model mid-level sentence abstractions in the form of cue phrases during the generation process. This provides an interface for human users to guide the story generation. We present two content-inducing approaches to effectively incorporate this additional information. Experimental results from both automatic and human evaluations show that these methods produce more topically coherent and personalized stories compared to baseline methods",
    "checked": true,
    "id": "a66389733c6090baf3fc07f950afecf122ab3420",
    "semantic_title": "cue me in: content-inducing approaches to interactive story generation",
    "citation_count": 19,
    "authors": [
      "Faeze Brahman",
      "Alexandru Petrusca",
      "Snigdha Chaturvedi"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.60": {
    "title": "Liputan6: A Large-scale Indonesian Dataset for Text Summarization",
    "volume": "main",
    "abstract": "In this paper, we introduce a large-scale Indonesian summarization dataset. We harvest articles from Liputan6.com, an online news portal, and obtain 215,827 documentsummary pairs. We leverage pre-trained language models to develop benchmark extractive and abstractive summarization methods over the dataset with multilingual and monolingual BERT-based models. We include a thorough error analysis by examining machine-generated summaries that have low ROUGE scores, and expose both issues with ROUGE itself, as well as with extractive and abstractive summarization models",
    "checked": true,
    "id": "c63f803a248809d16c63cfbe89cfff0ea0e9a3c0",
    "semantic_title": "liputan6: a large-scale indonesian dataset for text summarization",
    "citation_count": 36,
    "authors": [
      "Fajri Koto",
      "Jey Han Lau",
      "Timothy Baldwin"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.61": {
    "title": "Generating Sports News from Live Commentary: A Chinese Dataset for Sports Game Summarization",
    "volume": "main",
    "abstract": "Sports game summarization focuses on generating news articles from live commentaries. Unlike traditional summarization tasks, the source documents and the target summaries for sports game summarization tasks are written in quite different writing styles. In addition, live commentaries usually contain many named entities, which makes summarizing sports games precisely very challenging. To deeply study this task, we present SportsSum, a Chinese sports game summarization dataset which contains 5,428 soccer games of live commentaries and the corresponding news articles. Additionally, we propose a two-step summarization model consisting of a selector and a rewriter for SportsSum. To evaluate the correctness of generated sports summaries, we design two novel score metrics: name matching score and event matching score. Experimental results show that our model performs better than other summarization baselines on ROUGE scores as well as the two designed scores",
    "checked": true,
    "id": "a3ea313f26836aa70be7ecbd2ac7c1285cd33ac8",
    "semantic_title": "generating sports news from live commentary: a chinese dataset for sports game summarization",
    "citation_count": 18,
    "authors": [
      "Kuan-Hao Huang",
      "Chen Li",
      "Kai-Wei Chang"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.62": {
    "title": "Massively Multilingual Document Alignment with Cross-lingual Sentence-Mover's Distance",
    "volume": "main",
    "abstract": "Document alignment aims to identify pairs of documents in two distinct languages that are of comparable content or translations of each other. Such aligned data can be used for a variety of NLP tasks from training cross-lingual representations to mining parallel data for machine translation. In this paper we develop an unsupervised scoring function that leverages cross-lingual sentence embeddings to compute the semantic distance between documents in different languages. These semantic distances are then used to guide a document alignment algorithm to properly pair cross-lingual web documents across a variety of low, mid, and high-resource language pairs. Recognizing that our proposed scoring function and other state of the art methods are computationally intractable for long web documents, we utilize a more tractable greedy algorithm that performs comparably. We experimentally demonstrate that our distance metric performs better alignment than current baselines outperforming them by 7% on high-resource language pairs, 15% on mid-resource language pairs, and 22% on low-resource language pairs",
    "checked": true,
    "id": "119df7d57a18f36d13beba38396be4b3c350f819",
    "semantic_title": "massively multilingual document alignment with cross-lingual sentence-mover's distance",
    "citation_count": 14,
    "authors": [
      "Ahmed El-Kishky",
      "Francisco Guzmn"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.63": {
    "title": "Improving Context Modeling in Neural Topic Segmentation",
    "volume": "main",
    "abstract": "Topic segmentation is critical in key NLP tasks and recent works favor highly effective neural supervised approaches. However, current neural solutions are arguably limited in how they model context. In this paper, we enhance a segmenter based on a hierarchical attention BiLSTM network to better model context, by adding a coherence-related auxiliary task and restricted self-attention. Our optimized segmenter outperforms SOTA approaches when trained and tested on three datasets. We also the robustness of our proposed model in domain transfer setting by training a model on a large-scale dataset and testing it on four challenging real-world benchmarks. Furthermore, we apply our proposed strategy to two other languages (German and Chinese), and show its effectiveness in multilingual scenarios",
    "checked": true,
    "id": "bc47883f3bb842f5c81bbf279fb91c455ba28e01",
    "semantic_title": "improving context modeling in neural topic segmentation",
    "citation_count": 27,
    "authors": [
      "Linzi Xing",
      "Brad Hackinen",
      "Giuseppe Carenini",
      "Francesco Trebbi"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.64": {
    "title": "Contextualized End-to-End Neural Entity Linking",
    "volume": "main",
    "abstract": "We propose an entity linking (EL) model that jointly learns mention detection (MD) and entity disambiguation (ED). Our model applies task-specific heads on top of shared BERT contextualized embeddings. We achieve state-of-the-art results across a standard EL dataset using our model; we also study our model's performance under the setting when hand-crafted entity candidate sets are not available and find that the model performs well under such a setting too",
    "checked": true,
    "id": "9b274d7df60877ad4db65c931d43216dfd5d257f",
    "semantic_title": "contextualized end-to-end neural entity linking",
    "citation_count": 7,
    "authors": [
      "Haotian Chen",
      "Xi Li",
      "Andrej Zukov Gregoric",
      "Sahil Wadhwa"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.65": {
    "title": "DAPPER: Learning Domain-Adapted Persona Representation Using Pretrained BERT and External Memory",
    "volume": "main",
    "abstract": "Research in building intelligent agents have emphasized the need for understanding characteristic behavior of people. In order to reflect human-like behavior, agents require the capability to comprehend the context, infer individualized persona patterns and incrementally learn from experience. In this paper, we present a model called DAPPER that can learn to embed persona from natural language and alleviate task or domain-specific data sparsity issues related to personas. To this end, we implement a text encoding strategy that leverages a pretrained language model and an external memory to produce domain-adapted persona representations. Further, we evaluate the transferability of these embeddings by simulating low-resource scenarios. Our comparative study demonstrates the capability of our method over other approaches towards learning rich transferable persona embeddings. Empirical evidence suggests that the learnt persona embeddings can be effective in downstream tasks like hate speech detection",
    "checked": true,
    "id": "e75c78e8a7769c3a99993e1dc2e91cba1173d29e",
    "semantic_title": "dapper: learning domain-adapted persona representation using pretrained bert and external memory",
    "citation_count": 3,
    "authors": [
      "Prashanth Vijayaraghavan",
      "Eric Chu",
      "Deb Roy"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.66": {
    "title": "Event Coreference Resolution with Non-Local Information",
    "volume": "main",
    "abstract": "We present two extensions to a state-of-theart joint model for event coreference resolution, which involve incorporating (1) a supervised topic model for improving trigger detection by providing global context, and (2) a preprocessing module that seeks to improve event coreference by discarding unlikely candidate antecedents of an event mention using discourse contexts computed based on salient entities. The resulting model yields the best results reported to date on the KBP 2017 English and Chinese datasets",
    "checked": true,
    "id": "4779db7595673f667e046dbe213cee2b89a2604f",
    "semantic_title": "event coreference resolution with non-local information",
    "citation_count": 6,
    "authors": [
      "Jing Lu",
      "Vincent Ng"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.67": {
    "title": "Neural RST-based Evaluation of Discourse Coherence",
    "volume": "main",
    "abstract": "This paper evaluates the utility of Rhetorical Structure Theory (RST) trees and relations in discourse coherence evaluation. We show that incorporating silver-standard RST features can increase accuracy when classifying coherence. We demonstrate this through our tree-recursive neural model, namely RST-Recursive, which takes advantage of the text's RST features produced by a state of the art RST parser. We evaluate our approach on the Grammarly Corpus for Discourse Coherence (GCDC) and show that when ensembled with the current state of the art, we can achieve the new state of the art accuracy on this benchmark. Furthermore, when deployed alone, RST-Recursive achieves competitive accuracy while having 62% fewer parameters",
    "checked": true,
    "id": "430da213680372786b3655b99d89d2bc1687b8af",
    "semantic_title": "neural rst-based evaluation of discourse coherence",
    "citation_count": 5,
    "authors": [
      "Grigorii Guz",
      "Peyman Bateni",
      "Darius Muglich",
      "Giuseppe Carenini"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.68": {
    "title": "Asking Crowdworkers to Write Entailment Examples: The Best of Bad Options",
    "volume": "main",
    "abstract": "Large-scale natural language inference (NLI) datasets such as SNLI or MNLI have been created by asking crowdworkers to read a premise and write three new hypotheses, one for each possible semantic relationships (entailment, contradiction, and neutral). While this protocol has been used to create useful benchmark data, it remains unclear whether the writing-based annotation protocol is optimal for any purpose, since it has not been evaluated directly. Furthermore, there is ample evidence that crowdworker writing can introduce artifacts in the data. We investigate two alternative protocols which automatically create candidate (premise, hypothesis) pairs for annotators to label. Using these protocols and a writing-based baseline, we collect several new English NLI datasets of over 3k examples each, each using a fixed amount of annotator time, but a varying number of examples to fit that time budget. Our experiments on NLI and transfer learning show negative results: None of the alternative protocols outperforms the baseline in evaluations of generalization within NLI or on transfer to outside target tasks. We conclude that crowdworker writing still the best known option for entailment data, highlighting the need for further data collection work to focus on improving writing-based annotation processes",
    "checked": true,
    "id": "82944c454086b0c18a6df076dd60c4789e70ae8c",
    "semantic_title": "asking crowdworkers to write entailment examples: the best of bad options",
    "citation_count": 10,
    "authors": [
      "Clara Vania",
      "Ruijie Chen",
      "Samuel R. Bowman"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.69": {
    "title": "MaP: A Matrix-based Prediction Approach to Improve Span Extraction in Machine Reading Comprehension",
    "volume": "main",
    "abstract": "Span extraction is an essential problem in machine reading comprehension. Most of the existing algorithms predict the start and end positions of an answer span in the given corresponding context by generating two probability vectors. In this paper, we propose a novel approach that extends the probability vector to a probability matrix. Such a matrix can cover more start-end position pairs. Precisely, to each possible start index, the method always generates an end probability vector. Besides, we propose a sampling-based training strategy to address the computational cost and memory issue in the matrix training phase. We evaluate our method on SQuAD 1.1 and three other question answering benchmarks. Leveraging the most competitive models BERT and BiDAF as the backbone, our proposed approach can get consistent improvements in all datasets, demonstrating the effectiveness of the proposed method",
    "checked": true,
    "id": "71d1b7637ce22220b88726913feb819fb7641792",
    "semantic_title": "map: a matrix-based prediction approach to improve span extraction in machine reading comprehension",
    "citation_count": 4,
    "authors": [
      "Huaishao Luo",
      "Yu Shi",
      "Ming Gong",
      "Linjun Shou",
      "Tianrui Li"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.70": {
    "title": "Answering Product-related Questions with Heterogeneous Information",
    "volume": "main",
    "abstract": "Providing instant response for product-related questions in E-commerce question answering platforms can greatly improve users' online shopping experience. However, existing product question answering (PQA) methods only consider a single information source such as user reviews and/or require large amounts of labeled data. In this paper, we propose a novel framework to tackle the PQA task via exploiting heterogeneous information including natural language text and attribute-value pairs from two information sources of the concerned product, namely product details and user reviews. A heterogeneous information encoding component is then designed for obtaining unified representations of information with different formats. The sources of the candidate snippets are also incorporated when measuring the question-snippet relevance. Moreover, the framework is trained with a specifically designed weak supervision paradigm making use of available answers in the training phase. Experiments on a real-world dataset show that our proposed framework achieves superior performance over state-of-the-art models",
    "checked": true,
    "id": "762aa8de9c86829935e8aaf775a35e64e27db7c8",
    "semantic_title": "answering product-related questions with heterogeneous information",
    "citation_count": 3,
    "authors": [
      "Wenxuan Zhang",
      "Qian Yu",
      "Wai Lam"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.71": {
    "title": "Two-Step Classification using Recasted Data for Low Resource Settings",
    "volume": "main",
    "abstract": "An NLP model's ability to reason should be independent of language. Previous works utilize Natural Language Inference (NLI) to understand the reasoning ability of models, mostly focusing on high resource languages like English. To address scarcity of data in low-resource languages such as Hindi, we use data recasting to create NLI datasets for four existing text classification datasets. Through experiments, we show that our recasted dataset is devoid of statistical irregularities and spurious patterns. We further study the consistency in predictions of the textual entailment models and propose a consistency regulariser to remove pairwise-inconsistencies in predictions. We propose a novel two-step classification method which uses textual-entailment predictions for classification task. We further improve the performance by using a joint-objective for classification and textual entailment. We therefore highlight the benefits of data recasting and improvements on classification performance using our approach with supporting experimental results",
    "checked": true,
    "id": "a87a8a70fb632e78975eee62734978ea64ae0165",
    "semantic_title": "two-step classification using recasted data for low resource settings",
    "citation_count": 8,
    "authors": [
      "Shagun Uppal",
      "Vivek Gupta",
      "Avinash Swaminathan",
      "Haimin Zhang",
      "Debanjan Mahata",
      "Rakesh Gosangi",
      "Rajiv Ratn Shah",
      "Amanda Stent"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.72": {
    "title": "Explaining Word Embeddings via Disentangled Representation",
    "volume": "main",
    "abstract": "Disentangled representations have attracted increasing attention recently. However, how to transfer the desired properties of disentanglement to word representations is unclear. In this work, we propose to transform typical dense word vectors into disentangled embeddings featuring improved interpretability via encoding polysemous semantics separately. We also found the modular structure of our disentangled word embeddings helps generate more efficient and effective features for natural language processing tasks",
    "checked": true,
    "id": "e7d0032c90c2916e5af5b3fed5a00ab3347328d7",
    "semantic_title": "explaining word embeddings via disentangled representation",
    "citation_count": 2,
    "authors": [
      "Keng-Te Liao",
      "Cheng-Syuan Lee",
      "Zhong-Yu Huang",
      "Shou-de Lin"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.73": {
    "title": "Multi-view Classification Model for Knowledge Graph Completion",
    "volume": "main",
    "abstract": "Most previous work on knowledge graph completion conducted single-view prediction or calculation for candidate triple evaluation, based only on the content information of the candidate triples. This paper describes a novel multi-view classification model for knowledge graph completion, where multiple classification views are performed based on both content and context information for candidate triple evaluation. Each classification view evaluates the validity of a candidate triple from a specific viewpoint, based on the content information inside the candidate triple and the context information nearby the triple. These classification views are implemented by a unified neural network and the classification predictions are weightedly integrated to obtain the final evaluation. Experiments show that, the multi-view model brings very significant improvements over previous methods, and achieves the new state-of-the-art on two representative datasets. We believe that, the flexibility and the scalability of the multi-view classification model facilitates the introduction of additional information and resources for better performance",
    "checked": true,
    "id": "b87d1cad44168378437768ba8de45f8fe8c02f2b",
    "semantic_title": "multi-view classification model for knowledge graph completion",
    "citation_count": 2,
    "authors": [
      "Wenbin Jiang",
      "Mengfei Guo",
      "Yufeng Chen",
      "Ying Li",
      "Jinan Xu",
      "Yajuan Lyu",
      "Yong Zhu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.74": {
    "title": "Knowledge-Enhanced Named Entity Disambiguation for Short Text",
    "volume": "main",
    "abstract": "Named entity disambiguation is an important task that plays the role of bridge between text and knowledge. However, the performance of existing methods drops dramatically for short text, which is widely used in actual application scenarios, such as information retrieval and question answering. In this work, we propose a novel knowledge-enhanced method for named entity disambiguation. Considering the problem of information ambiguity and incompleteness for short text, two kinds of knowledge, factual knowledge graph and conceptual knowledge graph, are introduced to provide additional knowledge for the semantic matching between candidate entity and mention context. Our proposed method achieves significant improvement over previous methods on a large manually annotated short-text dataset, and also achieves the state-of-the-art on three standard datasets. The short-text dataset and the proposed model will be publicly available for research use",
    "checked": true,
    "id": "821b7c57cde9b641bcb450039fc0e220afcf00b2",
    "semantic_title": "knowledge-enhanced named entity disambiguation for short text",
    "citation_count": 6,
    "authors": [
      "Zhifan Feng",
      "Qi Wang",
      "Wenbin Jiang",
      "Yajuan Lyu",
      "Yong Zhu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.75": {
    "title": "More Data, More Relations, More Context and More Openness: A Review and Outlook for Relation Extraction",
    "volume": "main",
    "abstract": "Relational facts are an important component of human knowledge, which are hidden in vast amounts of text. In order to extract these facts from text, people have been working on relation extraction (RE) for years. From early pattern matching to current neural networks, existing RE methods have achieved significant progress. Yet with explosion of Web text and emergence of new relations, human knowledge is increasing drastically, and we thus require \"more\" from RE: a more powerful RE system that can robustly utilize more data, efficiently learn more relations, easily handle more complicated context, and flexibly generalize to more open domains. In this paper, we look back at existing RE methods, analyze key challenges we are facing nowadays, and show promising directions towards more powerful RE. We hope our view can advance this field and inspire more efforts in the community",
    "checked": true,
    "id": "15e0a71bd655d7c6c7a1b1a9e9eb7a4f650531cd",
    "semantic_title": "more data, more relations, more context and more openness: a review and outlook for relation extraction",
    "citation_count": 117,
    "authors": [
      "Xu Han",
      "Tianyu Gao",
      "Yankai Lin",
      "Hao Peng",
      "Yaoliang Yang",
      "Chaojun Xiao",
      "Zhiyuan Liu",
      "Peng Li",
      "Jie Zhou",
      "Maosong Sun"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.76": {
    "title": "Robustness and Reliability of Gender Bias Assessment in Word Embeddings: The Role of Base Pairs",
    "volume": "main",
    "abstract": "It has been shown that word embeddings can exhibit gender bias, and various methods have been proposed to quantify this. However, the extent to which the methods are capturing social stereotypes inherited from the data has been debated. Bias is a complex concept and there exist multiple ways to define it. Previous work has leveraged gender word pairs to measure bias and extract biased analogies. We show that the reliance on these gendered pairs has strong limitations: bias measures based off of them are not robust and cannot identify common types of real-world bias, whilst analogies utilising them are unsuitable indicators of bias. In particular, the well-known analogy \"man is to computer-programmer as woman is to homemaker\" is due to word similarity rather than bias. This has important implications for work on measuring bias in embeddings and related work debiasing embeddings",
    "checked": true,
    "id": "10c91a58f296b1d78238886763f071e6ef685606",
    "semantic_title": "robustness and reliability of gender bias assessment in word embeddings: the role of base pairs",
    "citation_count": 12,
    "authors": [
      "Haiyang Zhang",
      "Alison Sneyd",
      "Mark Stevenson"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.77": {
    "title": "ExpanRL: Hierarchical Reinforcement Learning for Course Concept Expansion in MOOCs",
    "volume": "main",
    "abstract": "Within the prosperity of Massive Open Online Courses (MOOCs), the education applications that automatically provide extracurricular knowledge for MOOC users become rising research topics. However, MOOC courses' diversity and rapid updates make it more challenging to find suitable new knowledge for students. In this paper, we present ExpanRL, an end-to-end hierarchical reinforcement learning (HRL) model for concept expansion in MOOCs. Employing a two-level HRL mechanism of seed selection and concept expansion, ExpanRL is more feasible to adjust the expansion strategy to find new concepts based on the students' feedback on expansion results. Our experiments on nine novel datasets from real MOOCs show that ExpanRL achieves significant improvements over existing methods and maintain competitive performance under different settings",
    "checked": true,
    "id": "b96e3c28fdd6648acbd00438e3d1a526d9963e7e",
    "semantic_title": "expanrl: hierarchical reinforcement learning for course concept expansion in moocs",
    "citation_count": 6,
    "authors": [
      "Jifan Yu",
      "Chenyu Wang",
      "Gan Luo",
      "Lei Hou",
      "Juanzi Li",
      "Jie Tang",
      "Minlie Huang",
      "Zhiyuan Liu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.78": {
    "title": "Vocabulary Matters: A Simple yet Effective Approach to Paragraph-level Question Generation",
    "volume": "main",
    "abstract": "Question generation (QG) has recently attracted considerable attention. Most of the current neural models take as input only one or two sentences, and perform poorly when multiple sentences or complete paragraphs are given as input. However, in real-world scenarios it is very important to be able to generate high-quality questions from complete paragraphs. In this paper, we present a simple yet effective technique for answer-aware question generation from paragraphs. We augment a basic sequence-to-sequence QG model with dynamic, paragraph-specific dictionary and copy attention that is persistent across the corpus, without requiring features generated by sophisticated NLP pipelines or handcrafted rules. Our evaluation on SQuAD shows that our model significantly outperforms current state-of-the-art systems in question generation from paragraphs in both automatic and human evaluation. We achieve a 6-point improvement over the best system on BLEU-4, from 16.38 to 22.62",
    "checked": true,
    "id": "035d6474c7879f3d65af5cc844b294b5d130d4d2",
    "semantic_title": "vocabulary matters: a simple yet effective approach to paragraph-level question generation",
    "citation_count": 1,
    "authors": [
      "Vishwajeet Kumar",
      "Manish Joshi",
      "Ganesh Ramakrishnan",
      "Yuan-Fang Li"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.79": {
    "title": "From Hero to Zroe: A Benchmark of Low-Level Adversarial Attacks",
    "volume": "main",
    "abstract": "Adversarial attacks are label-preserving modifications to inputs of machine learning classifiers designed to fool machines but not humans. Natural Language Processing (NLP) has mostly focused on high-level attack scenarios such as paraphrasing input texts. We argue that these are less realistic in typical application scenarios such as in social media, and instead focus on low-level attacks on the character-level. Guided by human cognitive abilities and human robustness, we propose the first large-scale catalogue and benchmark of low-level adversarial attacks, which we dub Zroe, encompassing nine different attack modes including visual and phonetic adversaries. We show that RoBERTa, NLP's current workhorse, fails on our attacks. Our dataset provides a benchmark for testing robustness of future more human-like NLP models",
    "checked": true,
    "id": "335a05c16fcbc7a2c2bf5221299de608b08030f0",
    "semantic_title": "from hero to zroe: a benchmark of low-level adversarial attacks",
    "citation_count": 40,
    "authors": [
      "Steffen Eger",
      "Yannik Benz"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.80": {
    "title": "Point-of-Interest Type Inference from Social Media Text",
    "volume": "main",
    "abstract": "Physical places help shape how we perceive the experiences we have there. We study the relationship between social media text and the type of the place from where it was posted, whether a park, restaurant, or someplace else. To facilitate this, we introduce a novel data set of ~200,000 English tweets published from 2,761 different points-of-interest in the U.S., enriched with place type information. We train classifiers to predict the type of the location a tweet was sent from that reach a macro F1 of 43.67 across eight classes and uncover the linguistic markers associated with each type of place. The ability to predict semantic place information from a tweet has applications in recommendation systems, personalization services and cultural geography",
    "checked": true,
    "id": "8380c12956a7d72988d6b42ae3d510341b4f088e",
    "semantic_title": "point-of-interest type inference from social media text",
    "citation_count": 9,
    "authors": [
      "Danae Snchez Villegas",
      "Daniel Preotiuc-Pietro",
      "Nikolaos Aletras"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.81": {
    "title": "Reconstructing Event Regions for Event Extraction via Graph Attention Networks",
    "volume": "main",
    "abstract": "Event information is usually scattered across multiple sentences within a document. The local sentence-level event extractors often yield many noisy event role filler extractions in the absence of a broader view of the document-level context. Filtering spurious extractions and aggregating event information in a document remains a challenging problem. Following the observation that a document has several relevant event regions densely populated with event role fillers, we build graphs with candidate role filler extractions enriched by sentential embeddings as nodes, and use graph attention networks to identify event regions in a document and aggregate event information. We characterize edges between candidate extractions in a graph into rich vector representations to facilitate event region identification. The experimental results on two datasets of two languages show that our approach yields new state-of-the-art performance for the challenging event extraction task",
    "checked": true,
    "id": "89218908aeada40fd97e67ed998f5cdd398cc971",
    "semantic_title": "reconstructing event regions for event extraction via graph attention networks",
    "citation_count": 8,
    "authors": [
      "Pei Chen",
      "Hang Yang",
      "Kang Liu",
      "Ruihong Huang",
      "Yubo Chen",
      "Taifeng Wang",
      "Jun Zhao"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.82": {
    "title": "Recipe Instruction Semantics Corpus (RISeC): Resolving Semantic Structure and Zero Anaphora in Recipes",
    "volume": "main",
    "abstract": "We propose a newly annotated dataset for information extraction on recipes. Unlike previous approaches to machine comprehension of procedural texts, we avoid a priori pre-defining domain-specific predicates to recognize (e.g., the primitive instructionsin MILK) and focus on basic understanding of the expressed semantics rather than directly reduce them to a simplified state representation (e.g., ProPara). We thus frame the semantic comprehension of procedural text such as recipes, as fairly generic NLP subtasks, covering (i) entity recognition (ingredients, tools and actions), (ii) relation extraction (what ingredients and tools are involved in the actions), and (iii) zero anaphora resolution (link actions to implicit arguments, e.g., results from previous recipe steps). Further, our Recipe Instruction Semantic Corpus (RISeC) dataset includes textual descriptions for the zero anaphora, to facilitate language generation thereof. Besides the dataset itself, we contribute a pipeline neural architecture that addresses entity and relation extractionas well an identification of zero anaphora. These basic building blocks can facilitate more advanced downstream applications (e.g., question answering, conversational agents)",
    "checked": true,
    "id": "43f5fcb6eb40de119d7e2919f42a269cca95c51b",
    "semantic_title": "recipe instruction semantics corpus (risec): resolving semantic structure and zero anaphora in recipes",
    "citation_count": 14,
    "authors": [
      "Yiwei Jiang",
      "Klim Zaporojets",
      "Johannes Deleu",
      "Thomas Demeester",
      "Chris Develder"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.83": {
    "title": "Stronger Baselines for Grammatical Error Correction Using a Pretrained Encoder-Decoder Model",
    "volume": "main",
    "abstract": "Studies on grammatical error correction (GEC) have reported on the effectiveness of pretraining a Seq2Seq model with a large amount of pseudodata. However, this approach requires time-consuming pretraining of GEC because of the size of the pseudodata. In this study, we explored the utility of bidirectional and auto-regressive transformers (BART) as a generic pretrained encoder-decoder model for GEC. With the use of this generic pretrained model for GEC, the time-consuming pretraining can be eliminated. We find that monolingual and multilingual BART models achieve high performance in GEC, with one of the results being comparable to the current strong results in English GEC",
    "checked": true,
    "id": "9ee000a2b042b77d4fbb2edd9e3a9032265d4759",
    "semantic_title": "stronger baselines for grammatical error correction using a pretrained encoder-decoder model",
    "citation_count": 44,
    "authors": [
      "Satoru Katsumata",
      "Mamoru Komachi"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.84": {
    "title": "Sina Mandarin Alphabetical Words:A Web-driven Code-mixing Lexical Resource",
    "volume": "main",
    "abstract": "Mandarin Alphabetical Word (MAW) is one indispensable component of Modern Chinese that demonstrates unique code-mixing idiosyncrasies influenced by language exchanges. Yet, this interesting phenomenon has not been properly addressed and is mostly excluded from the Chinese language system. This paper addresses the core problem of MAW identification and proposes to construct a large collection of MAWs from Sina Weibo (SMAW) using an automatic web-based technique which includes rule-based identification, informatics-based extraction, as well as Baidu search engine validation. A collection of 16,207 qualified SMAWs are obtained using this technique along with an annotated corpus of more than 200,000 sentences for linguistic research and applicable inquiries",
    "checked": true,
    "id": "d781d1557565a85bf2938fe2fd02c640bb1f8160",
    "semantic_title": "sina mandarin alphabetical words:a web-driven code-mixing lexical resource",
    "citation_count": 3,
    "authors": [
      "Rong Xiang",
      "Mingyu Wan",
      "Qi Su",
      "Chu-Ren Huang",
      "Qin Lu"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.85": {
    "title": "IndoNLU: Benchmark and Resources for Evaluating Indonesian Natural Language Understanding",
    "volume": "main",
    "abstract": "Although Indonesian is known to be the fourth most frequently used language over the internet, the research progress on this language in natural language processing (NLP) is slow-moving due to a lack of available resources. In response, we introduce the first-ever vast resource for training, evaluation, and benchmarking on Indonesian natural language understanding (IndoNLU) tasks. IndoNLU includes twelve tasks, ranging from single sentence classification to pair-sentences sequence labeling with different levels of complexity. The datasets for the tasks lie in different domains and styles to ensure task diversity. We also provide a set of Indonesian pre-trained models (IndoBERT) trained from a large and clean Indonesian dataset (Indo4B) collected from publicly available sources such as social media texts, blogs, news, and websites. We release baseline models for all twelve tasks, as well as the framework for benchmark evaluation, thus enabling everyone to benchmark their system performances",
    "checked": true,
    "id": "03f22e693a0c00bae8a66a64a2fecb0f11a4b034",
    "semantic_title": "indonlu: benchmark and resources for evaluating indonesian natural language understanding",
    "citation_count": 204,
    "authors": [
      "Bryan Wilie",
      "Karissa Vincentio",
      "Genta Indra Winata",
      "Samuel Cahyawijaya",
      "Xiaohong Li",
      "Zhi Yuan Lim",
      "Sidik Soleman",
      "Rahmad Mahendra",
      "Pascale Fung",
      "Syafri Bahar",
      "Ayu Purwarianti"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.86": {
    "title": "Happy Are Those Who Grade without Seeing: A Multi-Task Learning Approach to Grade Essays Using Gaze Behaviour",
    "volume": "main",
    "abstract": "The gaze behaviour of a reader is helpful in solving several NLP tasks such as automatic essay grading. However, collecting gaze behaviour from readers is costly in terms of time and money. In this paper, we propose a way to improve automatic essay grading using gaze behaviour, which is learnt at run time using a multi-task learning framework. To demonstrate the efficacy of this multi-task learning based approach to automatic essay grading, we collect gaze behaviour for 48 essays across 4 essay sets, and learn gaze behaviour for the rest of the essays, numbering over 7000 essays. Using the learnt gaze behaviour, we can achieve a statistically significant improvement in performance over the state-of-the-art system for the essay sets where we have gaze data. We also achieve a statistically significant improvement for 4 other essay sets, numbering about 6000 essays, where we have no gaze behaviour data available. Our approach establishes that learning gaze behaviour improves automatic essay grading",
    "checked": true,
    "id": "58ae312839884711cc041d19a3da991ce4ed5984",
    "semantic_title": "happy are those who grade without seeing: a multi-task learning approach to grade essays using gaze behaviour",
    "citation_count": 6,
    "authors": [
      "Sandeep Mathias",
      "Rudra Murthy",
      "Diptesh Kanojia",
      "Abhijit Mishra",
      "Pushpak Bhattacharyya"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.87": {
    "title": "Multi-Source Attention for Unsupervised Domain Adaptation",
    "volume": "main",
    "abstract": "We model source-selection in multi-source Unsupervised Domain Adaptation (UDA) as an attention-learning problem, where we learn attention over the sources per given target instance. We first independently learn source-specific classification models, and a relatedness map between sources and target domains using pseudo-labelled target domain instances. Next, we learn domain-attention scores over the sources for aggregating the predictions of the source-specific models. Experimental results on two cross-domain sentiment classification datasets show that the proposed method reports consistently good performance across domains, and at times outperforming more complex prior proposals. Moreover, the computed domain-attention scores enable us to find explanations for the predictions made by the proposed method",
    "checked": true,
    "id": "6ca329bfc083ce34e8f2a746f67f4bb1cd7f40ad",
    "semantic_title": "multi-source attention for unsupervised domain adaptation",
    "citation_count": 8,
    "authors": [
      "Xia Cui",
      "Danushka Bollegala"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.88": {
    "title": "Compressing Pre-trained Language Models by Matrix Decomposition",
    "volume": "main",
    "abstract": "Large pre-trained language models reach state-of-the-art results on many different NLP tasks when fine-tuned individually; They also come with a significant memory and computational requirements, calling for methods to reduce model sizes (green AI). We propose a two-stage model-compression method to reduce a model's inference time cost. We first decompose the matrices in the model into smaller matrices and then perform feature distillation on the internal representation to recover from the decomposition. This approach has the benefit of reducing the number of parameters while preserving much of the information within the model. We experimented on BERT-base model with the GLUE benchmark dataset and show that we can reduce the number of parameters by a factor of 0.4x, and increase inference speed by a factor of 1.45x, while maintaining a minimal loss in metric performance",
    "checked": true,
    "id": "b60a16d2978b10ead102a6a6cd03dc940b1194cc",
    "semantic_title": "compressing pre-trained language models by matrix decomposition",
    "citation_count": 56,
    "authors": [
      "Matan Ben Noach",
      "Yoav Goldberg"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.89": {
    "title": "You May Like This Hotel Because ...: Identifying Evidence for Explainable Recommendations",
    "volume": "main",
    "abstract": "Explainable recommendation is a good way to improve user satisfaction. However, explainable recommendation in dialogue is challenging since it has to handle natural language as both input and output. To tackle the challenge, this paper proposes a novel and practical task to explain evidences in recommending hotels given vague requests expressed freely in natural language. We decompose the process into two subtasks on hotel reviews: Evidence Identification and Evidence Explanation. The former predicts whether or not a sentence contains evidence that expresses why a given request is satisfied. The latter generates a recommendation sentence given a request and an evidence sentence. In order to address these subtasks, we build an Evidence-based Explanation dataset, which is the largest dataset for explaining evidences in recommending hotels for vague requests. The experimental results demonstrate that the BERT model can find evidence sentences with respect to various vague requests and that the LSTM-based model can generate recommendation sentences",
    "checked": true,
    "id": "f33df36446f241c716fb10e4f8eba1f253aa8182",
    "semantic_title": "you may like this hotel because ...: identifying evidence for explainable recommendations",
    "citation_count": 2,
    "authors": [
      "Shin Kanouchi",
      "Masato Neishi",
      "Yuta Hayashibe",
      "Hiroki Ouchi",
      "Naoaki Okazaki"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.90": {
    "title": "A Unified Framework for Multilingual and Code-Mixed Visual Question Answering",
    "volume": "main",
    "abstract": "In this paper, we propose an effective deep learning framework for multilingual and code- mixed visual question answering. The pro- posed model is capable of predicting answers from the questions in Hindi, English or Code- mixed (Hinglish: Hindi-English) languages. The majority of the existing techniques on Vi- sual Question Answering (VQA) focus on En- glish questions only. However, many applica- tions such as medical imaging, tourism, visual assistants require a multilinguality-enabled module for their widespread usages. As there is no available dataset in English-Hindi VQA, we firstly create Hindi and Code-mixed VQA datasets by exploiting the linguistic properties of these languages. We propose a robust tech- nique capable of handling the multilingual and code-mixed question to provide the answer against the visual information (image). To better encode the multilingual and code-mixed questions, we introduce a hierarchy of shared layers. We control the behaviour of these shared layers by an attention-based soft layer sharing mechanism, which learns how shared layers are applied in different ways for the dif- ferent languages of the question. Further, our model uses bi-linear attention with a residual connection to fuse the language and image fea- tures. We perform extensive evaluation and ablation studies for English, Hindi and Code- mixed VQA. The evaluation shows that the proposed multilingual model achieves state-of- the-art performance in all these settings",
    "checked": true,
    "id": "6ba2a128dd8dadc2925b3b9c01fb6db01bd75066",
    "semantic_title": "a unified framework for multilingual and code-mixed visual question answering",
    "citation_count": 11,
    "authors": [
      "Deepak Gupta",
      "Pabitra Lenka",
      "Asif Ekbal",
      "Pushpak Bhattacharyya"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.91": {
    "title": "Toxic Language Detection in Social Media for Brazilian Portuguese: New Dataset and Multilingual Analysis",
    "volume": "main",
    "abstract": "Hate speech and toxic comments are a common concern of social media platform users. Although these comments are, fortunately, the minority in these platforms, they are still capable of causing harm. Therefore, identifying these comments is an important task for studying and preventing the proliferation of toxicity in social media. Previous work in automatically detecting toxic comments focus mainly in English, with very few work in languages like Brazilian Portuguese. In this paper, we propose a new large-scale dataset for Brazilian Portuguese with tweets annotated as either toxic or non-toxic or in different types of toxicity. We present our dataset collection and annotation process, where we aimed to select candidates covering multiple demographic groups. State-of-the-art BERT models were able to achieve 76% macro-F1 score using monolingual data in the binary case. We also show that large-scale monolingual data is still needed to create more accurate models, despite recent advances in multilingual approaches. An error analysis and experiments with multi-label classification show the difficulty of classifying certain types of toxic comments that appear less frequently in our data and highlights the need to develop models that are aware of different categories of toxicity",
    "checked": true,
    "id": "c658f549110e7d940a84ae8b4513b65945330fa6",
    "semantic_title": "toxic language detection in social media for brazilian portuguese: new dataset and multilingual analysis",
    "citation_count": 82,
    "authors": [
      "Joo Augusto Leite",
      "Diego Silva",
      "Kalina Bontcheva",
      "Carolina Scarton"
    ]
  },
  "https://aclanthology.org/2020.aacl-main.92": {
    "title": "Measuring What Counts: The Case of Rumour Stance Classification",
    "volume": "main",
    "abstract": "Stance classification can be a powerful tool for understanding whether and which users believe in online rumours. The task aims to automatically predict the stance of replies towards a given rumour, namely support, deny, question, or comment. Numerous methods have been proposed and their performance compared in the RumourEval shared tasks in 2017 and 2019. Results demonstrated that this is a challenging problem since naturally occurring rumour stance data is highly imbalanced. This paper specifically questions the evaluation metrics used in these shared tasks. We re-evaluate the systems submitted to the two RumourEval tasks and show that the two widely adopted metrics  accuracy and macro-F1  are not robust for the four-class imbalanced task of rumour stance classification, as they wrongly favour systems with highly skewed accuracy towards the majority class. To overcome this problem, we propose new evaluation metrics for rumour stance detection. These are not only robust to imbalanced data but also score higher systems that are capable of recognising the two most informative minority classes (support and deny)",
    "checked": true,
    "id": "eb5156bfdfa45476a200b5c9df48b960f5567c44",
    "semantic_title": "measuring what counts: the case of rumour stance classification",
    "citation_count": 6,
    "authors": [
      "Carolina Scarton",
      "Diego Silva",
      "Kalina Bontcheva"
    ]
  }
}