{
  "https://openreview.net/forum?id=BkbY4psgg": {
    "title": "Making Neural Programming Architectures Generalize via Recursion",
    "volume": "oral",
    "abstract": "Empirically, neural networks that attempt to learn programs from data have exhibited poor generalizability. Moreover, it has traditionally been difficult to reason about the behavior of these models beyond a certain level of input complexity. In order to address these issues, we propose augmenting neural architectures with a key abstraction: recursion. As an application, we implement recursion in the Neural Programmer-Interpreter framework on four tasks: grade-school addition, bubble sort, topological sort, and quicksort. We demonstrate superior generalizability and interpretability with small amounts of training data. Recursion divides the problem into smaller pieces and drastically reduces the domain of each neural network component, making it tractable to prove guarantees about the overall system's behavior. Our experience suggests that in order for neural architectures to robustly learn program semantics, it is necessary to incorporate a concept like recursion",
    "checked": true,
    "id": "6b024162f81e8ff7aa34c3a43d601a912d012c78",
    "semantic_title": "making neural programming architectures generalize via recursion",
    "citation_count": 147,
    "authors": []
  },
  "https://openreview.net/forum?id=Hk4_qw5xe": {
    "title": "Towards Principled Methods for Training Generative Adversarial Networks",
    "volume": "oral",
    "abstract": "The goal of this paper is not to introduce a single algorithm or method, but to make theoretical steps towards fully understanding the training dynamics of gen- erative adversarial networks. In order to substantiate our theoretical analysis, we perform targeted experiments to verify our assumptions, illustrate our claims, and quantify the phenomena. This paper is divided into three sections. The first sec- tion introduces the problem at hand. The second section is dedicated to studying and proving rigorously the problems including instability and saturation that arize when training generative adversarial networks. The third section examines a prac- tical and theoretically grounded direction towards solving these problems, while introducing new tools to study them",
    "checked": true,
    "id": "9a700c7a7e7468e436f00c34551fbe3e0f70e42f",
    "semantic_title": "towards principled methods for training generative adversarial networks",
    "citation_count": 2117,
    "authors": []
  },
  "https://openreview.net/forum?id=S1Bb3D5gg": {
    "title": "Learning End-to-End Goal-Oriented Dialog",
    "volume": "oral",
    "abstract": "Traditional dialog systems used in goal-oriented applications require a lot of domain-specific handcrafting, which hinders scaling up to new domains. End- to-end dialog systems, in which all components are trained from the dialogs themselves, escape this limitation. But the encouraging success recently obtained in chit-chat dialog may not carry over to goal-oriented settings. This paper proposes a testbed to break down the strengths and shortcomings of end-to-end dialog systems in goal-oriented applications. Set in the context of restaurant reservation, our tasks require manipulating sentences and symbols, so as to properly conduct conversations, issue API calls and use the outputs of such calls. We show that an end-to-end dialog system based on Memory Networks can reach promising, yet imperfect, performance and learn to perform non-trivial operations. We confirm those results by comparing our system to a hand-crafted slot-filling baseline on data from the second Dialog State Tracking Challenge (Henderson et al., 2014a). We show similar result patterns on data extracted from an online concierge service",
    "checked": true,
    "id": "f81be44000814e7bcb12ae04b4e2d9c01b6515b3",
    "semantic_title": "learning end-to-end goal-oriented dialog",
    "citation_count": 782,
    "authors": []
  },
  "https://openreview.net/forum?id=r1Ue8Hcxg": {
    "title": "Neural Architecture Search with Reinforcement Learning",
    "volume": "oral",
    "abstract": "Neural networks are powerful and flexible models that work well for many difficult learning tasks in image, speech and natural language understanding. Despite their success, neural networks are still hard to design. In this paper, we use a recurrent network to generate the model descriptions of neural networks and train this RNN with reinforcement learning to maximize the expected accuracy of the generated architectures on a validation set. On the CIFAR-10 dataset, our method, starting from scratch, can design a novel network architecture that rivals the best human-invented architecture in terms of test set accuracy. Our CIFAR-10 model achieves a test error rate of 3.65, which is 0.09 percent better and 1.05x faster than the previous state-of-the-art model that used a similar architectural scheme. On the Penn Treebank dataset, our model can compose a novel recurrent cell that outperforms the widely-used LSTM cell, and other state-of-the-art baselines. Our cell achieves a test set perplexity of 62.4 on the Penn Treebank, which is 3.6 perplexity better than the previous state-of-the-art model. The cell can also be transferred to the character language modeling task on PTB and achieves a state-of-the-art perplexity of 1.214",
    "checked": true,
    "id": "67d968c7450878190e45ac7886746de867bf673d",
    "semantic_title": "neural architecture search with reinforcement learning",
    "citation_count": 5392,
    "authors": []
  },
  "https://openreview.net/forum?id=S1RP6GLle": {
    "title": "Amortised MAP Inference for Image Super-resolution",
    "volume": "oral",
    "abstract": "Image super-resolution (SR) is an underdetermined inverse problem, where a large number of plausible high resolution images can explain the same downsampled image. Most current single image SR methods use empirical risk minimisation, often with a pixel-wise mean squared error (MSE) loss. However, the outputs from such methods tend to be blurry, over-smoothed and generally appear implausible. A more desirable approach would employ Maximum a Posteriori (MAP) inference, preferring solutions that always have a high probability under the image prior, and thus appear more plausible. Direct MAP estimation for SR is non-trivial, as it requires us to build a model for the image prior from samples. Here we introduce new methods for \\emph{amortised MAP inference} whereby we calculate the MAP estimate directly using a convolutional neural network. We first introduce a novel neural network architecture that performs a projection to the affine subspace of valid SR solutions ensuring that the high resolution output of the network is always consistent with the low resolution input. We show that, using this architecture, the amortised MAP inference problem reduces to minimising the cross-entropy between two distributions, similar to training generative models. We propose three methods to solve this optimisation problem: (1) Generative Adversarial Networks (GAN) (2) denoiser-guided SR which backpropagates gradient-estimates from denoising to train the network, and (3) a baseline method using a maximum-likelihood-trained image prior. Our experiments show that the GAN based approach performs best on real image data. Lastly, we establish a connection between GANs and amortised variational inference as in e.g. variational autoencoders",
    "checked": true,
    "id": "3c7092347a5b7804d9534b6f3f52032c1502cbf8",
    "semantic_title": "amortised map inference for image super-resolution",
    "citation_count": 435,
    "authors": []
  },
  "https://openreview.net/forum?id=H1oyRlYgg": {
    "title": "On Large-Batch Training for Deep Learning: Generalization Gap and Sharp Minima",
    "volume": "oral",
    "abstract": "The stochastic gradient descent (SGD) method and its variants are algorithms of choice for many Deep Learning tasks. These methods operate in a small-batch regime wherein a fraction of the training data, say $32$--$512$ data points, is sampled to compute an approximation to the gradient. It has been observed in practice that when using a larger batch there is a degradation in the quality of the model, as measured by its ability to generalize. We investigate the cause for this generalization drop in the large-batch regime and present numerical evidence that supports the view that large-batch methods tend to converge to sharp minimizers of the training and testing functions---and as is well known, sharp minima lead to poorer generalization. In contrast, small-batch methods consistently converge to flat minimizers, and our experiments support a commonly held view that this is due to the inherent noise in the gradient estimation. We discuss several strategies to attempt to help large-batch methods eliminate this generalization gap",
    "checked": true,
    "id": "8ec5896b4490c6e127d1718ffc36a3439d84cb81",
    "semantic_title": "on large-batch training for deep learning: generalization gap and sharp minima",
    "citation_count": 2947,
    "authors": []
  },
  "https://openreview.net/forum?id=HkwoSDPgg": {
    "title": "Semi-supervised Knowledge Transfer for Deep Learning from Private Training Data",
    "volume": "oral",
    "abstract": "Some machine learning applications involve training data that is sensitive, such as the medical histories of patients in a clinical trial. A model may inadvertently and implicitly store some of its training data; careful analysis of the model may therefore reveal sensitive information. To address this problem, we demonstrate a generally applicable approach to providing strong privacy guarantees for training data: Private Aggregation of Teacher Ensembles (PATE). The approach combines, in a black-box fashion, multiple models trained with disjoint datasets, such as records from different subsets of users. Because they rely directly on sensitive data, these models are not published, but instead used as ''teachers'' for a ''student'' model. The student learns to predict an output chosen by noisy voting among all of the teachers, and cannot directly access an individual teacher or the underlying data or parameters. The student's privacy properties can be understood both intuitively (since no single teacher and thus no single dataset dictates the student's training) and formally, in terms of differential privacy. These properties hold even if an adversary can not only query the student but also inspect its internal workings. Compared with previous work, the approach imposes only weak assumptions on how teachers are trained: it applies to any model, including non-convex models like DNNs. We achieve state-of-the-art privacy/utility trade-offs on MNIST and SVHN thanks to an improved privacy analysis and semi-supervised learning",
    "checked": true,
    "id": "e70b9a38fcf8373865dd6e7b45e45cca7ff2eaa9",
    "semantic_title": "semi-supervised knowledge transfer for deep learning from private training data",
    "citation_count": 1022,
    "authors": []
  },
  "https://openreview.net/forum?id=HJ0NvFzxl": {
    "title": "Learning Graphical State Transitions",
    "volume": "oral",
    "abstract": "Graph-structured data is important in modeling relationships between multiple entities, and can be used to represent states of the world as well as many data structures. Li et al. (2016) describe a model known as a Gated Graph Sequence Neural Network (GGS-NN) that produces sequences from graph-structured input. In this work I introduce the Gated Graph Transformer Neural Network (GGT-NN), an extension of GGS-NNs that uses graph-structured data as an intermediate representation. The model can learn to construct and modify graphs in sophisticated ways based on textual input, and also to use the graphs to produce a variety of outputs. For example, the model successfully learns to solve almost all of the bAbI tasks (Weston et al., 2016), and also discovers the rules governing graphical formulations of a simple cellular automaton and a family of Turing machines",
    "checked": true,
    "id": "edbc873a248768a626ef2bc57b3d1eff30de0e11",
    "semantic_title": "learning graphical state transitions",
    "citation_count": 98,
    "authors": []
  },
  "https://openreview.net/forum?id=Hk8N3Sclg": {
    "title": "Multi-Agent Cooperation and the Emergence of (Natural) Language",
    "volume": "oral",
    "abstract": "The current mainstream approach to train natural language systems is to expose them to large amounts of text. This passive learning is problematic if we are in- terested in developing interactive machines, such as conversational agents. We propose a framework for language learning that relies on multi-agent communi- cation. We study this learning in the context of referential games. In these games, a sender and a receiver see a pair of images. The sender is told one of them is the target and is allowed to send a message to the receiver, while the receiver must rely on it to identify the target. Thus, the agents develop their own language interactively out of the need to communicate. We show that two networks with simple configurations are able to learn to coordinate in the referential game. We further explore whether the \"word meanings\" induced in the game reflect intuitive semantic properties of the objects depicted in the image, and we present a simple strategy for grounding the agents' code into natural language, a necessary step in developing machines that should eventually be able to communicate with humans",
    "checked": true,
    "id": "f91d1db0fa2ac12e0262a8f5e6a371da29a3c100",
    "semantic_title": "multi-agent cooperation and the emergence of (natural) language",
    "citation_count": 434,
    "authors": []
  },
  "https://openreview.net/forum?id=rJY0-Kcll": {
    "title": "Optimization as a Model for Few-Shot Learning",
    "volume": "oral",
    "abstract": "Though deep neural networks have shown great success in the large data domain, they generally perform poorly on few-shot learning tasks, where a model has to quickly generalize after seeing very few examples from each class. The general belief is that gradient-based optimization in high capacity models requires many iterative steps over many examples to perform well. Here, we propose an LSTM-based meta-learner model to learn the exact optimization algorithm used to train another learner neural network in the few-shot regime. The parametrization of our model allows it to learn appropriate parameter updates specifically for the scenario where a set amount of updates will be made, while also learning a general initialization of the learner network that allows for quick convergence of training. We demonstrate that this meta-learning model is competitive with deep metric-learning techniques for few-shot learning",
    "checked": true,
    "id": "29c887794eed2ca9462638ff853e6fe1ab91d5d8",
    "semantic_title": "optimization as a model for few-shot learning",
    "citation_count": 3407,
    "authors": []
  },
  "https://openreview.net/forum?id=rJLS7qKel": {
    "title": "Learning to Act by Predicting the Future",
    "volume": "oral",
    "abstract": "We present an approach to sensorimotor control in immersive environments. Our approach utilizes a high-dimensional sensory stream and a lower-dimensional measurement stream. The cotemporal structure of these streams provides a rich supervisory signal, which enables training a sensorimotor control model by interacting with the environment. The model is trained using supervised learning techniques, but without extraneous supervision. It learns to act based on raw sensory input from a complex three-dimensional environment. The presented formulation enables learning without a fixed goal at training time, and pursuing dynamically changing goals at test time. We conduct extensive experiments in three-dimensional simulations based on the classical first-person game Doom. The results demonstrate that the presented approach outperforms sophisticated prior formulations, particularly on challenging tasks. The results also show that trained models successfully generalize across environments and goals. A model trained using the presented approach won the Full Deathmatch track of the Visual Doom AI Competition, which was held in previously unseen environments",
    "checked": true,
    "id": "4c25f50c7451fa72c562e21e3b11e416b11f74c8",
    "semantic_title": "learning to act by predicting the future",
    "citation_count": 281,
    "authors": []
  },
  "https://openreview.net/forum?id=rJxdQ3jeg": {
    "title": "End-to-end Optimized Image Compression",
    "volume": "oral",
    "abstract": "We describe an image compression method, consisting of a nonlinear analysis transformation, a uniform quantizer, and a nonlinear synthesis transformation. The transforms are constructed in three successive stages of convolutional linear filters and nonlinear activation functions. Unlike most convolutional neural networks, the joint nonlinearity is chosen to implement a form of local gain control, inspired by those used to model biological neurons. Using a variant of stochastic gradient descent, we jointly optimize the entire model for rate-distortion performance over a database of training images, introducing a continuous proxy for the discontinuous loss function arising from the quantizer. Under certain conditions, the relaxed loss function may be interpreted as the log likelihood of a generative model, as implemented by a variational autoencoder. Unlike these models, however, the compression model must operate at any given point along the rate-distortion curve, as specified by a trade-off parameter. Across an independent set of test images, we find that the optimized method generally exhibits better rate-distortion performance than the standard JPEG and JPEG 2000 compression methods. More importantly, we observe a dramatic improvement in visual quality for all images at all bit rates, which is supported by objective quality estimates using MS-SSIM",
    "checked": true,
    "id": "232148b97bd0543613ffd98fb4edcff79434ce1a",
    "semantic_title": "end-to-end optimized image compression",
    "citation_count": 1724,
    "authors": []
  },
  "https://openreview.net/forum?id=SJ3rcZcxl": {
    "title": "Q-Prop: Sample-Efficient Policy Gradient with An Off-Policy Critic",
    "volume": "oral",
    "abstract": "Model-free deep reinforcement learning (RL) methods have been successful in a wide variety of simulated domains. However, a major obstacle facing deep RL in the real world is their high sample complexity. Batch policy gradient methods offer stable learning, but at the cost of high variance, which often requires large batches. TD-style methods, such as off-policy actor-critic and Q-learning, are more sample-efficient but biased, and often require costly hyperparameter sweeps to stabilize. In this work, we aim to develop methods that combine the stability of policy gradients with the efficiency of off-policy RL. We present Q-Prop, a policy gradient method that uses a Taylor expansion of the off-policy critic as a control variate. Q-Prop is both sample efficient and stable, and effectively combines the benefits of on-policy and off-policy methods. We analyze the connection between Q-Prop and existing model-free algorithms, and use control variate theory to derive two variants of Q-Prop with conservative and aggressive adaptation. We show that conservative Q-Prop provides substantial gains in sample efficiency over trust region policy optimization (TRPO) with generalized advantage estimation (GAE), and improves stability over deep deterministic policy gradient (DDPG), the state-of-the-art on-policy and off-policy methods, on OpenAI Gym's MuJoCo continuous control environments",
    "checked": true,
    "id": "524513b6f4ddca331c33bcc70a9f677fa240cfa3",
    "semantic_title": "q-prop: sample-efficient policy gradient with an off-policy critic",
    "citation_count": 345,
    "authors": []
  },
  "https://openreview.net/forum?id=Sy8gdB9xx": {
    "title": "Understanding deep learning requires rethinking generalization",
    "volume": "oral",
    "abstract": "Despite their massive size, successful deep artificial neural networks can exhibit a remarkably small difference between training and test performance. Conventional wisdom attributes small generalization error either to properties of the model family, or to the regularization techniques used during training. Through extensive systematic experiments, we show how these traditional approaches fail to explain why large neural networks generalize well in practice. Specifically, our experiments establish that state-of-the-art convolutional networks for image classification trained with stochastic gradient methods easily fit a random labeling of the training data. This phenomenon is qualitatively unaffected by explicit regularization, and occurs even if we replace the true images by completely unstructured random noise. We corroborate these experimental findings with a theoretical construction showing that simple depth two neural networks already have perfect finite sample expressivity as soon as the number of parameters exceeds the number of data points as it usually does in practice. We interpret our experimental findings by comparison with traditional models",
    "checked": true,
    "id": "54ddb00fa691728944fd8becea90a373d21597cf",
    "semantic_title": "understanding deep learning requires rethinking generalization",
    "citation_count": 4639,
    "authors": []
  },
  "https://openreview.net/forum?id=SJ6yPD5xg": {
    "title": "Reinforcement Learning with Unsupervised Auxiliary Tasks",
    "volume": "oral",
    "abstract": "Deep reinforcement learning agents have achieved state-of-the-art results by directly maximising cumulative reward. However, environments contain a much wider variety of possible training signals. In this paper, we introduce an agent that also maximises many other pseudo-reward functions simultaneously by reinforcement learning. All of these tasks share a common representation that, like unsupervised learning, continues to develop in the absence of extrinsic rewards. We also introduce a novel mechanism for focusing this representation upon extrinsic rewards, so that learning can rapidly adapt to the most relevant aspects of the actual task. Our agent significantly outperforms the previous state-of-the-art on Atari, averaging 880\\% expert human performance, and a challenging suite of first-person, three-dimensional \\emph{Labyrinth} tasks leading to a mean speedup in learning of 10$\\times$ and averaging 87\\% expert human performance on Labyrinth",
    "checked": true,
    "id": "d7bd6e3addd8bc8e2e154048300eea15f030ed33",
    "semantic_title": "reinforcement learning with unsupervised auxiliary tasks",
    "citation_count": 1229,
    "authors": []
  },
  "https://openreview.net/forum?id=S1VaB4cex": {
    "title": "FractalNet: Ultra-Deep Neural Networks without Residuals",
    "volume": "poster",
    "abstract": "We introduce a design strategy for neural network macro-architecture based on self-similarity. Repeated application of a simple expansion rule generates deep networks whose structural layouts are precisely truncated fractals. These networks contain interacting subpaths of different lengths, but do not include any pass-through or residual connections; every internal signal is transformed by a filter and nonlinearity before being seen by subsequent layers. In experiments, fractal networks match the excellent performance of standard residual networks on both CIFAR and ImageNet classification tasks, thereby demonstrating that residual representations may not be fundamental to the success of extremely deep convolutional neural networks. Rather, the key may be the ability to transition, during training, from effectively shallow to deep. We note similarities with student-teacher behavior and develop drop-path, a natural extension of dropout, to regularize co-adaptation of subpaths in fractal architectures. Such regularization allows extraction of high-performance fixed-depth subnetworks. Additionally, fractal networks exhibit an anytime property: shallow subnetworks provide a quick answer, while deeper subnetworks, with higher latency, provide a more accurate answer",
    "checked": true,
    "id": "d0156126edbfc524c8d108bdc0cf811cfe3129aa",
    "semantic_title": "fractalnet: ultra-deep neural networks without residuals",
    "citation_count": 941,
    "authors": []
  },
  "https://openreview.net/forum?id=H1W1UN9gg": {
    "title": "Deep Information Propagation",
    "volume": "poster",
    "abstract": "We study the behavior of untrained neural networks whose weights and biases are randomly distributed using mean field theory. We show the existence of depth scales that naturally limit the maximum depth of signal propagation through these random networks. Our main practical result is to show that random networks may be trained precisely when information can travel through them. Thus, the depth scales that we identify provide bounds on how deep a network may be trained for a specific choice of hyperparameters. As a corollary to this, we argue that in networks at the edge of chaos, one of these depth scales diverges. Thus arbitrarily deep networks may be trained only sufficiently close to criticality. We show that the presence of dropout destroys the order-to-chaos critical point and therefore strongly limits the maximum trainable depth for random networks. Finally, we develop a mean field theory for backpropagation and we show that the ordered and chaotic phases correspond to regions of vanishing and exploding gradient respectively",
    "checked": true,
    "id": "4fdc7df2c737141a1bf5aec27a438b77d01f8af0",
    "semantic_title": "deep information propagation",
    "citation_count": 371,
    "authors": []
  },
  "https://openreview.net/forum?id=SJGCiw5gl": {
    "title": "Pruning Convolutional Neural Networks for Resource Efficient Inference",
    "volume": "poster",
    "abstract": "We propose a new formulation for pruning convolutional kernels in neural networks to enable efficient inference. We interleave greedy criteria-based pruning with fine-tuning by backpropagation-a computationally efficient procedure that maintains good generalization in the pruned network. We propose a new criterion based on Taylor expansion that approximates the change in the cost function induced by pruning network parameters. We focus on transfer learning, where large pretrained networks are adapted to specialized tasks. The proposed criterion demonstrates superior performance compared to other criteria, e.g. the norm of kernel weights or feature map activation, for pruning large CNNs after adaptation to fine-grained classification tasks (Birds-200 and Flowers-102) relaying only on the first order gradient information. We also show that pruning can lead to more than 10x theoretical reduction in adapted 3D-convolutional filters with a small drop in accuracy in a recurrent gesture classifier. Finally, we show results for the large-scale ImageNet dataset to emphasize the flexibility of our approach",
    "checked": true,
    "id": "3db8730c203f88d7f08a6a99e8c02a077dc9b011",
    "semantic_title": "pruning convolutional neural networks for resource efficient inference",
    "citation_count": 1972,
    "authors": []
  },
  "https://openreview.net/forum?id=r1VdcHcxx": {
    "title": "Recurrent Batch Normalization",
    "volume": "poster",
    "abstract": "We propose a reparameterization of LSTM that brings the benefits of batch normalization to recurrent neural networks. Whereas previous works only apply batch normalization to the input-to-hidden transformation of RNNs, we demonstrate that it is both possible and beneficial to batch-normalize the hidden-to-hidden transition, thereby reducing internal covariate shift between time steps. We evaluate our proposal on various sequential problems such as sequence classification, language modeling and question answering. Our empirical results show that our batch-normalized LSTM consistently leads to faster convergence and improved generalization",
    "checked": true,
    "id": "952454718139dba3aafc6b3b67c4f514ac3964af",
    "semantic_title": "recurrent batch normalization",
    "citation_count": 411,
    "authors": []
  },
  "https://openreview.net/forum?id=Sy2fzU9gl": {
    "title": "beta-VAE: Learning Basic Visual Concepts with a Constrained Variational Framework",
    "volume": "poster",
    "abstract": "Learning an interpretable factorised representation of the independent data generative factors of the world without supervision is an important precursor for the development of artificial intelligence that is able to learn and reason in the same way that humans do. We introduce beta-VAE, a new state-of-the-art framework for automated discovery of interpretable factorised latent representations from raw image data in a completely unsupervised manner. Our approach is a modification of the variational autoencoder (VAE) framework. We introduce an adjustable hyperparameter beta that balances latent channel capacity and independence constraints with reconstruction accuracy. We demonstrate that beta-VAE with appropriately tuned beta > 1 qualitatively outperforms VAE (beta = 1), as well as state of the art unsupervised (InfoGAN) and semi-supervised (DC-IGN) approaches to disentangled factor learning on a variety of datasets (celebA, faces and chairs). Furthermore, we devise a protocol to quantitatively compare the degree of disentanglement learnt by different models, and show that our approach also significantly outperforms all baselines quantitatively. Unlike InfoGAN, beta-VAE is stable to train, makes few assumptions about the data and relies on tuning a single hyperparameter, which can be directly optimised through a hyper parameter search using weakly labelled data or through heuristic visual inspection for purely unsupervised data",
    "checked": true,
    "id": "6f7af4709e399e89ba898efc3459cb844fa0e981",
    "semantic_title": "beta-vae: learning basic visual concepts with a constrained variational framework",
    "citation_count": 0,
    "authors": []
  },
  "https://openreview.net/forum?id=B1hdzd5lg": {
    "title": "Words or Characters? Fine-grained Gating for Reading Comprehension",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b7ffc8f44f7dafd7f51e4e7500842ec406b8e239",
    "semantic_title": "words or characters? fine-grained gating for reading comprehension",
    "citation_count": 101,
    "authors": []
  },
  "https://openreview.net/forum?id=Bks8cPcxe": {
    "title": "DeepDSL: A Compilation-based Domain-Specific Language for Deep Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8902ce81d33571d62445e6152aac1d03a426049a",
    "semantic_title": "deepdsl: a compilation-based domain-specific language for deep learning",
    "citation_count": 8,
    "authors": []
  },
  "https://openreview.net/forum?id=rkpACe1lx": {
    "title": "HyperNetworks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "563783de03452683a9206e85fe6d661714436686",
    "semantic_title": "hypernetworks",
    "citation_count": 1637,
    "authors": []
  },
  "https://openreview.net/forum?id=BydARw9ex": {
    "title": "Capacity and Trainability in Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "401d68e1a930b0f7e02030cab4c185fb1839cb11",
    "semantic_title": "capacity and trainability in recurrent neural networks",
    "citation_count": 205,
    "authors": []
  },
  "https://openreview.net/forum?id=HJGODLqgx": {
    "title": "Recurrent Hidden Semi-Markov Model",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "e20d94e43a20315f76067a00d67e4f7523ca7311",
    "semantic_title": "recurrent hidden semi-markov model",
    "citation_count": 37,
    "authors": []
  },
  "https://openreview.net/forum?id=S11KBYclx": {
    "title": "Learning Curve Prediction with Bayesian Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "925cab60b1795c94ae6f488fda7ad71be71b5822",
    "semantic_title": "learning curve prediction with bayesian neural networks",
    "citation_count": 260,
    "authors": []
  },
  "https://openreview.net/forum?id=SyK00v5xx": {
    "title": "A Simple but Tough-to-Beat Baseline for Sentence Embeddings",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "3f1802d3f4f5f6d66875dac09112f978f12e1e1e",
    "semantic_title": "a simple but tough-to-beat baseline for sentence embeddings",
    "citation_count": 1313,
    "authors": []
  },
  "https://openreview.net/forum?id=B1GOWV5eg": {
    "title": "Learning to Repeat: Fine Grained Action Repetition for Deep Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": false,
    "id": "2d6075ffa9ef3fbfe338bfeb469a50883242bdcd",
    "semantic_title": "deep reinforcement learning",
    "citation_count": 84,
    "authors": []
  },
  "https://openreview.net/forum?id=B184E5qee": {
    "title": "Improving Neural Language Models with a Continuous Cache",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2d7782c225e0fc123d6e227f2cb253e58279ac73",
    "semantic_title": "improving neural language models with a continuous cache",
    "citation_count": 303,
    "authors": []
  },
  "https://openreview.net/forum?id=BJYwwY9ll": {
    "title": "Snapshot Ensembles: Train 1, Get M for Free",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b134d0911e2e13ac169ffa5f478a39e6ef77869a",
    "semantic_title": "snapshot ensembles: train 1, get m for free",
    "citation_count": 954,
    "authors": []
  },
  "https://openreview.net/forum?id=HJGwcKclx": {
    "title": "Soft Weight-Sharing for Neural Network Compression",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "ac37a459c46a464ac1326c821ba7d5595b50f1af",
    "semantic_title": "soft weight-sharing for neural network compression",
    "citation_count": 421,
    "authors": []
  },
  "https://openreview.net/forum?id=r1nTpv9eg": {
    "title": "Learning to Perform Physics Experiments via Deep Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "079021d93a88c6a4721af75397d14c2125af1f26",
    "semantic_title": "learning to perform physics experiments via deep reinforcement learning",
    "citation_count": 335,
    "authors": []
  },
  "https://openreview.net/forum?id=B1MRcPclx": {
    "title": "Query-Reduction Networks for Question Answering",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "4bf7edee5a4c4cfdbdd43a607c402420129fa277",
    "semantic_title": "query-reduction networks for question answering",
    "citation_count": 101,
    "authors": []
  },
  "https://openreview.net/forum?id=BJm4T4Kgx": {
    "title": "Adversarial Machine Learning at Scale",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "e2a85a6766b982ff7c8980e57ca6342d22493827",
    "semantic_title": "adversarial machine learning at scale",
    "citation_count": 3152,
    "authors": []
  },
  "https://openreview.net/forum?id=rk9eAFcxg": {
    "title": "Variational Recurrent Adversarial Deep Domain Adaptation",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9c4f30fe94ce07a89eb9b1789b338064d5c44811",
    "semantic_title": "variational recurrent adversarial deep domain adaptation",
    "citation_count": 127,
    "authors": []
  },
  "https://openreview.net/forum?id=ryMxXPFex": {
    "title": "Discrete Variational Autoencoders",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "711683de61ee8d2aa929ec4d5d97d616b8e281d3",
    "semantic_title": "discrete variational autoencoders",
    "citation_count": 260,
    "authors": []
  },
  "https://openreview.net/forum?id=r1fYuytex": {
    "title": "Sparsely-Connected Neural Networks: Towards Efficient VLSI Implementation of Deep Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "138ea97004fe7586977b4eb72835df615319c2df",
    "semantic_title": "sparsely-connected neural networks: towards efficient vlsi implementation of deep neural networks",
    "citation_count": 42,
    "authors": []
  },
  "https://openreview.net/forum?id=SJRpRfKxx": {
    "title": "Recurrent Mixture Density Network for Spatiotemporal Visual Attention",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "f3158ce4e1c9e908e7d06533d711d84205c973b9",
    "semantic_title": "recurrent mixture density network for spatiotemporal visual attention",
    "citation_count": 135,
    "authors": []
  },
  "https://openreview.net/forum?id=BJ3filKll": {
    "title": "Efficient Representation of Low-Dimensional Manifolds using Deep Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "ed9acc61319c2aad04ce25c3bc348b955296bed3",
    "semantic_title": "efficient representation of low-dimensional manifolds using deep networks",
    "citation_count": 44,
    "authors": []
  },
  "https://openreview.net/forum?id=r1VGvBcxl": {
    "title": "Reinforcement Learning through Asynchronous Advantage Actor-Critic on a GPU",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "48830e2e4272fa88dc256f1ac9cf81be14112bdb",
    "semantic_title": "reinforcement learning through asynchronous advantage actor-critic on a gpu",
    "citation_count": 259,
    "authors": []
  },
  "https://openreview.net/forum?id=Bk0FWVcgx": {
    "title": "Topology and Geometry of Half-Rectified Network Optimization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0f94591cc05e6f75c21749d507ef58d204f63b7d",
    "semantic_title": "topology and geometry of half-rectified network optimization",
    "citation_count": 235,
    "authors": []
  },
  "https://openreview.net/forum?id=HyAbMKwxe": {
    "title": "Tighter bounds lead to improved classifiers",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0020a29cd42db351fbfb3c8bb0fd6fa597d67b76",
    "semantic_title": "tighter bounds lead to improved classifiers",
    "citation_count": 8,
    "authors": []
  },
  "https://openreview.net/forum?id=rJqBEPcxe": {
    "title": "Zoneout: Regularizing RNNs by Randomly Preserving Hidden Activations",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9f0687bcd0a7d7fc91b8c5d36c003a38b8853105",
    "semantic_title": "zoneout: regularizing rnns by randomly preserving hidden activations",
    "citation_count": 318,
    "authors": []
  },
  "https://openreview.net/forum?id=SkYbF1slg": {
    "title": "An Information-Theoretic Framework for Fast and Robust Unsupervised Learning via Neural Population Infomax",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b4a592e21d52558498b8cd788badee01aac9525d",
    "semantic_title": "an information-theoretic framework for fast and robust unsupervised learning via neural population infomax",
    "citation_count": 5,
    "authors": []
  },
  "https://openreview.net/forum?id=B16dGcqlx": {
    "title": "Third Person Imitation Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2e1a1b9c2e8feeb31c6855292859bf94101e8382",
    "semantic_title": "third-person imitation learning",
    "citation_count": 234,
    "authors": []
  },
  "https://openreview.net/forum?id=HyTqHL5xg": {
    "title": "Deep Variational Bayes Filters: Unsupervised Learning of State Space Models from Raw Data",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6768ed8d51d1eb0d06f9726a42cef2f17a401f65",
    "semantic_title": "deep variational bayes filters: unsupervised learning of state space models from raw data",
    "citation_count": 375,
    "authors": []
  },
  "https://openreview.net/forum?id=BymIbLKgl": {
    "title": "Learning Invariant Representations Of Planar Curves",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "bc828a99cd936bd4aea2071169504a971a3659da",
    "semantic_title": "learning invariant representations of planar curves",
    "citation_count": 7,
    "authors": []
  },
  "https://openreview.net/forum?id=HkpbnH9lx": {
    "title": "Density estimation using Real NVP",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "09879f7956dddc2a9328f5c1472feeb8402bcbcf",
    "semantic_title": "density estimation using real nvp",
    "citation_count": 3730,
    "authors": []
  },
  "https://openreview.net/forum?id=Bk8BvDqex": {
    "title": "Metacontrol for Adaptive Imagination-Based Optimization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "099cdb087f240352a02286bf9a3e7810c7ebb02b",
    "semantic_title": "metacontrol for adaptive imagination-based optimization",
    "citation_count": 69,
    "authors": []
  },
  "https://openreview.net/forum?id=SJ25-B5eg": {
    "title": "The Neural Noisy Channel",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d19b712f90cde698cc96ebd5fe291b410e3f0f9c",
    "semantic_title": "the neural noisy channel",
    "citation_count": 67,
    "authors": []
  },
  "https://openreview.net/forum?id=HJTzHtqee": {
    "title": "A Compare-Aggregate Model for Matching Text Sequences",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "3f567d3d4975359fadfa9d750e1e4c4722d666c8",
    "semantic_title": "a compare-aggregate model for matching text sequences",
    "citation_count": 277,
    "authors": []
  },
  "https://openreview.net/forum?id=SyxeqhP9ll": {
    "title": "Calibrating Energy-based Generative Adversarial Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0496691c6d54fd746c111d1004349acf7654145e",
    "semantic_title": "calibrating energy-based generative adversarial networks",
    "citation_count": 111,
    "authors": []
  },
  "https://openreview.net/forum?id=ry2YOrcge": {
    "title": "Learning a Natural Language Interface with Neural Programmer",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8fdf01235a0d4bb8bfbd98327b5c86c199b35e48",
    "semantic_title": "learning a natural language interface with neural programmer",
    "citation_count": 136,
    "authors": []
  },
  "https://openreview.net/forum?id=r1rz6U5lg": {
    "title": "Learning to superoptimize programs",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8567ca5729d9f7af210ae426e8e0ebcb1d8607d3",
    "semantic_title": "learning to superoptimize programs",
    "citation_count": 34,
    "authors": []
  },
  "https://openreview.net/forum?id=ryelgY5eg": {
    "title": "Optimal Binary Autoencoding with Pairwise Correlations",
    "volume": "poster",
    "abstract": "We formulate learning of a binary autoencoder as a biconvex optimization problem which learns from the pairwise correlations between encoded and decoded bits. Among all possible algorithms that use this information, ours finds the autoencoder that reconstructs its inputs with worst-case optimal loss. The optimal decoder is a single layer of artificial neurons, emerging entirely from the minimax loss minimization, and with weights learned by convex optimization. All this is reflected in competitive experimental results, demonstrating that binary autoencoding can be done efficiently by conveying information in pairwise correlations in an optimal fashion",
    "checked": true,
    "id": "6a65cd0e80a7b96fd861186f73fc04fc975213e0",
    "semantic_title": "optimal binary autoencoding with pairwise correlations",
    "citation_count": 1,
    "authors": []
  },
  "https://openreview.net/forum?id=HJjiFK5gx": {
    "title": "Neural Program Lattices",
    "volume": "poster",
    "abstract": "We propose the Neural Program Lattice (NPL), a neural network that learns to perform complex tasks by composing low-level programs to express high-level programs. Our starting point is the recent work on Neural Programmer-Interpreters (NPI), which can only learn from strong supervision that contains the whole hierarchy of low-level and high-level programs. NPLs remove this limitation by providing the ability to learn from weak supervision consisting only of sequences of low-level operations. We demonstrate the capability of NPL to learn to perform long-hand addition and arrange blocks in a grid-world environment. Experiments show that it performs on par with NPI while using weak supervision in place of most of the strong supervision, thus indicating its ability to infer the high-level program structure from examples containing only the low-level operations",
    "checked": true,
    "id": "15064b7e47b43a68b6661bc7c3eaaad207493191",
    "semantic_title": "neural program lattices",
    "citation_count": 33,
    "authors": []
  },
  "https://openreview.net/forum?id=B1ElR4cgg": {
    "title": "Adversarially Learned Inference",
    "volume": "poster",
    "abstract": "We introduce the adversarially learned inference (ALI) model, which jointly learns a generation network and an inference network using an adversarial process. The generation network maps samples from stochastic latent variables to the data space while the inference network maps training examples in data space to the space of latent variables. An adversarial game is cast between these two networks and a discriminative network that is trained to distinguish between joint latent/data-space samples from the generative network and joint samples from the inference network. We illustrate the ability of the model to learn mutually coherent inference and generation networks through the inspections of model samples and reconstructions and confirm the usefulness of the learned representations by obtaining a performance competitive with other recent approaches on the semi-supervised SVHN task",
    "checked": true,
    "id": "fcf43325529c8b1cc26aeb52fd5d7e532abb0a40",
    "semantic_title": "adversarially learned inference",
    "citation_count": 1316,
    "authors": []
  },
  "https://openreview.net/forum?id=ByIAPUcee": {
    "title": "Frustratingly Short Attention Spans in Neural Language Modeling",
    "volume": "poster",
    "abstract": "Current language modeling architectures often use recurrent neural networks. Recently, various methods for incorporating differentiable memory into these architectures have been proposed. When predicting the next token, these models query information from a memory of the recent history and thus can facilitate learning mid- and long-range dependencies. However, conventional attention models produce a single output vector per time step that is used for predicting the next token as well as the key and value of a differentiable memory of the history of tokens. In this paper, we propose a key-value attention mechanism that produces separate representations for the key and value of a memory, and for a representation that encodes the next-word distribution. This usage of past memories outperforms existing memory-augmented neural language models on two corpora. Yet, we found that it mainly utilizes past memory only of the previous five representations. This led to the unexpected main finding that a much simpler model which simply uses a concatenation of output representations from the previous three-time steps is on par with more sophisticated memory-augmented neural language models",
    "checked": true,
    "id": "58eb3a2f0a67acf2f5c7c2cb4a22852b65314eb5",
    "semantic_title": "frustratingly short attention spans in neural language modeling",
    "citation_count": 112,
    "authors": []
  },
  "https://openreview.net/forum?id=rJQKYt5ll": {
    "title": "Steerable CNNs",
    "volume": "poster",
    "abstract": "It has long been recognized that the invariance and equivariance properties of a representation are critically important for success in many vision tasks. In this paper we present Steerable Convolutional Neural Networks, an efficient and flexible class of equivariant convolutional networks. We show that steerable CNNs achieve state of the art results on the CIFAR image classification benchmark. The mathematical theory of steerable representations reveals a type system in which any steerable representation is a composition of elementary feature types, each one associated with a particular kind of symmetry. We show how the parameter cost of a steerable filter bank depends on the types of the input and output features, and show how to use this knowledge to construct CNNs that utilize parameters effectively",
    "checked": true,
    "id": "db1207440d20104854464d51da4cf5f79c5de240",
    "semantic_title": "steerable cnns",
    "citation_count": 499,
    "authors": []
  },
  "https://openreview.net/forum?id=rJxDkvqee": {
    "title": "Multi-view Recurrent Neural Acoustic Word Embeddings",
    "volume": "poster",
    "abstract": "Recent work has begun exploring neural acoustic word embeddings–fixed dimensional vector representations of arbitrary-length speech segments corresponding to words. Such embeddings are applicable to speech retrieval and recognition tasks, where reasoning about whole words may make it possible to avoid ambiguous sub-word representations. The main idea is to map acoustic sequences to fixed-dimensional vectors such that examples of the same word are mapped to similar vectors, while different-word examples are mapped to very different vectors. In this work we take a multi-view approach to learning acoustic word embeddings, in which we jointly learn to embed acoustic sequences and their corresponding character sequences. We use deep bidirectional LSTM embedding models and multi-view contrastive losses. We study the effect of different loss variants, including fixed-margin and cost-sensitive losses. Our acoustic word embeddings improve over previous approaches for the task of word discrimination. We also present results on other tasks that are enabled by the multi-view approach, including cross-view word discrimination and word similarity",
    "checked": true,
    "id": "1e018afcc15257db6ed2cfd3beebd11d11d0e93f",
    "semantic_title": "multi-view recurrent neural acoustic word embeddings",
    "citation_count": 86,
    "authors": []
  },
  "https://openreview.net/forum?id=ByxpMd9lx": {
    "title": "Transfer Learning for Sequence Tagging with Hierarchical Recurrent Networks",
    "volume": "poster",
    "abstract": "Recent papers have shown that neural networks obtain state-of-the-art performance on several different sequence tagging tasks. One appealing property of such systems is their generality, as excellent performance can be achieved with a unified architecture and without task-specific feature engineering. However, it is unclear if such systems can be used for tasks without large amounts of training data. In this paper we explore the problem of transfer learning for neural sequence taggers, where a source task with plentiful annotations (e.g., POS tagging on Penn Treebank) is used to improve performance on a target task with fewer available annotations (e.g., POS tagging for microblogs). We examine the effects of transfer learning for deep hierarchical recurrent networks across domains, applications, and languages, and show that significant improvement can often be obtained. These improvements lead to improvements over the current state-of-the-art on several well-studied tasks",
    "checked": true,
    "id": "189e6bb7523733c4e524214b9e6ae92d4ed50dac",
    "semantic_title": "transfer learning for sequence tagging with hierarchical recurrent networks",
    "citation_count": 352,
    "authors": []
  },
  "https://openreview.net/forum?id=Hk3mPK5gg": {
    "title": "Training Agent for First-Person Shooter Game with Actor-Critic Curriculum Learning",
    "volume": "poster",
    "abstract": "In this paper, we propose a novel framework for training vision-based agent for First-Person Shooter (FPS) Game, in particular Doom. Our framework combines the state-of-the-art reinforcement learning approach (Asynchronous Advantage Actor-Critic (A3C) model) with curriculum learning. Our model is simple in design and only uses game states from the AI side, rather than using opponents' information. On a known map, our agent won 10 out of the 11 attended games and the champion of Track1 in ViZDoom AI Competition 2016 by a large margin, 35\\% higher score than the second place",
    "checked": true,
    "id": "add7b8b65355d5408a1ffb93a94b0ae688806bc4",
    "semantic_title": "training agent for first-person shooter game with actor-critic curriculum learning",
    "citation_count": 188,
    "authors": []
  },
  "https://openreview.net/forum?id=rJiNwv9gg": {
    "title": "Lossy Image Compression with Compressive Autoencoders",
    "volume": "poster",
    "abstract": "We propose a new approach to the problem of optimizing autoencoders for lossy image compression. New media formats, changing hardware technology, as well as diverse requirements and content types create a need for compression algorithms which are more flexible than existing codecs. Autoencoders have the potential to address this need, but are difficult to optimize directly due to the inherent non-differentiabilty of the compression loss. We here show that minimal changes to the loss are sufficient to train deep autoencoders competitive with JPEG 2000 and outperforming recently proposed approaches based on RNNs. Our network is furthermore computationally efficient thanks to a sub-pixel architecture, which makes it suitable for high-resolution images. This is in contrast to previous work on autoencoders for compression using coarser approximations, shallower architectures, computationally expensive methods, or focusing on small images",
    "checked": true,
    "id": "977560251c2bd4c28a6c7c707c29f4091c5e6247",
    "semantic_title": "lossy image compression with compressive autoencoders",
    "citation_count": 1056,
    "authors": []
  },
  "https://openreview.net/forum?id=H1fl8S9ee": {
    "title": "Learning and Policy Search in Stochastic Dynamical Systems with Bayesian Neural Networks",
    "volume": "poster",
    "abstract": "We present an algorithm for policy search in stochastic dynamical systems using model-based reinforcement learning. The system dynamics are described with Bayesian neural networks (BNNs) that include stochastic input variables. These input variables allow us to capture complex statistical patterns in the transition dynamics (e.g. multi-modality and heteroskedasticity), which are usually missed by alternative modeling approaches. After learning the dynamics, our BNNs are then fed into an algorithm that performs random roll-outs and uses stochastic optimization for policy learning. We train our BNNs by minimizing $\\alpha$-divergences with $\\alpha = 0.5$, which usually produces better results than other techniques such as variational Bayes. We illustrate the performance of our method by solving a challenging problem where model-based approaches usually fail and by obtaining promising results in real-world scenarios including the control of a gas turbine and an industrial benchmark",
    "checked": true,
    "id": "2af9eaae9191ee522cb97dc57615a071e5403d26",
    "semantic_title": "learning and policy search in stochastic dynamical systems with bayesian neural networks",
    "citation_count": 160,
    "authors": []
  },
  "https://openreview.net/forum?id=HkNKFiGex": {
    "title": "Neural Photo Editing with Introspective Adversarial Networks",
    "volume": "poster",
    "abstract": "The increasingly photorealistic sample quality of generative image models suggests their feasibility in applications beyond image generation. We present the Neural Photo Editor, an interface that leverages the power of generative neural networks to make large, semantically coherent changes to existing images. To tackle the challenge of achieving accurate reconstructions without loss of feature quality, we introduce the Introspective Adversarial Network, a novel hybridization of the VAE and GAN. Our model efficiently captures long-range dependencies through use of a computational block based on weight-shared dilated convolutions, and improves generalization performance with Orthogonal Regularization, a novel weight regularization method. We validate our contributions on CelebA, SVHN, and CIFAR-100, and produce samples and reconstructions with high visual fidelity",
    "checked": true,
    "id": "1dcda6ac3fd33bf938574aca9542aec5e5cace26",
    "semantic_title": "neural photo editing with introspective adversarial networks",
    "citation_count": 459,
    "authors": []
  },
  "https://openreview.net/forum?id=rJfMusFll": {
    "title": "Batch Policy Gradient Methods for Improving Neural Conversation Models",
    "volume": "poster",
    "abstract": "We study reinforcement learning of chat-bots with recurrent neural network architectures when the rewards are noisy and expensive to obtain. For instance, a chat-bot used in automated customer service support can be scored by quality assurance agents, but this process can be expensive, time consuming and noisy. Previous reinforcement learning work for natural language uses on-policy updates and/or is designed for on-line learning settings. We demonstrate empirically that such strategies are not appropriate for this setting and develop an off-policy batch policy gradient method (\\bpg). We demonstrate the efficacy of our method via a series of synthetic experiments and an Amazon Mechanical Turk experiment on a restaurant recommendations dataset",
    "checked": true,
    "id": "11732140ada8e05c84e9024927c297565ebd6ad8",
    "semantic_title": "batch policy gradient methods for improving neural conversation models",
    "citation_count": 37,
    "authors": []
  },
  "https://openreview.net/forum?id=H1zJ-v5xl": {
    "title": "Quasi-Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "Recurrent neural networks are a powerful tool for modeling sequential data, but the dependence of each timestep's computation on the previous timestep's output limits parallelism and makes RNNs unwieldy for very long sequences. We introduce quasi-recurrent neural networks (QRNNs), an approach to neural sequence modeling that alternates convolutional layers, which apply in parallel across timesteps, and a minimalist recurrent pooling function that applies in parallel across channels. Despite lacking trainable recurrent layers, stacked QRNNs have better predictive accuracy than stacked LSTMs of the same hidden size. Due to their increased parallelism, they are up to 16 times faster at train and test time. Experiments on language modeling, sentiment classification, and character-level neural machine translation demonstrate these advantages and underline the viability of QRNNs as a basic building block for a variety of sequence tasks",
    "checked": true,
    "id": "2d876ed1dd2c58058d7197b734a8e4d349b8f231",
    "semantic_title": "quasi-recurrent neural networks",
    "citation_count": 445,
    "authors": []
  },
  "https://openreview.net/forum?id=HkNRsU5ge": {
    "title": "Sigma Delta Quantized Networks",
    "volume": "poster",
    "abstract": "Deep neural networks can be obscenely wasteful. When processing video, a convolutional network expends a fixed amount of computation for each frame with no regard to the similarity between neighbouring frames. As a result, it ends up repeatedly doing very similar computations. To put an end to such waste, we introduce Sigma-Delta networks. With each new input, each layer in this network sends a discretized form of its change in activation to the next layer. Thus the amount of computation that the network does scales with the amount of change in the input and layer activations, rather than the size of the network. We introduce an optimization method for converting any pre-trained deep network into an optimally efficient Sigma-Delta network, and show that our algorithm, if run on the appropriate hardware, could cut at least an order of magnitude from the computational cost of processing video data",
    "checked": true,
    "id": "6fd4b90193efbd0922554672abb52fa1886f607f",
    "semantic_title": "sigma delta quantized networks",
    "citation_count": 49,
    "authors": []
  },
  "https://openreview.net/forum?id=S1jE5L5gl": {
    "title": "The Concrete Distribution: A Continuous Relaxation of Discrete Random Variables",
    "volume": "poster",
    "abstract": "The reparameterization trick enables optimizing large scale stochastic computation graphs via gradient descent. The essence of the trick is to refactor each stochastic node into a differentiable function of its parameters and a random variable with fixed distribution. After refactoring, the gradients of the loss propagated by the chain rule through the graph are low variance unbiased estimators of the gradients of the expected loss. While many continuous random variables have such reparameterizations, discrete random variables lack useful reparameterizations due to the discontinuous nature of discrete states. In this work we introduce Concrete random variables -- continuous relaxations of discrete random variables. The Concrete distribution is a new family of distributions with closed form densities and a simple reparameterization. Whenever a discrete stochastic node of a computation graph can be refactored into a one-hot bit representation that is treated continuously, Concrete stochastic nodes can be used with automatic differentiation to produce low-variance biased gradients of objectives (including objectives that depend on the log-probability of latent stochastic nodes) on the corresponding discrete graph. We demonstrate the effectiveness of Concrete relaxations on density estimation and structured prediction tasks using neural networks",
    "checked": true,
    "id": "515a21e90117941150923e559729c59f5fdade1c",
    "semantic_title": "the concrete distribution: a continuous relaxation of discrete random variables",
    "citation_count": 2542,
    "authors": []
  },
  "https://openreview.net/forum?id=Skn9Shcxe": {
    "title": "Highway and Residual Networks learn Unrolled Iterative Estimation",
    "volume": "poster",
    "abstract": "The past year saw the introduction of new architectures such as Highway networks and Residual networks which, for the first time, enabled the training of feedforward networks with dozens to hundreds of layers using simple gradient descent. While depth of representation has been posited as a primary reason for their success, there are indications that these architectures defy a popular view of deep learning as a hierarchical computation of increasingly abstract features at each layer. In this report, we argue that this view is incomplete and does not adequately explain several recent findings. We propose an alternative viewpoint based on unrolled iterative estimation---a group of successive layers iteratively refine their estimates of the same features instead of computing an entirely new representation. We demonstrate that this viewpoint directly leads to the construction of highway and residual networks. Finally we provide preliminary experiments to discuss the similarities and differences between the two architectures",
    "checked": true,
    "id": "535347e07b2ce5ac229349156db1e7bed0486b91",
    "semantic_title": "highway and residual networks learn unrolled iterative estimation",
    "citation_count": 216,
    "authors": []
  },
  "https://openreview.net/forum?id=HJKkY35le": {
    "title": "Mode Regularized Generative Adversarial Networks",
    "volume": "poster",
    "abstract": "Although Generative Adversarial Networks achieve state-of-the-art results on a variety of generative tasks, they are regarded as highly unstable and prone to miss modes. We argue that these bad behaviors of GANs are due to the very particular functional shape of the trained discriminators in high dimensional spaces, which can easily make training stuck or push probability mass in the wrong direction, towards that of higher concentration than that of the data generating distribution. We introduce several ways of regularizing the objective, which can dramatically stabilize the training of GAN models. We also show that our regularizers can help the fair distribution of probability mass across the modes of the data generating distribution during the early phases of training, thus providing a unified solution to the missing modes problem",
    "checked": true,
    "id": "024d30897e0a2b036bc122163a954b7f1a1d0679",
    "semantic_title": "mode regularized generative adversarial networks",
    "citation_count": 557,
    "authors": []
  },
  "https://openreview.net/forum?id=Hkg8bDqee": {
    "title": "Introspection:Accelerating Neural Network Training By Learning Weight Evolution",
    "volume": "poster",
    "abstract": "Neural Networks are function approximators that have achieved state-of-the-art accuracy in numerous machine learning tasks. In spite of their great success in terms of accuracy, their large training time makes it difficult to use them for various tasks. In this paper, we explore the idea of learning weight evolution pattern from a simple network for accelerating training of novel neural networks. We use a neural network to learn the training pattern from MNIST classification and utilize it to accelerate training of neural networks used for CIFAR-10 and ImageNet classification. Our method has a low memory footprint and is computationally efficient. This method can also be used with other optimizers to give faster convergence. The results indicate a general trend in the weight evolution during training of neural networks",
    "checked": true,
    "id": "9bc3eaa4f816d186b9deac9ba980f278f85a1cd8",
    "semantic_title": "introspection: accelerating neural network training by learning weight evolution",
    "citation_count": 20,
    "authors": []
  },
  "https://openreview.net/forum?id=S1X7nhsxl": {
    "title": "Improving Generative Adversarial Networks with Denoising Feature Matching",
    "volume": "poster",
    "abstract": "We propose an augmented training procedure for generative adversarial networks designed to address shortcomings of the original by directing the generator towards probable configurations of abstract discriminator features. We estimate and track the distribution of these features, as computed from data, with a denoising auto-encoder, and use it to propose high-level targets for the generator. We combine this new loss with the original and evaluate the hybrid criterion on the task of unsupervised image synthesis from datasets comprising a diverse set of visual categories, noting a qualitative and quantitative improvement in the ``objectness'' of the resulting samples",
    "checked": true,
    "id": "6ee38873273aead30c8e561ba807a3032204f870",
    "semantic_title": "improving generative adversarial networks with denoising feature matching",
    "citation_count": 176,
    "authors": []
  },
  "https://openreview.net/forum?id=B1ckMDqlg": {
    "title": "Outrageously Large Neural Networks: The Sparsely-Gated Mixture-of-Experts Layer",
    "volume": "poster",
    "abstract": "The capacity of a neural network to absorb information is limited by its number of parameters. Conditional computation, where parts of the network are active on a per-example basis, has been proposed in theory as a way of dramatically increasing model capacity without a proportional increase in computation. In practice, however, there are significant algorithmic and performance challenges. In this work, we address these challenges and finally realize the promise of conditional computation, achieving greater than 1000x improvements in model capacity with only minor losses in computational efficiency on modern GPU clusters. We introduce a Sparsely-Gated Mixture-of-Experts layer (MoE), consisting of up to thousands of feed-forward sub-networks. A trainable gating network determines a sparse combination of these experts to use for each example. We apply the MoE to the tasks of language modeling and machine translation, where model capacity is critical for absorbing the vast quantities of knowledge available in the training corpora. We present model architectures in which a MoE with up to 137 billion parameters is applied convolutionally between stacked LSTM layers. On large language modeling and machine translation benchmarks, these models achieve significantly better results than state-of-the-art at lower computational cost",
    "checked": true,
    "id": "510e26733aaff585d65701b9f1be7ca9d5afc586",
    "semantic_title": "outrageously large neural networks: the sparsely-gated mixture-of-experts layer",
    "citation_count": 2707,
    "authors": []
  },
  "https://openreview.net/forum?id=rk5upnsxe": {
    "title": "Normalizing the Normalizers: Comparing and Extending Network Normalization Schemes",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2a7564039c2eb69073aafe4b2363490de5b8e3c3",
    "semantic_title": "normalizing the normalizers: comparing and extending network normalization schemes",
    "citation_count": 81,
    "authors": []
  },
  "https://openreview.net/forum?id=ryhqQFKgl": {
    "title": "Towards Deep Interpretability (MUS-ROVER II): Learning Hierarchical Representations of Tonal Music",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0ff1dbf5c5851eed853b85c34c52331759613581",
    "semantic_title": "towards deep interpretability (mus-rover ii): learning hierarchical representations of tonal music",
    "citation_count": 16,
    "authors": []
  },
  "https://openreview.net/forum?id=HyGTuv9eg": {
    "title": "Incorporating long-range consistency in CNN-based texture generation",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "60520d06b5540c15effa403d0c63b98a2a49159d",
    "semantic_title": "incorporating long-range consistency in cnn-based texture generation",
    "citation_count": 51,
    "authors": []
  },
  "https://openreview.net/forum?id=HkljfjFee": {
    "title": "Support Regularized Sparse Coding and Its Fast Encoder",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d580cf2cf9493b67d08fa8b2300f3bbc9ed864b7",
    "semantic_title": "support regularized sparse coding and its fast encoder",
    "citation_count": 1,
    "authors": []
  },
  "https://openreview.net/forum?id=B1gtu5ilg": {
    "title": "Transfer of View-manifold Learning to Similarity Perception of Novel Objects",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "01fce96b99aedfb5d041ef4411ad8e9699b2c4df",
    "semantic_title": "transfer of view-manifold learning to similarity perception of novel objects",
    "citation_count": 13,
    "authors": []
  },
  "https://openreview.net/forum?id=S1LVSrcge": {
    "title": "Variable Computation in Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6746a18b2820f757334f75bc95428b3ea58d6603",
    "semantic_title": "variable computation in recurrent neural networks",
    "citation_count": 60,
    "authors": []
  },
  "https://openreview.net/forum?id=r1YNw6sxg": {
    "title": "Learning Visual Servoing with Deep Features and Fitted Q-Iteration",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "a82201136fd3e835fbe240368047feeed62a084e",
    "semantic_title": "learning visual servoing with deep features and fitted q-iteration",
    "citation_count": 73,
    "authors": []
  },
  "https://openreview.net/forum?id=HJ1kmv9xx": {
    "title": "LR-GAN: Layered Recursive Generative Adversarial Networks for Image Generation",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "c789f8e3f40f57335aef2565f4d2bac69d2941d8",
    "semantic_title": "lr-gan: layered recursive generative adversarial networks for image generation",
    "citation_count": 241,
    "authors": []
  },
  "https://openreview.net/forum?id=BkLhzHtlg": {
    "title": "Learning Recurrent Representations for Hierarchical Behavior Modeling",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b530755b7d4e1ce03d96812f5e065c30eab8538c",
    "semantic_title": "learning recurrent representations for hierarchical behavior modeling",
    "citation_count": 48,
    "authors": []
  },
  "https://openreview.net/forum?id=r1LXit5ee": {
    "title": "Episodic Exploration for Deep Deterministic Policies for StarCraft Micromanagement",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "454d0168492917fdb87f2ed034686c8edd4cbe90",
    "semantic_title": "episodic exploration for deep deterministic policies for starcraft micromanagement",
    "citation_count": 0,
    "authors": []
  },
  "https://openreview.net/forum?id=SJMGPrcle": {
    "title": "Learning to Navigate in Complex Environments",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d35b05f440b5ba00d9429139edef7182bf9f7ce7",
    "semantic_title": "learning to navigate in complex environments",
    "citation_count": 880,
    "authors": []
  },
  "https://openreview.net/forum?id=S1dIzvclg": {
    "title": "A recurrent neural network without chaos",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "f451d0212e65ab9970a58b584b3363a853c9811c",
    "semantic_title": "a recurrent neural network without chaos",
    "citation_count": 63,
    "authors": []
  },
  "https://openreview.net/forum?id=ryh9pmcee": {
    "title": "Energy-based Generative Adversarial Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0496691c6d54fd746c111d1004349acf7654145e",
    "semantic_title": "calibrating energy-based generative adversarial networks",
    "citation_count": 111,
    "authors": []
  },
  "https://openreview.net/forum?id=S1c2cvqee": {
    "title": "Designing Neural Network Architectures using Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6cd5dfccd9f52538b19a415e00031d0ee4e5b181",
    "semantic_title": "designing neural network architectures using reinforcement learning",
    "citation_count": 1472,
    "authors": []
  },
  "https://openreview.net/forum?id=HkE0Nvqlg": {
    "title": "Structured Attention Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "13d9323a8716131911bfda048a40e2cde1a76a46",
    "semantic_title": "structured attention networks",
    "citation_count": 463,
    "authors": []
  },
  "https://openreview.net/forum?id=BJC_jUqxe": {
    "title": "A STRUCTURED SELF-ATTENTIVE SENTENCE EMBEDDING",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "204a4a70428f3938d2c538a4d74c7ae0416306d8",
    "semantic_title": "a structured self-attentive sentence embedding",
    "citation_count": 2145,
    "authors": []
  },
  "https://openreview.net/forum?id=rJ8Je4clg": {
    "title": "Learning to Play in a Day: Faster Deep Reinforcement Learning by Optimality Tightening",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "85d8b1b3483c7f4db999e7cf6b3e6231954c43dc",
    "semantic_title": "learning to play in a day: faster deep reinforcement learning by optimality tightening",
    "citation_count": 84,
    "authors": []
  },
  "https://openreview.net/forum?id=ryrGawqex": {
    "title": "Deep Learning with Dynamic Computation Graphs",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "7176fdb1c3618c26d331bc49e0d8d0874d2555ed",
    "semantic_title": "deep learning with dynamic computation graphs",
    "citation_count": 135,
    "authors": []
  },
  "https://openreview.net/forum?id=HyxQzBceg": {
    "title": "Deep Variational Information Bottleneck",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "a181fb5a42ad8fe2cc27b5542fa40384e9a8d72c",
    "semantic_title": "deep variational information bottleneck",
    "citation_count": 1735,
    "authors": []
  },
  "https://openreview.net/forum?id=ryHlUtqge": {
    "title": "Generalizing Skills with Semi-Supervised Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "4603f26093d64fc4107d3ec49667003f60210654",
    "semantic_title": "generalizing skills with semi-supervised reinforcement learning",
    "citation_count": 69,
    "authors": []
  },
  "https://openreview.net/forum?id=S1oWlN9ll": {
    "title": "Loss-aware Binarization of Deep Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "43e2519d094bff2fc10c3b9ea944a2457e3884be",
    "semantic_title": "loss-aware binarization of deep networks",
    "citation_count": 220,
    "authors": []
  },
  "https://openreview.net/forum?id=B1-q5Pqxl": {
    "title": "Machine Comprehension Using Match-LSTM and Answer Pointer",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "ff1861b71eaedba46cb679bbe2c585dbe18f9b19",
    "semantic_title": "machine comprehension using match-lstm and answer pointer",
    "citation_count": 594,
    "authors": []
  },
  "https://openreview.net/forum?id=B1s6xvqlx": {
    "title": "Recurrent Environment Simulators",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "bb430ec2f25e4a1513073a2a4098cbb942c2e3e0",
    "semantic_title": "recurrent environment simulators",
    "citation_count": 211,
    "authors": []
  },
  "https://openreview.net/forum?id=ry18Ww5ee": {
    "title": "Hyperband: Bandit-Based Configuration Evaluation for Hyperparameter Optimization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "04fe6b11280c79b91c060934be66856877e532c6",
    "semantic_title": "hyperband: bandit-based configuration evaluation for hyperparameter optimization",
    "citation_count": 176,
    "authors": []
  },
  "https://openreview.net/forum?id=S1di0sfgl": {
    "title": "Hierarchical Multiscale Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "65eee67dee969fdf8b44c87c560d66ad4d78e233",
    "semantic_title": "hierarchical multiscale recurrent neural networks",
    "citation_count": 538,
    "authors": []
  },
  "https://openreview.net/forum?id=HkYhZDqxg": {
    "title": "Tree-structured decoding with doubly-recurrent neural networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9c69926bdb72912725d20a55af7147f86bed01ae",
    "semantic_title": "tree-structured decoding with doubly-recurrent neural networks",
    "citation_count": 103,
    "authors": []
  },
  "https://openreview.net/forum?id=Hku9NK5lx": {
    "title": "Training Compressed Fully-Connected Networks with a Density-Diversity Penalty",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9f6422dbb45f1bb183da514517f224b7a6e79f87",
    "semantic_title": "training compressed fully-connected networks with a density-diversity penalty",
    "citation_count": 12,
    "authors": []
  },
  "https://openreview.net/forum?id=Sk-oDY9ge": {
    "title": "Diet Networks: Thin Parameters for Fat Genomics",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "a36d5dee672e66b5f4db9e9df7498ef89b4b9cf5",
    "semantic_title": "diet networks: thin parameters for fat genomic",
    "citation_count": 68,
    "authors": []
  },
  "https://openreview.net/forum?id=BJhZeLsxx": {
    "title": "What does it take to generate natural textures?",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "abdd228205f0878ee0a426d8ef94ab15db4a07e8",
    "semantic_title": "what does it take to generate natural textures?",
    "citation_count": 33,
    "authors": []
  },
  "https://openreview.net/forum?id=rkFBJv9gg": {
    "title": "Learning Features of Music From Scratch",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "f6154535699c65633243c482d2b97d4b66036633",
    "semantic_title": "learning features of music from scratch",
    "citation_count": 203,
    "authors": []
  },
  "https://openreview.net/forum?id=SJvYgH9xe": {
    "title": "Automatic Rule Extraction from Long Short Term Memory Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "57b9ec1b2c4ff17baed4ecca932880fd13eb5d19",
    "semantic_title": "automatic rule extraction from long short term memory networks",
    "citation_count": 87,
    "authors": []
  },
  "https://openreview.net/forum?id=Hk8TGSKlg": {
    "title": "Reasoning with Memory Augmented Neural Networks for Language Comprehension",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "24021461b49c726606bb9acdedd05cea5277c491",
    "semantic_title": "reasoning with memory augmented neural networks for language comprehension",
    "citation_count": 25,
    "authors": []
  },
  "https://openreview.net/forum?id=HJpfMIFll": {
    "title": "Geometry of Polysemy",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "57a94c641412a39d4caa6b1a080ed3dae7ea75c5",
    "semantic_title": "geometry of polysemy",
    "citation_count": 21,
    "authors": []
  },
  "https://openreview.net/forum?id=Sk2Im59ex": {
    "title": "Unsupervised Cross-Domain Image Generation",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b4ee64022cc3ccd14c7f9d4935c59b16456067d3",
    "semantic_title": "unsupervised cross-domain image generation",
    "citation_count": 0,
    "authors": []
  },
  "https://openreview.net/forum?id=Hyq4yhile": {
    "title": "Learning Invariant Feature Spaces to Transfer Skills with Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "7f710932a0aa99f2c2ddbec6e7765f10c48d3fc2",
    "semantic_title": "learning invariant feature spaces to transfer skills with reinforcement learning",
    "citation_count": 269,
    "authors": []
  },
  "https://openreview.net/forum?id=B1YfAfcgl": {
    "title": "Entropy-SGD: Biasing Gradient Descent Into Wide Valleys",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b6583fe9c9dc52bb129aff4cefc60519349f3b4c",
    "semantic_title": "entropy-sgd: biasing gradient descent into wide valleys",
    "citation_count": 775,
    "authors": []
  },
  "https://openreview.net/forum?id=Sks9_ajex": {
    "title": "Paying More Attention to Attention: Improving the Performance of Convolutional Neural Networks via Attention Transfer",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "f7b032a4df721d4ed2bab97f6acd33d62477b7a5",
    "semantic_title": "paying more attention to attention: improving the performance of convolutional neural networks via attention transfer",
    "citation_count": 2596,
    "authors": []
  },
  "https://openreview.net/forum?id=S1TER2oll": {
    "title": "FILTER SHAPING FOR CONVOLUTIONAL NEURAL NETWORKS",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0ef8ba551c025747333382bb627f305b540543dc",
    "semantic_title": "filter shaping for convolutional neural networks",
    "citation_count": 26,
    "authors": []
  },
  "https://openreview.net/forum?id=BydrOIcle": {
    "title": "Unrolled Generative Adversarial Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "488bb25e0b1777847f04c943e6dbc4f84415b712",
    "semantic_title": "unrolled generative adversarial networks",
    "citation_count": 1007,
    "authors": []
  },
  "https://openreview.net/forum?id=SJDaqqveg": {
    "title": "An Actor-Critic Algorithm for Sequence Prediction",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0d24a0695c9fc669e643bad51d4e14f056329dec",
    "semantic_title": "an actor-critic algorithm for sequence prediction",
    "citation_count": 640,
    "authors": []
  },
  "https://openreview.net/forum?id=BJAFbaolg": {
    "title": "Learning to Generate Samples from Noise through Infusion Training",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d2860bb05f747e4628e95e4d84018263831bab0d",
    "semantic_title": "learning to generate samples from noise through infusion training",
    "citation_count": 44,
    "authors": []
  },
  "https://openreview.net/forum?id=Hy6b4Pqee": {
    "title": "Deep Probabilistic Programming",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8e9532262bb862c62d2d011a93da014da2d97ee9",
    "semantic_title": "deep probabilistic programming",
    "citation_count": 193,
    "authors": []
  },
  "https://openreview.net/forum?id=r1G4z8cge": {
    "title": "Mollifying Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b9728a8279c12f93fff089b6fac96afd2d3bab04",
    "semantic_title": "mollifying networks",
    "citation_count": 46,
    "authors": []
  },
  "https://openreview.net/forum?id=ry_sjFqgx": {
    "title": "Program Synthesis for Character Level Language Modeling",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "de7e3537d974c2ca28e3ca130d531e5eb23eb79f",
    "semantic_title": "program synthesis for character level language modeling",
    "citation_count": 12,
    "authors": []
  },
  "https://openreview.net/forum?id=ryxB0Rtxx": {
    "title": "Identity Matters in Deep Learning",
    "volume": "poster",
    "abstract": "An emerging design principle in deep learning is that each layer of a deep artificial neural network should be able to easily express the identity transformation. This idea not only motivated various normalization techniques, such as batch normalization, but was also key to the immense success of residual networks. In this work, we put the principle of identity parameterization on a more solid theoretical footing alongside further empirical progress. We first give a strikingly simple proof that arbitrarily deep linear residual networks have no spurious local optima. The same result for feed-forward networks in their standard parameterization is substantially more delicate. Second, we show that residual networks with ReLu activations have universal finite-sample expressivity in the sense that the network can represent any function of its sample provided that the model has more parameters than the sample size. Directly inspired by our theory, we experiment with a radically simple residual architecture consisting of only residual convolutional layers and ReLu activations, but no batch normalization, dropout, or max pool. Our model improves significantly on previous all-convolutional networks on the CIFAR10, CIFAR100, and ImageNet classification benchmarks",
    "checked": true,
    "id": "8fbb115c578e8bfbcc1615bd7af990396abf6776",
    "semantic_title": "identity matters in deep learning",
    "citation_count": 399,
    "authors": []
  },
  "https://openreview.net/forum?id=r1rhWnZkg": {
    "title": "Hadamard Product for Low-rank Bilinear Pooling",
    "volume": "poster",
    "abstract": "Bilinear models provide rich representations compared with linear models. They have been applied in various visual tasks, such as object recognition, segmentation, and visual question-answering, to get state-of-the-art performances taking advantage of the expanded representations. However, bilinear representations tend to be high-dimensional, limiting the applicability to computationally complex tasks. We propose low-rank bilinear pooling using Hadamard product for an efficient attention mechanism of multimodal learning. We show that our model outperforms compact bilinear pooling in visual question-answering tasks with the state-of-the-art results on the VQA dataset, having a better parsimonious property",
    "checked": false,
    "id": "f05cea9192e2e584c2efdefcfd8fe2208560bfb0",
    "semantic_title": "mett vii — 7 th workshop on matrix equations and tensor techniques pisa , 13 – 14 feb 2017",
    "citation_count": 0,
    "authors": []
  },
  "https://openreview.net/forum?id=BkVsEMYel": {
    "title": "Inductive Bias of Deep Convolutional Networks through Pooling Geometry",
    "volume": "poster",
    "abstract": "Our formal understanding of the inductive bias that drives the success of convolutional networks on computer vision tasks is limited. In particular, it is unclear what makes hypotheses spaces born from convolution and pooling operations so suitable for natural images. In this paper we study the ability of convolutional networks to model correlations among regions of their input. We theoretically analyze convolutional arithmetic circuits, and empirically validate our findings on other types of convolutional networks as well. Correlations are formalized through the notion of separation rank, which for a given partition of the input, measures how far a function is from being separable. We show that a polynomially sized deep network supports exponentially high separation ranks for certain input partitions, while being limited to polynomial separation ranks for others. The network's pooling geometry effectively determines which input partitions are favored, thus serves as a means for controlling the inductive bias. Contiguous pooling windows as commonly employed in practice favor interleaved partitions over coarse ones, orienting the inductive bias towards the statistics of natural images. Other pooling schemes lead to different preferences, and this allows tailoring the network to data that departs from the usual domain of natural imagery. In addition to analyzing deep networks, we show that shallow ones support only linear separation ranks, and by this gain insight into the benefit of functions brought forth by depth - they are able to efficiently model strong correlation under favored partitions of the input",
    "checked": true,
    "id": "989e261e232c51cc48aa07064c573316f9f818c3",
    "semantic_title": "inductive bias of deep convolutional networks through pooling geometry",
    "citation_count": 134,
    "authors": []
  },
  "https://openreview.net/forum?id=rJqFGTslg": {
    "title": "Pruning Filters for Efficient ConvNets",
    "volume": "poster",
    "abstract": "The success of CNNs in various applications is accompanied by a significant increase in the computation and parameter storage costs. Recent efforts toward reducing these overheads involve pruning and compressing the weights of various layers without hurting original accuracy. However, magnitude-based pruning of weights reduces a significant number of parameters from the fully connected layers and may not adequately reduce the computation costs in the convolutional layers due to irregular sparsity in the pruned networks. We present an acceleration method for CNNs, where we prune filters from CNNs that are identified as having a small effect on the output accuracy. By removing whole filters in the network together with their connecting feature maps, the computation costs are reduced significantly. In contrast to pruning weights, this approach does not result in sparse connectivity patterns. Hence, it does not need the support of sparse convolution libraries and can work with existing efficient BLAS libraries for dense matrix multiplications. We show that even simple filter pruning techniques can reduce inference costs for VGG-16 by up to 34% and ResNet-110 by up to 38% on CIFAR10 while regaining close to the original accuracy by retraining the networks",
    "checked": true,
    "id": "c2a1cb1612ba21e067a5c3ba478a8d73b796b77a",
    "semantic_title": "pruning filters for efficient convnets",
    "citation_count": 3709,
    "authors": []
  },
  "https://openreview.net/forum?id=SkxKPDv5xl": {
    "title": "SampleRNN: An Unconditional End-to-End Neural Audio Generation Model",
    "volume": "poster",
    "abstract": "In this paper we propose a novel model for unconditional audio generation task that generates one audio sample at a time. We show that our model which profits from combining memory-less modules, namely autoregressive multilayer perceptron, and stateful recurrent neural networks in a hierarchical structure is de facto powerful to capture the underlying sources of variations in temporal domain for very long time on three datasets of different nature. Human evaluation on the generated samples indicate that our model is preferred over competing models. We also show how each component of the model contributes to the exhibited performance",
    "checked": true,
    "id": "e221e2c2ca8bd74a7b818406c8a2a342760e7d65",
    "semantic_title": "samplernn: an unconditional end-to-end neural audio generation model",
    "citation_count": 599,
    "authors": []
  },
  "https://openreview.net/forum?id=SkhU2fcll": {
    "title": "Deep Multi-task Representation Learning: A Tensor Factorisation Approach",
    "volume": "poster",
    "abstract": "Most contemporary multi-task learning methods assume linear models. This setting is considered shallow in the era of deep learning. In this paper, we present a new deep multi-task representation learning framework that learns cross-task sharing structure at every layer in a deep network. Our approach is based on generalising the matrix factorisation techniques explicitly or implicitly used by many conventional MTL algorithms to tensor factorisation, to realise automatic learning of end-to-end knowledge sharing in deep networks. This is in contrast to existing deep learning approaches that need a user-defined multi-task sharing strategy. Our approach applies to both homogeneous and heterogeneous MTL. Experiments demonstrate the efficacy of our deep multi-task representation learning in terms of both higher accuracy and fewer design choices",
    "checked": true,
    "id": "468a80bcd4ff9b3f47beb9145ff81140777bb3f3",
    "semantic_title": "deep multi-task representation learning: a tensor factorisation approach",
    "citation_count": 255,
    "authors": []
  },
  "https://openreview.net/forum?id=SyWvgP5el": {
    "title": "EPOpt: Learning Robust Neural Network Policies Using Model Ensembles",
    "volume": "poster",
    "abstract": "Sample complexity and safety are major challenges when learning policies with reinforcement learning for real-world tasks, especially when the policies are represented using rich function approximators like deep neural networks. Model-based methods where the real-world target domain is approximated using a simulated source domain provide an avenue to tackle the above challenges by augmenting real data with simulated data. However, discrepancies between the simulated source domain and the target domain pose a challenge for simulated training. We introduce the EPOpt algorithm, which uses an ensemble of simulated source domains and a form of adversarial training to learn policies that are robust and generalize to a broad range of possible target domains, including to unmodeled effects. Further, the probability distribution over source domains in the ensemble can be adapted using data from the target domain and approximate Bayesian methods, to progressively make it a better approximation. Thus, learning on a model ensemble, along with source domain adaptation, provides the benefit of both robustness and learning",
    "checked": true,
    "id": "9228fa3b363229780da4cb1d258942e0c13c2947",
    "semantic_title": "epopt: learning robust neural network policies using model ensembles",
    "citation_count": 353,
    "authors": []
  },
  "https://openreview.net/forum?id=ryuxYmvel": {
    "title": "HolStep: A Machine Learning Dataset for Higher-order Logic Theorem Proving",
    "volume": "poster",
    "abstract": "Large computer-understandable proofs consist of millions of intermediate logical steps. The vast majority of such steps originate from manually selected and manually guided heuristics applied to intermediate goals. So far, machine learning has generally not been used to filter or generate these steps. In this paper, we introduce a new dataset based on Higher-Order Logic (HOL) proofs, for the purpose of developing new machine learning-based theorem-proving strategies. We make this dataset publicly available under the BSD license. We propose various machine learning tasks that can be performed on this dataset, and discuss their significance for theorem proving. We also benchmark a set of simple baseline machine learning models suited for the tasks (including logistic regression convolutional neural networks and recurrent neural networks). The results of our baseline models show the promise of applying machine learning to HOL theorem proving",
    "checked": true,
    "id": "f1318d15d7d8ab626b92d0c70dbdc5b5d37e223f",
    "semantic_title": "holstep: a machine learning dataset for higher-order logic theorem proving",
    "citation_count": 83,
    "authors": []
  },
  "https://openreview.net/forum?id=HJDBUF5le": {
    "title": "Towards a Neural Statistician",
    "volume": "poster",
    "abstract": "An efficient learner is one who reuses what they already know to tackle a new problem. For a machine learner, this means understanding the similarities amongst datasets. In order to do this, one must take seriously the idea of working with datasets, rather than datapoints, as the key objects to model. Towards this goal, we demonstrate an extension of a variational autoencoder that can learn a method for computing representations, or statistics, of datasets in an unsupervised fashion. The network is trained to produce statistics that encapsulate a generative model for each dataset. Hence the network enables efficient learning from new datasets for both unsupervised and supervised tasks. We show that we are able to learn statistics that can be used for: clustering datasets, transferring generative models to new datasets, selecting representative samples of datasets and classifying previously unseen classes. We refer to our model as a neural statistician, and by this we mean a neural network that can learn to compute summary statistics of datasets without supervision",
    "checked": true,
    "id": "405c31c85a324942811f3c9dc53ce3528f9284df",
    "semantic_title": "towards a neural statistician",
    "citation_count": 428,
    "authors": []
  },
  "https://openreview.net/forum?id=BylSPv9gx": {
    "title": "Exploring Sparsity in Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "Recurrent neural networks (RNN) are widely used to solve a variety of problems and as the quantity of data and the amount of available compute have increased, so have model sizes. The number of parameters in recent state-of-the-art networks makes them hard to deploy, especially on mobile phones and embedded devices. The challenge is due to both the size of the model and the time it takes to evaluate it. In order to deploy these RNNs efficiently, we propose a technique to reduce the parameters of a network by pruning weights during the initial training of the network. At the end of training, the parameters of the network are sparse while accuracy is still close to the original dense neural network. The network size is reduced by 8× and the time required to train the model remains constant. Additionally, we can prune a larger dense network to achieve better than baseline performance while still reducing the total number of parameters significantly. Pruning RNNs reduces the size of the model and can also help achieve significant inference time speed-up using sparse GEMMs. Benchmarks show that using our technique model size can be reduced by 90% and speed-up is around 2× to 7×",
    "checked": true,
    "id": "1cc2f313bcb3b106af081f7031b924c9ad2662bd",
    "semantic_title": "exploring sparsity in recurrent neural networks",
    "citation_count": 313,
    "authors": []
  },
  "https://openreview.net/forum?id=Skq89Scxx": {
    "title": "SGDR: Stochastic Gradient Descent with Warm Restarts",
    "volume": "poster",
    "abstract": "Restart techniques are common in gradient-free optimization to deal with multimodal functions. Partial warm restarts are also gaining popularity in gradient-based optimization to improve the rate of convergence in accelerated gradient schemes to deal with ill-conditioned functions. In this paper, we propose a simple warm restart technique for stochastic gradient descent to improve its anytime performance when training deep neural networks. We empirically study its performance on the CIFAR-10 and CIFAR-100 datasets, where we demonstrate new state-of-the-art results at 3.14\\% and 16.21\\%, respectively. We also demonstrate its advantages on a dataset of EEG recordings and on a downsampled version of the ImageNet dataset. Our source code is available at \\\\ \\url{https://github.com/loshchil/SGDR}",
    "checked": true,
    "id": "b022f2a277a4bf5f42382e86e4380b96340b9e86",
    "semantic_title": "sgdr: stochastic gradient descent with warm restarts",
    "citation_count": 8208,
    "authors": []
  },
  "https://openreview.net/forum?id=rJEgeXFex": {
    "title": "Predicting Medications from Diagnostic Codes with Recurrent Neural Networks",
    "volume": "poster",
    "abstract": "It is a surprising fact that electronic medical records are failing at one of their primary purposes, that of tracking the set of medications that the patient is actively taking. Studies estimate that up to 50% of such lists omit active drugs, and that up to 25% of all active medications do not appear on the appropriate patient list. Manual efforts to maintain these lists involve a great deal of tedious human labor, which could be reduced by computational tools to suggest likely missing or incorrect medications on a patient's list. We report here an application of recurrent neural networks to predict the likely therapeutic classes of medications that a patient is taking, given a sequence of the last 100 billing codes in their record. Our best model was a GRU that achieved high prediction accuracy (micro-averaged AUC 0.93, Label Ranking Loss 0.076), limited by hardware constraints on model size. Additionally, examining individual cases revealed that many of the predictions marked incorrect were likely to be examples of either omitted medications or omitted billing codes, supporting our assertion of a substantial number of errors and omissions in the data, and the likelihood of models such as these to help correct them",
    "checked": true,
    "id": "7e6c752c47d96ff83f44109a4cabd85c8294a37e",
    "semantic_title": "predicting medications from diagnostic codes with recurrent neural networks",
    "citation_count": 53,
    "authors": []
  },
  "https://openreview.net/forum?id=ByqiJIqxg": {
    "title": "Online Bayesian Transfer Learning for Sequential Data Modeling",
    "volume": "poster",
    "abstract": "We consider the problem of inferring a sequence of hidden states associated with a sequence of observations produced by an individual within a population. Instead of learning a single sequence model for the population (which does not account for variations within the population), we learn a set of basis sequence models based on different individuals. The sequence of hidden states for a new individual is inferred in an online fashion by estimating a distribution over the basis models that best explain the sequence of observations of this new individual. We explain how to do this in the context of hidden Markov models with Gaussian mixture models that are learned based on streaming data by online Bayesian moment matching. The resulting transfer learning technique is demonstrated with three real-word applications: activity recognition based on smartphone sensors, sleep classification based on electroencephalography data and the prediction of the direction of future packet flows between a pair of servers in telecommunication networks",
    "checked": true,
    "id": "20be936439c626c11611ce62771e8b8ba3c797f9",
    "semantic_title": "online bayesian transfer learning for sequential data modeling",
    "citation_count": 17,
    "authors": []
  },
  "https://openreview.net/forum?id=BJh6Ztuxl": {
    "title": "Fine-grained Analysis of Sentence Embeddings Using Auxiliary Prediction Tasks",
    "volume": "poster",
    "abstract": "There is a lot of research interest in encoding variable length sentences into fixed length vectors, in a way that preserves the sentence meanings. Two common methods include representations based on averaging word vectors, and representations based on the hidden states of recurrent neural networks such as LSTMs. The sentence vectors are used as features for subsequent machine learning tasks or for pre-training in the context of deep learning. However, not much is known about the properties that are encoded in these sentence representations and about the language information they capture. We propose a framework that facilitates better understanding of the encoded representations. We define prediction tasks around isolated aspects of sentence structure (namely sentence length, word content, and word order), and score representations by the ability to train a classifier to solve each prediction task when using the representation as input. We demonstrate the potential contribution of the approach by analyzing different sentence representation mechanisms. The analysis sheds light on the relative strengths of different sentence embedding methods with respect to these low level prediction tasks, and on the effect of the encoded vector's dimensionality on the resulting representations",
    "checked": true,
    "id": "e44da7d8c71edcc6e575fa7faadd5e75785a7901",
    "semantic_title": "fine-grained analysis of sentence embeddings using auxiliary prediction tasks",
    "citation_count": 546,
    "authors": []
  },
  "https://openreview.net/forum?id=rJTKKKqeg": {
    "title": "Tracking the World State with Recurrent Entity Networks",
    "volume": "poster",
    "abstract": "We introduce a new model, the Recurrent Entity Network (EntNet). It is equipped with a dynamic long-term memory which allows it to maintain and update a rep- resentation of the state of the world as it receives new data. For language under- standing tasks, it can reason on-the-fly as it reads text, not just when it is required to answer a question or respond as is the case for a Memory Network (Sukhbaatar et al., 2015). Like a Neural Turing Machine or Differentiable Neural Computer (Graves et al., 2014; 2016) it maintains a fixed size memory and can learn to perform location and content-based read and write operations. However, unlike those models it has a simple parallel architecture in which several memory loca- tions can be updated simultaneously. The EntNet sets a new state-of-the-art on the bAbI tasks, and is the first method to solve all the tasks in the 10k training examples setting. We also demonstrate that it can solve a reasoning task which requires a large number of supporting facts, which other methods are not able to solve, and can generalize past its training horizon. It can also be practically used on large scale datasets such as Children's Book Test, where it obtains competitive performance, reading the story in a single pass",
    "checked": true,
    "id": "033dd6cf61a6017e9aa9b46068d3c89082849cf3",
    "semantic_title": "tracking the world state with recurrent entity networks",
    "citation_count": 229,
    "authors": []
  },
  "https://openreview.net/forum?id=Byj72udxe": {
    "title": "Pointer Sentinel Mixture Models",
    "volume": "poster",
    "abstract": "Recent neural network sequence models with softmax classifiers have achieved their best language modeling performance only with very large hidden states and large vocabularies. Even then they struggle to predict rare or unseen words even if the context makes the prediction unambiguous. We introduce the pointer sentinel mixture architecture for neural sequence models which has the ability to either reproduce a word from the recent context or produce a word from a standard softmax classifier. Our pointer sentinel-LSTM model achieves state of the art language modeling performance on the Penn Treebank (70.9 perplexity) while using far fewer parameters than a standard softmax LSTM. In order to evaluate how well language models can exploit longer contexts and deal with more realistic vocabularies and corpora we also introduce the freely available WikiText corpus",
    "checked": true,
    "id": "efbd381493bb9636f489b965a2034d529cd56bcd",
    "semantic_title": "pointer sentinel mixture models",
    "citation_count": 2903,
    "authors": []
  },
  "https://openreview.net/forum?id=H12GRgcxg": {
    "title": "Training deep neural-networks using a noise adaptation layer",
    "volume": "poster",
    "abstract": "The availability of large datsets has enabled neural networks to achieve impressive recognition results. However, the presence of inaccurate class labels is known to deteriorate the performance of even the best classifiers in a broad range of classification problems. Noisy labels also tend to be more harmful than noisy attributes. When the observed label is noisy, we can view the correct label as a latent random variable and model the noise processes by a communication channel with unknown parameters. Thus we can apply the EM algorithm to find the parameters of both the network and the noise and to estimate the correct label. In this study we present a neural-network approach that optimizes the same likelihood function as optimized by the EM algorithm. The noise is explicitly modeled by an additional softmax layer that connects the correct labels to the noisy ones. This scheme is then extended to the case where the noisy labels are dependent on the features in addition to the correct labels. Experimental results demonstrate that this approach outperforms previous methods",
    "checked": true,
    "id": "bc550ee45f4194f86c52152c10d302965c3563ca",
    "semantic_title": "training deep neural-networks using a noise adaptation layer",
    "citation_count": 735,
    "authors": []
  },
  "https://openreview.net/forum?id=HyM25Mqel": {
    "title": "Sample Efficient Actor-Critic with Experience Replay",
    "volume": "poster",
    "abstract": "This paper presents an actor-critic deep reinforcement learning agent with experience replay that is stable, sample efficient, and performs remarkably well on challenging environments, including the discrete 57-game Atari domain and several continuous control problems. To achieve this, the paper introduces several innovations, including truncated importance sampling with bias correction, stochastic dueling network architectures, and a new trust region policy optimization method",
    "checked": true,
    "id": "6a43d91c8d883e3463b358571125fa0ec7298b3a",
    "semantic_title": "sample efficient actor-critic with experience replay",
    "citation_count": 762,
    "authors": []
  },
  "https://openreview.net/forum?id=SJkXfE5xx": {
    "title": "Revisiting Classifier Two-Sample Tests",
    "volume": "poster",
    "abstract": "The goal of two-sample tests is to assess whether two samples, $S_P \\sim P^n$ and $S_Q \\sim Q^m$, are drawn from the same distribution. Perhaps intriguingly, one relatively unexplored method to build two-sample tests is the use of binary classifiers. In particular, construct a dataset by pairing the $n$ examples in $S_P$ with a positive label, and by pairing the $m$ examples in $S_Q$ with a negative label. If the null hypothesis ``$P = Q$'' is true, then the classification accuracy of a binary classifier on a held-out subset of this dataset should remain near chance-level. As we will show, such \\emph{Classifier Two-Sample Tests} (C2ST) learn a suitable representation of the data on the fly, return test statistics in interpretable units, have a simple null distribution, and their predictive uncertainty allow to interpret where $P$ and $Q$ differ. The goal of this paper is to establish the properties, performance, and uses of C2ST. First, we analyze their main theoretical properties. Second, we compare their performance against a variety of state-of-the-art alternatives. Third, we propose their use to evaluate the sample quality of generative models with intractable likelihoods, such as Generative Adversarial Networks (GANs). Fourth, we showcase the novel application of GANs together with C2ST for causal discovery",
    "checked": true,
    "id": "cfec1e2e670bc5de1a0621f66eaed7abb56387f3",
    "semantic_title": "revisiting classifier two-sample tests",
    "citation_count": 408,
    "authors": []
  },
  "https://openreview.net/forum?id=BJrFC6ceg": {
    "title": "PixelCNN++: Improving the PixelCNN with Discretized Logistic Mixture Likelihood and Other Modifications",
    "volume": "poster",
    "abstract": "PixelCNNs are a recently proposed class of powerful generative models with tractable likelihood. Here we discuss our implementation of PixelCNNs which we make available at https://github.com/openai/pixel-cnn. Our implementation contains a number of modifications to the original model that both simplify its structure and improve its performance. 1) We use a discretized logistic mixture likelihood on the pixels, rather than a 256-way softmax, which we find to speed up training. 2) We condition on whole pixels, rather than R/G/B sub-pixels, simplifying the model structure. 3) We use downsampling to efficiently capture structure at multiple resolutions. 4) We introduce additional short-cut connections to further speed up optimization. 5) We regularize the model using dropout. Finally, we present state-of-the-art log likelihood results on CIFAR-10 to demonstrate the usefulness of these modifications",
    "checked": true,
    "id": "2e77b99e8bd10b9e4551a780c0bde9dd10fdbe9b",
    "semantic_title": "pixelcnn++: improving the pixelcnn with discretized logistic mixture likelihood and other modifications",
    "citation_count": 945,
    "authors": []
  },
  "https://openreview.net/forum?id=rkE3y85ee": {
    "title": "Categorical Reparameterization with Gumbel-Softmax",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "29e944711a354c396fad71936f536e83025b6ce0",
    "semantic_title": "categorical reparameterization with gumbel-softmax",
    "citation_count": 5398,
    "authors": []
  },
  "https://openreview.net/forum?id=SkB-_mcel": {
    "title": "Central Moment Discrepancy (CMD) for Domain-Invariant Representation Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "01dc0a157e355ddc34a426f121fc871601fda567",
    "semantic_title": "central moment discrepancy (cmd) for domain-invariant representation learning",
    "citation_count": 581,
    "authors": []
  },
  "https://openreview.net/forum?id=ByOvsIqeg": {
    "title": "Regularizing CNNs with Locally Constrained Decorrelations",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2ed2415c39d4023f9af410947b96970803d9f192",
    "semantic_title": "regularizing cnns with locally constrained decorrelations",
    "citation_count": 133,
    "authors": []
  },
  "https://openreview.net/forum?id=B1ewdt9xe": {
    "title": "Deep Predictive Coding Networks for Video Prediction and Unsupervised Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "ad367b44f3434b9ba6b46b41ab083210f6827a9f",
    "semantic_title": "deep predictive coding networks for video prediction and unsupervised learning",
    "citation_count": 936,
    "authors": []
  },
  "https://openreview.net/forum?id=S1jmAotxg": {
    "title": "Stick-Breaking Variational Autoencoders",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "cdc9b1759ee485e34045dbe8de947967d259d191",
    "semantic_title": "stick-breaking variational autoencoders",
    "citation_count": 163,
    "authors": []
  },
  "https://openreview.net/forum?id=SkpSlKIel": {
    "title": "Why Deep Neural Networks for Function Approximation?",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "87524c2bb725f967b7fac73442d6412b43d422d1",
    "semantic_title": "why deep neural networks for function approximation?",
    "citation_count": 385,
    "authors": []
  },
  "https://openreview.net/forum?id=H1acq85gx": {
    "title": "Maximum Entropy Flow Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b88e7d3ecbc62baaf3959fb62702e68790e2bfa6",
    "semantic_title": "maximum entropy flow networks",
    "citation_count": 27,
    "authors": []
  },
  "https://openreview.net/forum?id=SyQq185lg": {
    "title": "Latent Sequence Decompositions",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "105788dd22393d5a4333c167814ec3d38c7d6612",
    "semantic_title": "latent sequence decompositions",
    "citation_count": 62,
    "authors": []
  },
  "https://openreview.net/forum?id=HJWHIKqgl": {
    "title": "Generative Models and Model Criticism via Optimized Maximum Mean Discrepancy",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d772a21f2f687985b41bec2dc47bc2760c57ed2f",
    "semantic_title": "generative models and model criticism via optimized maximum mean discrepancy",
    "citation_count": 263,
    "authors": []
  },
  "https://openreview.net/forum?id=B1Igu2ogg": {
    "title": "Efficient Vector Representation for Documents through Corruption",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "1da8eabfd02436dda5f3131fe404dc840a04e6cc",
    "semantic_title": "efficient vector representation for documents through corruption",
    "citation_count": 118,
    "authors": []
  },
  "https://openreview.net/forum?id=ByldLrqlx": {
    "title": "DeepCoder: Learning to Write Programs",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8a25c9403d8a0e2fb8ca362a1b26262afd57417f",
    "semantic_title": "deepcoder: learning to write programs",
    "citation_count": 576,
    "authors": []
  },
  "https://openreview.net/forum?id=SJzCSf9xg": {
    "title": "On Detecting Adversarial Perturbations",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "061fef7e31c2b6ae59e49b8cf3dfb9c449aebc0a",
    "semantic_title": "on detecting adversarial perturbations",
    "citation_count": 952,
    "authors": []
  },
  "https://openreview.net/forum?id=SJTQLdqlg": {
    "title": "Learning to Remember Rare Events",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "29092f0deaac3898e43b3f094bf15d82b6a99afd",
    "semantic_title": "learning to remember rare events",
    "citation_count": 366,
    "authors": []
  },
  "https://openreview.net/forum?id=H1VyHY9gg": {
    "title": "Data Noising as Smoothing in Neural Network Language Models",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2d5069a99bfa0b47c095bbb5cefd6dba974f72a7",
    "semantic_title": "data noising as smoothing in neural network language models",
    "citation_count": 239,
    "authors": []
  },
  "https://openreview.net/forum?id=S1_pAu9xl": {
    "title": "Trained Ternary Quantization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "d418295cd3027c43eccc5592ae5b8303ba8192be",
    "semantic_title": "trained ternary quantization",
    "citation_count": 1035,
    "authors": []
  },
  "https://openreview.net/forum?id=r10FA8Kxg": {
    "title": "Do Deep Convolutional Nets Really Need to be Deep and Convolutional?",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "def52f9e3650ec4e9cc18b3e316f48e9bf046adf",
    "semantic_title": "do deep convolutional nets really need to be deep and convolutional?",
    "citation_count": 245,
    "authors": []
  },
  "https://openreview.net/forum?id=BysvGP5ee": {
    "title": "Variational Lossy Autoencoder",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "590c9a1ff422b03477f7830b20609f212c85aa13",
    "semantic_title": "variational lossy autoencoder",
    "citation_count": 676,
    "authors": []
  },
  "https://openreview.net/forum?id=Byk-VI9eg": {
    "title": "Generative Multi-Adversarial Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "423fab20c1c39cb6b4d6cf6098f61c092e6d1e3f",
    "semantic_title": "generative multi-adversarial networks",
    "citation_count": 345,
    "authors": []
  },
  "https://openreview.net/forum?id=HyQJ-mclg": {
    "title": "Incremental Network Quantization: Towards Lossless CNNs with Low-precision Weights",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "407ead18083e68626e82e07db1a9289ff0b7e862",
    "semantic_title": "incremental network quantization: towards lossless cnns with low-precision weights",
    "citation_count": 1057,
    "authors": []
  },
  "https://openreview.net/forum?id=HkEI22jeg": {
    "title": "Multilayer Recurrent Network Models of Primate Retinal Ganglion Cell Responses",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "2f8bed08cef7b777da9273f483461ebf4f2e0c63",
    "semantic_title": "multilayer recurrent network models of primate retinal ganglion cell responses",
    "citation_count": 83,
    "authors": []
  },
  "https://openreview.net/forum?id=Bkab5dqxe": {
    "title": "A Compositional Object-Based Approach to Learning Physical Dynamics",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "a1786540a4e15f0757e1b84a02f98ed436a969e0",
    "semantic_title": "a compositional object-based approach to learning physical dynamics",
    "citation_count": 441,
    "authors": []
  },
  "https://openreview.net/forum?id=rkEFLFqee": {
    "title": "Decomposing Motion and Content for Natural Video Sequence Prediction",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "b8375ff50b8a6f1a10dd809129a18df96888ac8b",
    "semantic_title": "decomposing motion and content for natural video sequence prediction",
    "citation_count": 598,
    "authors": []
  },
  "https://openreview.net/forum?id=BybtVK9lg": {
    "title": "Autoencoding Variational Inference For Topic Models",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0c25e5f544167840756950e0ff3edd238a19cfd1",
    "semantic_title": "autoencoding variational inference for topic models",
    "citation_count": 564,
    "authors": []
  },
  "https://openreview.net/forum?id=Sys6GJqxl": {
    "title": "Delving into Transferable Adversarial Examples and Black-box Attacks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "99e5a8c10cf92749d4a7c2949691c3a6046e499a",
    "semantic_title": "delving into transferable adversarial examples and black-box attacks",
    "citation_count": 1744,
    "authors": []
  },
  "https://openreview.net/forum?id=ry4Vrt5gl": {
    "title": "Learning to Optimize",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "ead9a671428631e44f6fe49324efe69da628bc47",
    "semantic_title": "learning to optimize",
    "citation_count": 258,
    "authors": []
  },
  "https://openreview.net/forum?id=SJGPL9Dex": {
    "title": "Understanding Trainable Sparse Coding with Matrix Factorization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9459d92b99220d2bfe8fc530410275d65b71dcd2",
    "semantic_title": "understanding trainable sparse coding via matrix factorization",
    "citation_count": 45,
    "authors": []
  },
  "https://openreview.net/forum?id=SJJKxrsgl": {
    "title": "Emergence of foveal image sampling from learning to attend in visual scenes",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6d49a7ad76e779df812bda5c4b037a0b9d6847be",
    "semantic_title": "emergence of foveal image sampling from learning to attend in visual scenes",
    "citation_count": 39,
    "authors": []
  },
  "https://openreview.net/forum?id=ryT4pvqll": {
    "title": "Improving Policy Gradient by Exploring Under-appreciated Rewards",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "9caf76734a611286513b478ce10557bda477e8ce",
    "semantic_title": "improving policy gradient by exploring under-appreciated rewards",
    "citation_count": 44,
    "authors": []
  },
  "https://openreview.net/forum?id=rJ0-tY5xe": {
    "title": "Learning to Query, Reason, and Answer Questions On Ambiguous Texts",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "bf3db68c31e9850d6039bc2436314faef93973d3",
    "semantic_title": "learning to query, reason, and answer questions on ambiguous texts",
    "citation_count": 24,
    "authors": []
  },
  "https://openreview.net/forum?id=rJ0JwFcex": {
    "title": "Neuro-Symbolic Program Synthesis",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "644ca74f80463415613847ab01cff067fb58f0ad",
    "semantic_title": "neuro-symbolic program synthesis",
    "citation_count": 322,
    "authors": []
  },
  "https://openreview.net/forum?id=HyoST_9xl": {
    "title": "DSD: Dense-Sparse-Dense Training for Deep Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "950619635df80e87c6f25b486cc5eaad4d71d0b0",
    "semantic_title": "dsd: dense-sparse-dense training for deep neural networks",
    "citation_count": 203,
    "authors": []
  },
  "https://openreview.net/forum?id=BJKYvt5lg": {
    "title": "PixelVAE: A Latent Variable Model for Natural Images",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "42e9055ec712ec9c7f0a79d963ea034a72dc7fa8",
    "semantic_title": "pixelvae: a latent variable model for natural images",
    "citation_count": 340,
    "authors": []
  },
  "https://openreview.net/forum?id=Hk95PK9le": {
    "title": "Deep Biaffine Attention for Neural Dependency Parsing",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "8cbef23c9ee2ae7c35cc691a0c1d713a6377c9f2",
    "semantic_title": "deep biaffine attention for neural dependency parsing",
    "citation_count": 1224,
    "authors": []
  },
  "https://openreview.net/forum?id=rJ8uNptgl": {
    "title": "Towards the Limit of Network Quantization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6d749712ef4f02a87f4e362058469a1da46c8bcc",
    "semantic_title": "towards the limit of network quantization",
    "citation_count": 195,
    "authors": []
  },
  "https://openreview.net/forum?id=B1oK8aoxe": {
    "title": "Stochastic Neural Networks for Hierarchical Reinforcement Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "3deecaee4ec1a37de3cb10420eaabff067669e17",
    "semantic_title": "stochastic neural networks for hierarchical reinforcement learning",
    "citation_count": 361,
    "authors": []
  },
  "https://openreview.net/forum?id=rJeKjwvclx": {
    "title": "Dynamic Coattention Networks For Question Answering",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "e978d832a4d86571e1b52aa1685dc32ccb250f50",
    "semantic_title": "dynamic coattention networks for question answering",
    "citation_count": 684,
    "authors": []
  },
  "https://openreview.net/forum?id=Hkg4TI9xl": {
    "title": "A Baseline for Detecting Misclassified and Out-of-Distribution Examples in Neural Networks",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "6ff2a434578ff2746b9283e45abf296887f48a2d",
    "semantic_title": "a baseline for detecting misclassified and out-of-distribution examples in neural networks",
    "citation_count": 3488,
    "authors": []
  },
  "https://openreview.net/forum?id=BJtNZAFgg": {
    "title": "Adversarial Feature Learning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "1db6e3078597386ac4222ba6c3f4f61b61f53539",
    "semantic_title": "adversarial feature learning",
    "citation_count": 1838,
    "authors": []
  },
  "https://openreview.net/forum?id=rkGabzZgl": {
    "title": "Dropout with Expectation-linear Regularization",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "437da3d1024f7312fde8a5287c99c36b559ed8f3",
    "semantic_title": "dropout with expectation-linear regularization",
    "citation_count": 50,
    "authors": []
  },
  "https://openreview.net/forum?id=rJPcZ3txx": {
    "title": "Faster CNNs with Direct Sparse Convolutions and Guided Pruning",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "fe9bc9944984cbc6f9f12e99c1065a47d662e24c",
    "semantic_title": "faster cnns with direct sparse convolutions and guided pruning",
    "citation_count": 184,
    "authors": []
  },
  "https://openreview.net/forum?id=SkkTMpjex": {
    "title": "Distributed Second-Order Optimization using Kronecker-Factored Approximations",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "0c7a93498360ce6c0ff1a7c37fd9b6aa0c054f85",
    "semantic_title": "distributed second-order optimization using kronecker-factored approximations",
    "citation_count": 115,
    "authors": []
  },
  "https://openreview.net/forum?id=rJbbOLcex": {
    "title": "TopicRNN: A Recurrent Neural Network with Long-Range Semantic Dependency",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "7ab2166f6cdb1737e000df66d29c6538afc6811d",
    "semantic_title": "topicrnn: a recurrent neural network with long-range semantic dependency",
    "citation_count": 243,
    "authors": []
  },
  "https://openreview.net/forum?id=B1M8JF9xx": {
    "title": "On the Quantitative Analysis of Decoder-Based Generative Models",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "858dc7408c27702ec42778599fc8d11f73ef3f76",
    "semantic_title": "on the quantitative analysis of decoder-based generative models",
    "citation_count": 223,
    "authors": []
  },
  "https://openreview.net/forum?id=r1Aab85gg": {
    "title": "Offline bilingual word vectors, orthogonal transformations and the inverted softmax",
    "volume": "poster",
    "abstract": "",
    "checked": true,
    "id": "02e45b3472fa4c879f8e9ca0dbb283c774a338cb",
    "semantic_title": "offline bilingual word vectors, orthogonal transformations and the inverted softmax",
    "citation_count": 537,
    "authors": []
  },
  "https://openreview.net/forum?id=Sy6iJDqlx": {
    "title": "Attend, Adapt and Transfer: Attentive Deep Architecture for Adaptive Transfer from multiple sources in the same domain",
    "volume": "poster",
    "abstract": "Transferring knowledge from prior source tasks in solving a new target task can be useful in several learning applications. The application of transfer poses two serious challenges which have not been adequately addressed. First, the agent should be able to avoid negative transfer, which happens when the transfer hampers or slows down the learning instead of helping it. Second, the agent should be able to selectively transfer, which is the ability to select and transfer from different and multiple source tasks for different parts of the state space of the target task. We propose A2T (Attend Adapt and Transfer), an attentive deep architecture which adapts and transfers from these source tasks. Our model is generic enough to effect transfer of either policies or value functions. Empirical evaluations on different learning algorithms show that A2T is an effective architecture for transfer by being able to avoid negative transfer while transferring selectively from multiple source tasks in the same domain",
    "checked": true,
    "id": "8bada64d0b04a66165b464a51c29f61e1f474f2a",
    "semantic_title": "attend, adapt and transfer: attentive deep architecture for adaptive transfer from multiple sources in the same domain",
    "citation_count": 52,
    "authors": []
  },
  "https://openreview.net/forum?id=rkE8pVcle": {
    "title": "Learning through Dialogue Interactions by Asking Questions",
    "volume": "poster",
    "abstract": "A good dialogue agent should have the ability to interact with users by both responding to questions and by asking questions, and importantly to learn from both types of interactions. In this work, we explore this direction by designing a simulator and a set of synthetic tasks in the movie domain that allow such interactions between a learner and a teacher. We investigate how a learner can benefit from asking questions in both offline and online reinforcement learning settings, and demonstrate that the learner improves when asking questions. Our work represents a first step in developing such end-to-end learned interactive dialogue agents",
    "checked": true,
    "id": "2685cab753e4c1e9ac6e68b28ad8e2e1f3673f73",
    "semantic_title": "learning through dialogue interactions",
    "citation_count": 55,
    "authors": []
  },
  "https://openreview.net/forum?id=SyVVJ85lg": {
    "title": "Paleo: A Performance Model for Deep Neural Networks",
    "volume": "poster",
    "abstract": "Although various scalable deep learning software packages have been proposed, it remains unclear how to best leverage parallel and distributed computing infrastructure to accelerate their training and deployment. Moreover, the effectiveness of existing parallel and distributed systems varies widely based on the neural network architecture and dataset under consideration. In order to efficiently explore the space of scalable deep learning systems and quickly diagnose their effectiveness for a given problem instance, we introduce an analytical performance model called Paleo. Our key observation is that a neural network architecture carries with it a declarative specification of the computational requirements associated with its training and evaluation. By extracting these requirements from a given architecture and mapping them to a specific point within the design space of software, hardware and communication strategies, Paleo can efficiently and accurately model the expected scalability and performance of a putative deep learning system. We show that Paleo is robust to the choice of network architecture, hardware, software, communication schemes, and parallelization strategies. We further demonstrate its ability to accurately model various recently published scalability results for CNNs such as NiN, Inception and AlexNet",
    "checked": true,
    "id": "36348af997c8ff309fabe0561487ae97cf317ef4",
    "semantic_title": "paleo: a performance model for deep neural networks",
    "citation_count": 225,
    "authors": []
  },
  "https://openreview.net/forum?id=BJO-BuT1g": {
    "title": "A Learned Representation For Artistic Style",
    "volume": "poster",
    "abstract": "The diversity of painting styles represents a rich visual vocabulary for the construction of an image. The degree to which one may learn and parsimoniously capture this visual vocabulary measures our understanding of the higher level features of paintings, if not images in general. In this work we investigate the construction of a single, scalable deep network that can parsimoniously capture the artistic style of a diversity of paintings. We demonstrate that such a network generalizes across a diversity of artistic styles by reducing a painting to a point in an embedding space. Importantly, this model permits a user to explore new painting styles by arbitrarily combining the styles learned from individual paintings. We hope that this work provides a useful step towards building rich models of paintings and offers a window on to the structure of the learned representation of artistic style",
    "checked": true,
    "id": "99542f614d7e4146cad17196e76c997e57a69e4d",
    "semantic_title": "a learned representation for artistic style",
    "citation_count": 1167,
    "authors": []
  },
  "https://openreview.net/forum?id=BJ5UeU9xx": {
    "title": "Visualizing Deep Neural Network Decisions: Prediction Difference Analysis",
    "volume": "poster",
    "abstract": "This article presents the prediction difference analysis method for visualizing the response of a deep neural network to a specific input. When classifying images, the method highlights areas in a given input image that provide evidence for or against a certain class. It overcomes several shortcoming of previous methods and provides great additional insight into the decision making process of classifiers. Making neural network decisions interpretable through visualization is important both to improve models and to accelerate the adoption of black-box classifiers in application areas such as medicine. We illustrate the method in experiments on natural images (ImageNet data), as well as medical images (MRI brain scans)",
    "checked": true,
    "id": "29069976eb7f828de91ed243cd12fd99fef56d94",
    "semantic_title": "visualizing deep neural network decisions: prediction difference analysis",
    "citation_count": 709,
    "authors": []
  },
  "https://openreview.net/forum?id=r1aPbsFle": {
    "title": "Tying Word Vectors and Word Classifiers: A Loss Framework for Language Modeling",
    "volume": "poster",
    "abstract": "Recurrent neural networks have been very successful at predicting sequences of words in tasks such as language modeling. However, all such models are based on the conventional classification framework, where the model is trained against one-hot targets, and each word is represented both as an input and as an output in isolation. This causes inefficiencies in learning both in terms of utilizing all of the information and in terms of the number of parameters needed to train. We introduce a novel theoretical framework that facilitates better learning in language modeling, and show that our framework leads to tying together the input embedding and the output projection matrices, greatly reducing the number of trainable variables. Our framework leads to state of the art performance on the Penn Treebank with a variety of network models",
    "checked": true,
    "id": "424aef7340ee618132cc3314669400e23ad910ba",
    "semantic_title": "tying word vectors and word classifiers: a loss framework for language modeling",
    "citation_count": 385,
    "authors": []
  },
  "https://openreview.net/forum?id=HJgXCV9xx": {
    "title": "Dialogue Learning With Human-in-the-Loop",
    "volume": "poster",
    "abstract": "An important aspect of developing conversational agents is to give a bot the ability to improve through communicating with humans and to learn from the mistakes that it makes. Most research has focused on learning from fixed training sets of labeled data rather than interacting with a dialogue partner in an online fashion. In this paper we explore this direction in a reinforcement learning setting where the bot improves its question-answering ability from feedback a teacher gives following its generated responses. We build a simulator that tests various aspects of such learning in a synthetic environment, and introduce models that work in this regime. Finally, real experiments with Mechanical Turk validate the approach",
    "checked": true,
    "id": "3d3b4ec7789f634e0752d50484dad7d2ea2460d5",
    "semantic_title": "dialogue learning with human-in-the-loop",
    "citation_count": 134,
    "authors": []
  },
  "https://openreview.net/forum?id=HJ0UKP9ge": {
    "title": "Bidirectional Attention Flow for Machine Comprehension",
    "volume": "poster",
    "abstract": "Machine comprehension (MC), answering a query about a given context paragraph, requires modeling complex interactions between the context and the query. Recently, attention mechanisms have been successfully extended to MC. Typically these methods use attention to focus on a small portion of the context and summarize it with a fixed-size vector, couple attentions temporally, and/or often form a uni-directional attention. In this paper we introduce the Bi-Directional Attention Flow (BIDAF) network, a multi-stage hierarchical process that represents the context at different levels of granularity and uses bi-directional attention flow mechanism to obtain a query-aware context representation without early summarization. Our experimental evaluations show that our model achieves the state-of-the-art results in Stanford Question Answering Dataset (SQuAD) and CNN/DailyMail cloze test",
    "checked": true,
    "id": "3a7b63b50c64f4ec3358477790e84cbd6be2a0b4",
    "semantic_title": "bidirectional attention flow for machine comprehension",
    "citation_count": 2091,
    "authors": []
  },
  "https://openreview.net/forum?id=Skvgqgqxe": {
    "title": "Learning to Compose Words into Sentences with Reinforcement Learning",
    "volume": "poster",
    "abstract": "We use reinforcement learning to learn tree-structured neural networks for computing representations of natural language sentences. In contrast with prior work on tree-structured models, in which the trees are either provided as input or predicted using supervision from explicit treebank annotations, the tree structures in this work are optimized to improve performance on a downstream task. Experiments demonstrate the benefit of learning task-specific composition orders, outperforming both sequential encoders and recursive encoders based on treebank annotations. We analyze the induced trees and show that while they discover some linguistically intuitive structures (e.g., noun phrases, simple verb phrases), they are different than conventional English syntactic structures",
    "checked": true,
    "id": "599f7863721d542dcef2da49b41d82b21e4f80b3",
    "semantic_title": "learning to compose words into sentences with reinforcement learning",
    "citation_count": 160,
    "authors": []
  },
  "https://openreview.net/forum?id=BJK3Xasel": {
    "title": "Nonparametric Neural Networks",
    "volume": "poster",
    "abstract": "Automatically determining the optimal size of a neural network for a given task without prior information currently requires an expensive global search and training many networks from scratch. In this paper, we address the problem of automatically finding a good network size during a single training cycle. We introduce {\\it nonparametric neural networks}, a non-probabilistic framework for conducting optimization over all possible network sizes and prove its soundness when network growth is limited via an $\\ell_p$ penalty. We train networks under this framework by continuously adding new units while eliminating redundant units via an $\\ell_2$ penalty. We employ a novel optimization algorithm, which we term ``Adaptive Radial-Angular Gradient Descent'' or {\\it AdaRad}, and obtain promising results",
    "checked": true,
    "id": "46357ea4ad096e0674569efa29d3e34006786d04",
    "semantic_title": "nonparametric neural networks",
    "citation_count": 21,
    "authors": []
  },
  "https://openreview.net/forum?id=BJ6oOfqge": {
    "title": "Temporal Ensembling for Semi-Supervised Learning",
    "volume": "poster",
    "abstract": "In this paper, we present a simple and efficient method for training deep neural networks in a semi-supervised setting where only a small portion of training data is labeled. We introduce self-ensembling, where we form a consensus prediction of the unknown labels using the outputs of the network-in-training on different epochs, and most importantly, under different regularization and input augmentation conditions. This ensemble prediction can be expected to be a better predictor for the unknown labels than the output of the network at the most recent training epoch, and can thus be used as a target for training. Using our method, we set new records for two standard semi-supervised learning benchmarks, reducing the (non-augmented) classification error rate from 18.44% to 7.05% in SVHN with 500 labels and from 18.63% to 16.55% in CIFAR-10 with 4000 labels, and further to 5.12% and 12.16% by enabling the standard augmentations. We additionally obtain a clear improvement in CIFAR-100 classification accuracy by using random images from the Tiny Images dataset as unlabeled extra inputs during training. Finally, we demonstrate good tolerance to incorrect labels",
    "checked": true,
    "id": "d2e4587744a89bad95fea69e08842cad6c8ff0dd",
    "semantic_title": "temporal ensembling for semi-supervised learning",
    "citation_count": 2572,
    "authors": []
  },
  "https://openreview.net/forum?id=SJU4ayYgl": {
    "title": "Semi-Supervised Classification with Graph Convolutional Networks",
    "volume": "poster",
    "abstract": "We present a scalable approach for semi-supervised learning on graph-structured data that is based on an efficient variant of convolutional neural networks which operate directly on graphs. We motivate the choice of our convolutional architecture via a localized first-order approximation of spectral graph convolutions. Our model scales linearly in the number of graph edges and learns hidden layer representations that encode both local graph structure and features of nodes. In a number of experiments on citation networks and on a knowledge graph dataset we demonstrate that our approach outperforms related methods by a significant margin",
    "checked": true,
    "id": "36eff562f65125511b5dfab68ce7f7a943c27478",
    "semantic_title": "semi-supervised classification with graph convolutional networks",
    "citation_count": 29280,
    "authors": []
  },
  "https://openreview.net/forum?id=By5e2L9gl": {
    "title": "Trusting SVM for Piecewise Linear CNNs",
    "volume": "poster",
    "abstract": "We present a novel layerwise optimization algorithm for the learning objective of Piecewise-Linear Convolutional Neural Networks (PL-CNNs), a large class of convolutional neural networks. Specifically, PL-CNNs employ piecewise linear non-linearities such as the commonly used ReLU and max-pool, and an SVM classifier as the final layer. The key observation of our approach is that the prob- lem corresponding to the parameter estimation of a layer can be formulated as a difference-of-convex (DC) program, which happens to be a latent structured SVM. We optimize the DC program using the concave-convex procedure, which requires us to iteratively solve a structured SVM problem. This allows to design an opti- mization algorithm with an optimal learning rate that does not require any tuning. Using the MNIST, CIFAR and ImageNet data sets, we show that our approach always improves over the state of the art variants of backpropagation and scales to large data and large network settings",
    "checked": true,
    "id": "cd4cd2ca053d8b7d5becbf4abf90a62a9ba80c1c",
    "semantic_title": "trusting svm for piecewise linear cnns",
    "citation_count": 11,
    "authors": []
  },
  "https://openreview.net/forum?id=Byiy-Pqlx": {
    "title": "Lie-Access Neural Turing Machines",
    "volume": "poster",
    "abstract": "External neural memory structures have recently become a popular tool for algorithmic deep learning (Graves et al. 2014; Weston et al. 2014). These models generally utilize differentiable versions of traditional discrete memory-access structures (random access, stacks, tapes) to provide the storage necessary for computational tasks. In this work, we argue that these neural memory systems lack specific structure important for relative indexing, and propose an alternative model, Lie-access memory, that is explicitly designed for the neural setting. In this paradigm, memory is accessed using a continuous head in a key-space manifold. The head is moved via Lie group actions, such as shifts or rotations, generated by a controller, and memory access is performed by linear smoothing in key space. We argue that Lie groups provide a natural generalization of discrete memory structures, such as Turing machines, as they provide inverse and identity operators while maintaining differentiability. To experiment with this approach, we implement a simplified Lie-access neural Turing machine (LANTM) with different Lie groups. We find that this approach is able to perform well on a range of algorithmic tasks",
    "checked": true,
    "id": "15778857f5b4de361dffa3fd156a269184dd2f9e",
    "semantic_title": "lie-access neural turing machines",
    "citation_count": 6,
    "authors": []
  },
  "https://openreview.net/forum?id=r1X3g2_xl": {
    "title": "Adversarial Training Methods for Semi-Supervised Text Classification",
    "volume": "poster",
    "abstract": "Adversarial training provides a means of regularizing supervised learning algorithms while virtual adversarial training is able to extend supervised learning algorithms to the semi-supervised setting. However, both methods require making small perturbations to numerous entries of the input vector, which is inappropriate for sparse high-dimensional inputs such as one-hot word representations. We extend adversarial and virtual adversarial training to the text domain by applying perturbations to the word embeddings in a recurrent neural network rather than to the original input itself. The proposed method achieves state of the art results on multiple benchmark semi-supervised and purely supervised tasks. We provide visualizations and analysis showing that the learned word embeddings have improved in quality and that while training, the model is less prone to overfitting",
    "checked": true,
    "id": "2cd55ded95d5d13430edfa223ba591b514ebe8a5",
    "semantic_title": "adversarial training methods for semi-supervised text classification",
    "citation_count": 1063,
    "authors": []
  },
  "https://openreview.net/forum?id=B1kJ6H9ex": {
    "title": "Combining policy gradient and Q-learning",
    "volume": "poster",
    "abstract": "Policy gradient is an efficient technique for improving a policy in a reinforcement learning setting. However, vanilla online variants are on-policy only and not able to take advantage of off-policy data. In this paper we describe a new technique that combines policy gradient with off-policy Q-learning, drawing experience from a replay buffer. This is motivated by making a connection between the fixed points of the regularized policy gradient algorithm and the Q-values. This connection allows us to estimate the Q-values from the action preferences of the policy, to which we apply Q-learning updates. We refer to the new technique as ‘PGQL', for policy gradient and Q-learning. We also establish an equivalency between action-value fitting techniques and actor-critic algorithms, showing that regularized policy gradient techniques can be interpreted as advantage function learning algorithms. We conclude with some numerical examples that demonstrate improved data efficiency and stability of PGQL. In particular, we tested PGQL on the full suite of Atari games and achieved performance exceeding that of both asynchronous advantage actor-critic (A3C) and Q-learning",
    "checked": true,
    "id": "c40dd8f235aabe6efbb93c59c0536adf491f9ead",
    "semantic_title": "pgq: combining policy gradient and q-learning",
    "citation_count": 140,
    "authors": []
  }
}