{
  "https://www.ijcai.org/Abstract/16/008": {
    "title": "Interdependent Scheduling Games",
    "abstract": "We propose a model of interdependent scheduling games in which each player controls a set of services that they schedule independently. A player is free to schedule his own services at any time; however, each of these services only begins to accrue reward for the player when all predecessor services, which may or may not be controlled by the same player, have been activated. This model, where players have interdependent services, is motivated by the problems faced in planning and coordinating large-scale infrastructures, e.g., restoring electricity and gas to residents after a natural disaster or providing medical care in a crisis when different agencies are responsible for the delivery of staff, equipment, and medicine. We undertake a game-theoretic analysis of this setting and in particular consider the issues of welfare maximization, computing best responses, Nash dynamics, and existence and computation of Nash equilibria",
    "volume": "main",
    "checked": false,
    "id": "056e0e9ead966da3711daa72adf58af6ce2e0d78",
    "citation_count": 15
  },
  "https://www.ijcai.org/Abstract/16/009": {
    "title": "Scalable Greedy Algorithms for Task",
    "abstract": "Synergistic interactions between task/resource allocation and stochastic planning exist in many environments such as transportation and logistics, UAV task assignment and disaster rescue. Existing research in exploiting these synergistic interactions between the two problems have either only considered domains where tasks/resources are completely independent of each other or have focussed on approaches with limited scalability. In this paper, we address these two limitations by introducing a generic model for task/resource constrained multi-agent stochastic planning, referred to as TasC-MDPs. We provide two scalable greedy algorithms, one of which provides posterior quality guarantees. Finally, we illustrate the high scalability and solution performance of our approaches in comparison with existing work on two benchmark problems from the literature",
    "volume": "main",
    "checked": false,
    "id": "6e0dbd1de320ea70a1ebc974c1e0f797e2fbcc0a",
    "citation_count": 20
  },
  "https://www.ijcai.org/Abstract/16/010": {
    "title": "Coco: Runtime Reasoning about Conflicting Commitments",
    "abstract": "To interact effectively, agents must enter into commitments. What should an agent do when these commitments conflict? We describe Coco, an approach for reasoning about which specific commitments apply to specific parties in light of general types of commitments, specific circumstances, and dominance relations among specific commitments. Coco adapts answer-set programming to identify a maximal set of nondominated commitments. It provides a modeling language and tool geared to support practical applications",
    "volume": "main",
    "checked": true,
    "id": "13e866066ad1aba52c69ef8e88e251129b326407",
    "citation_count": 13
  },
  "https://www.ijcai.org/Abstract/16/011": {
    "title": "Verifying Existence of Resource-Bounded Coalition Uniform Strategies",
    "abstract": "We consider the problem of whether a coalition of agents has a knowledge-based strategy to ensure some outcome under a resource bound. We extend previous work on verification of multi-agent systems where actions of agents produce and consume resources, by adding epistemic pre- and postconditions to actions. This allows us to model scenarios where agents perform both actions which change the world, and actions which change their knowledge about the world, such as observation and communication. To avoid logical omniscience and obtain a compact model of the system, our model of agents' knowledge is syntactic. We define a class of coalition-uniform strategies with respect to any (decidable) notion of coalition knowledge. We show that the model-checking problem for the resulting logic is decidable for any notion of coalition-uniform strategies in these classes",
    "volume": "main",
    "checked": true,
    "id": "d9d8bb8fc73a6bf0f0725cb75e4f71018d8909f6",
    "citation_count": 8
  },
  "https://www.ijcai.org/Abstract/16/012": {
    "title": "On Truthful Mechanisms for Maximin Share Allocations",
    "abstract": "We study a fair division problem with indivisible items, namely the computation of maximin share allocations. Given a set of n players, the maximin share of a single player is the best she can guarantee to herself, if she would partition the items in any way she prefers, into n bundles, and then receive her least desirable bundle. The objective then is to find an allocation, so that each player is guaranteed her maximin share. Previous works have studied this problem purely algorithmically, providing constant factor approximation algorithms. In this work, we embark on a mechanism design approach and investigate the existence of truthful mechanisms. We propose three models regarding the information that the mechanism attempts to elicit from the players, based on the cardinal and ordinal representation of preferences. We establish positive and negative (impossibility) results for each model and highlight the limitations imposed by truthfulness on the approximability of the problem. Finally, we pay particular attention to the case of two players, which already leads to challenging questions",
    "volume": "main",
    "checked": true,
    "id": "37f5507898a008f58e84eb4c707d5c8881de2cd5",
    "citation_count": 49
  },
  "https://www.ijcai.org/Abstract/16/013": {
    "title": "Modeling and Reasoning about NTU Games via Answer Set Programming",
    "abstract": "A compact representation for non-transferable utility games founding on answer set programming is proposed. The representation is fully expressive, in that it can capture all games defined over a finite set of alternatives. Moreover, due to the knowledge representation capabilities of answer set programs, it can easily accommodate the definition of games within a wide range of application domains, ranging from scheduling, to routing and planning, just to name a few. The computational complexity of the proposed framework is studied, in particular, by focusing on the core as the prototypical solution concept. A system supporting the basic reasoning tasks arising therein is also made available, and results of experimental activity are discussed",
    "volume": "main",
    "checked": true,
    "id": "46656d6a152912ce901659c4a55391734beddfa5",
    "citation_count": 25
  },
  "https://www.ijcai.org/Abstract/16/014": {
    "title": "Randomized Social Choice Functions under Metric Preferences",
    "abstract": "We determine the quality of randomized social choice mechanisms in a setting in which the agents have metric preferences: every agent has a cost for each alternative, and these costs form a metric. We assume that these costs are unknown to the mechanisms (and possibly even to the agents themselves), which means we cannot simply select the optimal alternative, i.e. the alternative that minimizes the total agent cost (or median agent cost). However, we do assume that the agents know their ordinal preferences that are induced by the metric space. We examine randomized social choice functions that require only this ordinal information and select an alternative that is good in expectation with respect to the costs from the metric. To quantify how good a randomized social choice function is, we bound the distortion, which is the worst-case ratio between expected cost of the alternative selected and the cost of the optimal alternative. We provide new distortion bounds for a variety of randomized mechanisms, for both general metrics and for important special cases. Our results show a sizable improvement in distortion over deterministic mechanisms",
    "volume": "main",
    "checked": true,
    "id": "1e225b7fbcf54c0c55a04978ab9c45e728e6d09c",
    "citation_count": 107
  },
  "https://www.ijcai.org/Abstract/16/015": {
    "title": "Generalized Discrete Preference Games",
    "abstract": "Recently, much attention has been devoted to discrete preference games to model the formation of opinions in social networks. More specifically, these games model the agents' strategic decision of expressing publicly an opinion, which is a result of an interplay between the agent's private belief and the social pressure. However, these games have very limited expressive power; they can model only very simple social relations and they assume that all the agents respond to social pressure in the same way. In this paper, we define and study the novel class of generalized discrete preference games. These games have additional characteristics that can model social relations to allies or competitors and complex relations among more than two agents. Moreover, they introduce different levels of strength for each relation, and they personalize the dependence of each agent to her neighborhood",
    "volume": "main",
    "checked": true,
    "id": "1ba7da336685af59c1ca7c6c5aeff21b37868e10",
    "citation_count": 27
  },
  "https://www.ijcai.org/Abstract/16/016": {
    "title": "Computing Pareto Optimal Committees",
    "abstract": "Selecting a set of alternatives based on the preferences of agents is an important problem in committee selection and beyond. Among the various criteria put forth for desirability of a committee, Pareto optimality is a minimal and important requirement.As asking agents to specify their preferences over exponentially many subsets of alternatives is practically infeasible,we assume that each agent specifies a weak order on single alternatives, from which a preference relation over subsets is derived using some preference extension.We consider four prominent extensions (responsive, leximax, best, and worst). For each of them, we consider the corresponding Pareto optimality notion, and we study the complexity of computing and verifying Pareto optimal outcomes. We also consider strategic issues: for three of the set extensions, we present linear-time, Pareto optimal and strategyproof algorithms that work even for weak preferences",
    "volume": "main",
    "checked": true,
    "id": "ce980cfe74d79f580e636b4d76b99e89bd184267",
    "citation_count": 31
  },
  "https://www.ijcai.org/Abstract/16/017": {
    "title": "Control of Fair Division",
    "abstract": "We initiate the study of control actions in fair division problems where a benevolent or malicious central organizer changes the structure of the fair division problem for self-interest or to benefit one, some or all agents. One motivation for such control is to improve fairness by minimally changing the problem. As a case study, we consider the problem of adding or deleting a small number of items to improve fairness. For two agents, we present polynomial-time algorithms for adding or deleting the minimum number of items to achieve ordinal envy-freeness. For three agents, we show that both problems, as well as the more basic problem of checking whether an envy-free allocation exists, are NP-complete. This closes a problem open for over five years. Our framework leads to a number of interesting directions in the area of fair division",
    "volume": "main",
    "checked": true,
    "id": "6047f1f8344ad4396c0075dac7813a84a23d932e",
    "citation_count": 18
  },
  "https://www.ijcai.org/Abstract/16/018": {
    "title": "A Characterization of Voting Power for Discrete Weight Distributions",
    "abstract": "Weighted voting games model decision-making bodies where decisions are made by a majority vote. In such games, each agent has a weight, and a coalition of agents wins the game if the sum of the weights of its members exceeds a certain quota. The Shapley value is used as an index for the true power held by the agents in such games. Earlier work has studied the implications of setting the value of the quota on the agents' power under the assumption that the game is given with a fixed set of agent weights. We focus on a model where the agent weights originate from a stochastic process, resulting in weight uncertainty. We analyze the expected effect of the quota on voting power given the weight generating process. We examine two extreme cases of the balls and bins model: uniform and exponentially decaying probabilities. We show that the choice of a quota may have a large influence on the power disparity of the agents, even when the governing distribution is likely to result in highly similar weights for the agents. We characterize various interesting repetitive fluctuation patterns in agents' power as a function of the quota",
    "volume": "main",
    "checked": true,
    "id": "125555a6c78a228f953507eefddb5f796a10de7b",
    "citation_count": 4
  },
  "https://www.ijcai.org/Abstract/16/019": {
    "title": "Misrepresentation in District Voting",
    "abstract": "Voting systems in which voters are partitioned to districts encourage accountability by providing voters an easily identifiable district representative, but can result in a selection of representatives not representative of the electorate's preferences. In some cases, a party may have a majority of the popular vote, but lose the elections due to districting effects. We define the Misrepresentation Ratio which quantifies the deviation from proportional representation in a district-based election, and provide bounds for this ratio under various voting rules. We also examine probabilistic models for election outcomes, and provide an algorithm for approximating the expected Misrepresentation Ratio under a given probabilistic election model. Finally, we provide simulation results for several such probabilistic election models, showing the effects of the number of voters and candidates on the misrepresentation ratio",
    "volume": "main",
    "checked": true,
    "id": "9f77cc6f9143c914cc122fd39a8706a6e0767d26",
    "citation_count": 35
  },
  "https://www.ijcai.org/Abstract/16/020": {
    "title": "Conditional and Sequential Approval Voting on Combinatorial Domains",
    "abstract": "Several methods exist for making collective decisions on a set of variables when voters possibly have preferential dependencies. None is based on approval voting. We define a family of rules for approval-based voting on combinatorial domains, where voters cast conditional approval ballots, allowing them to approve values of a variable conditionally on the values of other variables. We study three such rules. The first two generalize simple multiwinner approval voting and minimax approval voting. The third one is an approval-based version of sequential voting on combinatorial domains. We study some properties of these rules, and compare their outcomes",
    "volume": "main",
    "checked": true,
    "id": "d7609d573d01c697566944fc2f3d3299582b72dd",
    "citation_count": 9
  },
  "https://www.ijcai.org/Abstract/16/021": {
    "title": "On Logics of Strategic Ability Based on Propositional Control",
    "abstract": "Recently logics for strategic ability have gained pre-eminence in the modelisation and analysis of game-theoretic scenarios. In this paper we provide a contribution to the comparison of two popular frameworks: Concurrent Game Structures (CGS) and Coalition Logic of Propositional Control (CLPC). Specifically, we ground the abstract abilities of agents in CGS on Propositional Control, thus obtaining a class of CGS that has the same expressive power as CL-PC. We study the computational properties of this setting. Further, we relax some of the assumptions of CL-PC so as to introduce a wider class of computationally-grounded CGS",
    "volume": "main",
    "checked": true,
    "id": "ea91e5fdf519ff7a99f9fd2f51484c3d536a8b77",
    "citation_count": 3
  },
  "https://www.ijcai.org/Abstract/16/022": {
    "title": "Complexity of Efficient and Envy-Free Resource Allocation: Few Agents, Resources, or Utility Levels",
    "abstract": "We study the problem of finding a Pareto-efficient and envy-free allocation of a set of indivisible resources to a set of agents with monotonic preferences, either dichotomous or additive. Motivated by results of Bouveret and Lang [JAIR 2008], we provide a refined computational complexity analysis by studying the influence of three natural parameters: the number n of agents, the number m of resources, and the number z of different numbers occurring in utility-based preferences of the agents. On the negative side, we show that small values for n and z alone do not significantly lower the computational complexity in most cases. On the positive side, devising fixed-parameter algorithms we show that all considered problems are tractable in case of small m. Furthermore, we develop a fixed-parameter algorithm indicating that the problem with additive preferences becomes computationally tractable in case of small n and small z",
    "volume": "main",
    "checked": true,
    "id": "5418a875cc3acad66b70a94c83b1933580fc06cd",
    "citation_count": 28
  },
  "https://www.ijcai.org/Abstract/16/023": {
    "title": "The Complexity of Playing Durak",
    "abstract": "Durak is a Russian card game in which players try to get rid of all their cards via a particular attack/defense mechanism. The last player standing with cards loses. We show that, even restricted to the perfect information two-player game, finding optimal moves is a hard problem. More precisely, we prove that, given a generalized Durak position, it is PSPACE-complete to decide if a player has a winning strategy. We also show that deciding if an attack can be answered is NP-hard",
    "volume": "main",
    "checked": true,
    "id": "cd62f0911a8161a3b63aa749d8d839259d143e61",
    "citation_count": 2
  },
  "https://www.ijcai.org/Abstract/16/024": {
    "title": "Proving the Incompatibility of Efficiency and Strategyproofness via SMT Solving",
    "abstract": "Two important requirements when aggregating the preferences of multiple agents are that the outcome should be economically efficient and the aggregation mechanism should not be manipulable. In this paper, we provide a computer-aided proof of a sweeping impossibility using these two conditions for randomized aggregation mechanisms. More precisely, we show that every efficient aggregation mechanism can be manipulated for all expected utility representations of the agents' preferences. This settles a conjecture by Aziz et al. [2013b] and strengthens a number of existing theorems, including statements that were shown within the special domain of assignment. Our proof is obtained by formulating the claim as a satisfiability problem over predicates from real-valued arithmetic, which is then checked using an SMT (satisfiability modulo theories) solver. To the best of our knowledge, this is the first application of SMT solvers in computational social choice",
    "volume": "main",
    "checked": true,
    "id": "26f14da587d689c8e15d78840a97204d44225619",
    "citation_count": 43
  },
  "https://www.ijcai.org/Abstract/16/025": {
    "title": "To Give or Not to Give: Fair Division for Single Minded Valuations",
    "abstract": "Single minded agents have strict preferences, in which a bundle is acceptable only if it meets a certain demand. Such preferences arise naturally in scenarios such as allocating computational resources among users, where the goal is to fairly serve as many requests as possible. In this paper we study the fair division problem for such agents, which is complex due to discontinuity and complementarities of preferences. Our solution concept — the competitive allocation from equal incomes (CAEI) — is inspired from market equilibria and implements fair outcomes through a pricing mechanism. We study existence and computation of CAEI for multiple divisible goods, discrete goods, and cake cutting. Our solution is useful more generally, when the players have a target set of goods, and very small positive values for any bundle other than their target set",
    "volume": "main",
    "checked": true,
    "id": "6b39dedf1f6828c46db7aaea5196b8c5abf9e1ab",
    "citation_count": 14
  },
  "https://www.ijcai.org/Abstract/16/026": {
    "title": "Pairwise Diffusion of Preference Rankings in Social Networks",
    "abstract": "We introduce a model of preference diffusion in which agents in a social network update their preferences based on those of their influencers in the network, and we study the dynamics of this model. Preferences are modelled as ordinal rankings over a finite set of alternatives. At each time step, some of the agents update the relative ordering of two alternatives adjacent in their current ranking with the majority view of their influencers. We consider both a synchronous and an asynchronous variant of this model. Our results show how the graph-theoretic structure of the social network and the structure of the agents' preferences affect the termination of the diffusion process and the properties of the preference profile at the time of termination",
    "volume": "main",
    "checked": true,
    "id": "ed4d729172b7c244a29ad892aac191b30ab84c4a",
    "citation_count": 33
  },
  "https://www.ijcai.org/Abstract/16/027": {
    "title": "Facility Location with Minimax Envy",
    "abstract": "We study the problem of locating a public facility on a real line or an interval, when agents' costs are their (expected) distances from the location of the facility. Our goal is to minimize the maximum envy over all agents, which we will refer to as the minimax envy objective, while at the same time ensuring that agents will report their most preferred locations truthfully. First, for the problem of locating the facility on a real line, we propose a class of truthful-in-expectation mechanisms that generalize the well-known LRM mechanism, the best of which has performance arbitrarily close to the social optimum. Then, we restrict the possible locations of the facility to a real interval and consider two cases; when the interval is determined relatively to the agents' reports and when the interval is fixed in advance. For the former case, we prove that for any choice of such an interval, there is a mechanism in the aforementioned class with additive approximation arbitrarily close to the best approximation achieved by any truthful-in-expectation mechanism. For the latter case, we prove that the approximation of the best truthful-in-expectation mechanism is between 1/3 and 1/2",
    "volume": "main",
    "checked": true,
    "id": "c1ce9790002219ed6a7ff23a02ce87a65e212cfe",
    "citation_count": 33
  },
  "https://www.ijcai.org/Abstract/16/028": {
    "title": "Achieving Proportional Representation in Conference Programs",
    "abstract": "We study the optimization problem of designing the program of a conference with parallel sessions, so that the intended participants are as happy as possible from the talks they can attend. Interestingly, this can be thought of as a two-dimensional extension of a scheme proposed by Chamberlin and Courant [1983] for achieving proportional representation in multi-winner elections. We show that different variations of the problem are computationally hard by exploiting relations of the problem with well-known hard graph problems. On the positive side, we present polynomial-time algorithms that compute conference programs that have a social utility that is provably close to the optimal one (within constant factors). Our algorithms are either combinatorial or based on linear programming and randomized rounding",
    "volume": "main",
    "checked": true,
    "id": "3354c283bbfa7cc4780d2fea1d66623014ef8323",
    "citation_count": 4
  },
  "https://www.ijcai.org/Abstract/16/029": {
    "title": "Subset Selection via Implicit Utilitarian Voting",
    "abstract": "How should one aggregate ordinal preferences expressed by voters into a measurably superior social choice? A well-established approach — which we refer to as implicit utilitarian voting — assumes that voters have latent utility functions that induce the reported rankings, and seeks voting rules that approximately maximize utilitarian social welfare. We extend this approach to the design of rules that select a subset of alternatives. We derive analytical bounds on the performance of optimal (deterministic as well as randomized) rules in terms of two measures, distortion and regret. Empirical results show that regret-based rules are more compelling than distortion-based rules, leading us to focus on developing a scalable implementation for the optimal (deterministic) regret-based rule. Our methods underlie the design and implementation of an upcoming social choice website",
    "volume": "main",
    "checked": true,
    "id": "e9c0fe483d3ba057c9b447687039532ba483c0f0",
    "citation_count": 83
  },
  "https://www.ijcai.org/Abstract/16/030": {
    "title": "Trading on a Rigged Game: Outcome Manipulation in Prediction Markets",
    "abstract": "Prediction markets are popular mechanisms for aggregating information about a future event. In situations where market participants may significantly influence the outcome, running the prediction market could change the incentives of participants in the process that creates the outcome. We propose a new game-theoretic model that captures two aspects of real-world prediction markets: (1) agents directly affect the outcome the market is predicting, (2) some outcome-deciders may not participate in the market. We show that this game has two types of equilibria: When some outcome-deciders are unlikely to participate in the market, equilibrium prices reveal expected market outcomes conditional on participants' private information, whereas when all outcome-deciders are likely to participate, equilibria are collusive — agents effectively coordinate in an uninformative and untruthful way",
    "volume": "main",
    "checked": true,
    "id": "effa2806d2c455d9ca2f1910e8540cb7156f8619",
    "citation_count": 16
  },
  "https://www.ijcai.org/Abstract/16/031": {
    "title": "Congestion Games with Polytopal Strategy Spaces",
    "abstract": "Congestion games are a well-studied class of games that has been used to model real-world systems such as Internet routing. In many congestion games, each player's number of strategies can be exponential in the natural description of the game. Most existing algorithms for game theoretic computation, from computing expected utilities and best responses to finding Nash equilibrium and other solution concepts, all involve enumeration of pure strategies. As a result, such algorithms would take exponential time on these congestion games. In this work, we study congestion games in which each player's strategy space can be described compactly using a set of linear constraints. For instance, network congestion games naturally fall into this subclass as each player's strategy can be described by a set of flow constraints. We show that we can represent any mixed strategy compactly using marginals which specify the probability of using each resource. As a consequence, the expected utilities and the best responses can be computed in polynomial time. We reduce the problem of computing a best/worst symmetric approximate mixed-strategy Nash equilibrium in symmetric congestion games to a constraint optimization problem on a graph formed by the resources and the strategy constraints. As a result, we present a fully polynomial time approximation scheme (FPTAS) for this problem when the graph has bounded tree width",
    "volume": "main",
    "checked": true,
    "id": "42e2a1b5ec6438947f2fac5cabdad3b11ab7064a",
    "citation_count": 11
  },
  "https://www.ijcai.org/Abstract/16/032": {
    "title": "Robust Draws in Balanced Knockout Tournaments",
    "abstract": "Balanced knockout tournaments are ubiquitous in sports competitions and are also used in decision-making and elections. The traditional computational question, that asks to compute a draw (optimal draw) that maximizes the winning probability for a distinguished player, has received a lot of attention. Previous works consider the problem where the pairwise winning probabilities are known precisely, while we study how robust is the winning probability with respect to small errors in the pairwise winning probabilities. First, we present several illuminating examples to establish: (a) there exist deterministic tournaments (where the pairwise winning probabilities are 0 or 1) where one optimal draw is much more robust than the other; and (b) in general, there exist tournaments with slightly suboptimal draws that are more robust than all the optimal draws. The above examples motivate the study of the computational problem of robust draws that guarantee a specified winning probability. Second, we present a polynomial-time algorithm for approximating the robustness of a draw for sufficiently small errors in pairwise winning probabilities, and obtain that the stated computational problem is NP-complete. We also show that two natural cases of deterministic tournaments where the optimal draw could be computed in polynomial time also admit polynomial-time algorithms to compute robust optimal draws",
    "volume": "main",
    "checked": true,
    "id": "4c6787d2a4b809bbad5bc25de38c396081078006",
    "citation_count": 7
  },
  "https://www.ijcai.org/Abstract/16/033": {
    "title": "Verifying Pushdown Multi-Agent Systems against Strategy Logics",
    "abstract": "In this paper, we investigate model checking algorithms for variants of strategy logic over pushdown multi-agent systems, modeled by pushdown game structures (PGSs). We consider various fragments of strategy logic, i.e., SL[CG], SL[DG], SL[1G] and BSIL. We show that the model checking problems on PGSs for SL[CG], SL[DG] and SL[1G] are 3EXTIME-complete, which are not harder than the problem for the subsumed logic ATL*. When BSIL is concerned, the model checking problem becomes 2EXPTIME-complete. Our algorithms are automata-theoretic and based on the saturation technique, which are amenable to implementations",
    "volume": "main",
    "checked": true,
    "id": "27c0618c76b43d206ceffe431e21bcefa46b3192",
    "citation_count": 3
  },
  "https://www.ijcai.org/Abstract/16/034": {
    "title": "Truthfulness of a Proportional Sharing Mechanism in Resource Exchange",
    "abstract": "In this paper, we consider the popular proportional sharing mechanism and discuss the incentives and opportunities of an agent to lie for personal gains in resource exchange game. The main result is a proof that an agent manipulating the proportional sharing mechanism by misreporting its resource amount will not benefit its own utility eventually. This result establishes a strategic stability property of the resource exchange protocol. We further illustrate and confirm the result via network examples",
    "volume": "main",
    "checked": true,
    "id": "1d7bc2b3fddb6fdaf448001fcaece6dadd7103a1",
    "citation_count": 21
  },
  "https://www.ijcai.org/Abstract/16/035": {
    "title": "Better Strategyproof Mechanisms without Payments or Prior — An Analytic Approach",
    "abstract": "We revisit the problem of designing strategyproof mechanisms for allocating divisible items among two agents who have linear utilities, where payments are disallowed and there is no prior information on the agents' preferences. The objective is to design strategyproof mechanisms which are competitive against the most efficient (but not strategyproof) mechanism. For the case with two items: We provide a set of sufficient conditions for strategyproofness. We use an analytic approach to derive strategyproof mechanisms which are more competitive than all prior strategyproof mechanisms. We improve the linear-program-based proof of Guo and Conitzer to show new upper bounds on competitive ratios. We provide the first compact proof on upper bound of competitiveness. For the cases with any number of items, we build on the Partial Allocation mechanisms introduced by Cole et al. to design a strategyproof mechanism which is 0.67776-competitive, breaking the 2/3 barrier. We also propose a new sub-class of strategyproof mechanisms for any numbers of agents and items, which we call it Dynamic-Increasing-Price mechanisms, where each agent purchases the items using virtual money, and the prices of the items depend on other agents' preferences",
    "volume": "main",
    "checked": false,
    "id": "222b497255eb398e87c3400c3e82717ff9ca32f1",
    "citation_count": 7
  },
  "https://www.ijcai.org/Abstract/16/036": {
    "title": "Approximating Value Equivalence in Interactive Dynamic Influence Diagrams Using Behavioral Coverage",
    "abstract": "Interactive dynamic influence diagrams~(I-DIDs) provide an explicit way of modeling how a subject agent solves decision making problems in the presence of other agents in a common setting. To optimize its decisions, the subject agent needs to predict the other agents' behavior, that is generally obtained by solving their candidate models. This becomes extremely difficult since the model space may be rather large, and grows when the other agents act and observe over the time. A recent proposal for solving I-DIDs lies in a concept of value equivalence (VE) that shows potential advances on significantly reducing the model space. In this paper, we establish a principled framework to implement the VE techniques and propose an approximate method to compute VE of candidate models. The development offers ample opportunity of exploiting VE to further improve the scalability of I-DID solutions. We theoretically analyze properties of the approximate techniques and show empirical results in multiple problem domains",
    "volume": "main",
    "checked": true,
    "id": "301176f02202d3f9e5588f12910c8979b1e77465",
    "citation_count": 3
  },
  "https://www.ijcai.org/Abstract/16/037": {
    "title": "Selective Norm Monitoring",
    "abstract": "Real-world norm monitors have limited capabilities for observing agents. This paper proposes a novel mechanism to take full advantage of limited observation capabilities by selecting the agents to be monitored. Our evaluation shows this significantly increases the number of violations detected",
    "volume": "main",
    "checked": false,
    "id": "5c00a2ff6e68ac80621e8cd63ecaf74e251fe709",
    "citation_count": 11
  },
  "https://www.ijcai.org/Abstract/16/038": {
    "title": "Elicitation for Preferences Single Peaked on Trees",
    "abstract": "Eliciting preferences of a set of agents over a set of items is a problem of fundamental interest in artificial intelligence in general and social choice theory in particular. Prior works on preference elicitation focus on unrestricted domain and the domain of single peaked preferences and show that the preferences in single peaked domain can be elicited by much less number of queries compared to unrestricted domain. We extend this line of research and study preference elicitation for single peaked preferences on trees which is a strict superset of the domain of single peaked preferences. We show that the query complexity crucially depends on the number of leaves, the path cover number, and the distance from path of the underlying single peaked tree, whereas the other natural parameters like maximum degree, diameter, pathwidth do not play any direct role in determining query complexity. We then investigate the query complexity for finding a weak Condorcet winner for preferences single peaked on a tree and show that this task has much less query complexity than preference elicitation. Here again we observe that the number of leaves in the underlying single peaked tree and the path cover number of the tree influence the query complexity of the problem",
    "volume": "main",
    "checked": true,
    "id": "98501768ee9627890c4fafe63898b5db86b34bb9",
    "citation_count": 14
  },
  "https://www.ijcai.org/Abstract/16/039": {
    "title": "Preference Elicitation for Single Crossing Domain",
    "abstract": "Eliciting the preferences of a set of agents over a set of alternatives is a problem of fundamental importance in social choice theory. Prior work on this problem has studied the query complexity of preference elicitation for the unrestricted domain and for the domain of single peaked preferences. In this paper, we consider the domain of single crossing preference profiles and study the query complexity of preference elicitation under various settings. We consider two distinct situations: when an ordering of the voters with respect to which the profile is single crossing is known versus when it is unknown. We also consider random and sequential access models. The main contribution of our work is to provide polynomial time algorithms with low query complexity for preference elicitation in all the above cases. Further, we show that the query complexities of our algorithms are optimal up to constant factors for all but one of the above cases",
    "volume": "main",
    "checked": true,
    "id": "6b479836ad35d8da1f271c624ed126b38be0104e",
    "citation_count": 15
  },
  "https://www.ijcai.org/Abstract/16/040": {
    "title": "Complexity of Manipulation with Partial Information in Voting",
    "abstract": "The Coalitional Manipulation problem has been studied extensively in the literature for many voting rules. However, most studies have focused on the complete information setting, wherein the manipulators know the votes of the non-manipulators. While this assumption is reasonable for purposes of showing intractability, it is unrealistic for algorithmic considerations. In most real-world scenarios, it is impractical for the manipulators to have accurate knowledge of all the other votes. In this paper, we investigate manipulation with incomplete information. In our framework, the manipulators know a partial order for each voter that is consistent with the true preference of that voter. In this setting, we formulate three natural computational notions of manipulation, namely weak, opportunistic, and strong manipulation. We consider several scenarios for which the traditional manipulation problems are easy (for instance, Borda with a single manipulator). For many of them, the corresponding manipulative questions that we propose turn out to be computationally intractable. Our hardness results often hold even when very little information is missing, or in other words, even when the instances are quite close to the complete information setting. Our overall conclusion is that computational hardness continues to be a valid obstruction to manipulation, in the context of a more realistic model",
    "volume": "main",
    "checked": true,
    "id": "3be7b7bd085738b881252370133e9d778f3963d0",
    "citation_count": 26
  },
  "https://www.ijcai.org/Abstract/16/041": {
    "title": "Strategic Voting with Incomplete Information",
    "abstract": "Classical results in social choice theory on the susceptibility of voting rules to strategic manipulation make the assumption that the manipulator has complete information regarding the preferences of the other voters. In reality, however, voters only have incomplete information, which limits their ability to manipulate. We explore how these limitations affect both the manipulability of voting rules and the dynamics of systems in which voters may repeatedly update their own vote in reaction to the moves made by others. We focus on the Plurality, Veto, k-approval, Borda, Copeland, and Maximin voting rules, and consider several types of information that are natural in the context of these rules, namely information on the current front-runner, on the scores obtained by each alternative, and on the majority graph induced by the individual preferences",
    "volume": "main",
    "checked": true,
    "id": "ea7dcd87128fb43656cc9c4a347e9b9ecbea9d69",
    "citation_count": 32
  },
  "https://www.ijcai.org/Abstract/16/042": {
    "title": "Voting-Based Group Formation",
    "abstract": "We study a combinatorial problem formulated in terms of the following group-formation scenario. Given some agents, where each agent has preferences over the set of potential group leaders, the task is to partition the agents into groups and assign a group leader to each of them, so that the group leaders have as high support as possible from the groups they are assigned to lead. We model this scenario as a voting problem, where the goal is to partition a set of voters into a prescribed number of groups so that each group elects its leader, i.e., their leader is a unique winner in the corresponding election. We study the computational complexity of this problem (and several of its variants) for Approval elections",
    "volume": "main",
    "checked": true,
    "id": "1f2720ba231278d63de24ee8df9a27dc3dc5d482",
    "citation_count": 0
  },
  "https://www.ijcai.org/Abstract/16/043": {
    "title": "Committee Scoring Rules: Axiomatic Classification and Hierarchy",
    "abstract": "We consider several natural classes of committee scoring rules, namely, weakly separable, representation-focused, top-k-counting, OWA-based, and decomposable rules. We study some of their axiomatic properties, especially properties of monotonicity, and concentrate on containment relations between them. We characterize SNTV, Bloc, and k-approval Chamberlin-Courant, as the only rules in certain intersections of these classes. We introduce decomposable rules, describe some of their applications, and show that the class of decomposable rules strictly contains the class of OWA-based rules",
    "volume": "main",
    "checked": true,
    "id": "6c8b5976ed509bd65ac6d5ae089fb4528501b423",
    "citation_count": 49
  },
  "https://www.ijcai.org/Abstract/16/044": {
    "title": "How Hard Is It for a Party to Nominate an Election Winner?",
    "abstract": "We consider a Plurality-voting scenario, where the candidates are split between parties, and each party nominates exactly one candidate for the final election. We study the computational complexity of deciding if there is a set of nominees such that a candidate from a given party wins in the final election. In our second problem, the goal is to decide if a candidate from a given party always wins, irrespective who is nominated. We show that these problems are computationally hard, but are polynomial-time solvable for restricted settings",
    "volume": "main",
    "checked": true,
    "id": "62d858ab9964be4510c1722fda02f677b24780d0",
    "citation_count": 8
  },
  "https://www.ijcai.org/Abstract/16/045": {
    "title": "Digital Good Exchange",
    "abstract": "Over the past decade, computer-automated barter exchange has become one of the most successful applications at the intersection of AI and economics. Standard exchange models, such as house allocation and kidney exchange cannot be applied to an emerging industrial application, coined digital good exchange, where an agent still possesses her initial endowment after exchanging with others. However, her valuation toward her endowment decreases as it is possessed by more agents. We put forward game theoretical models tailored for digital good exchange. In the first part of the paper, we first consider a natural class of games where agents can choose either a subset of other participants' items or no participation at all. It turns out that this class of games can be modeled as a variant of congestion games. We prove that it is in general NP-complete to determine whether there exists a non-trivial pure Nash equilibrium where at least some agent chooses a nonempty subset of items. However, we show that in a subset of games for single-minded agents with unit demand, there exist non-trivial Pure Nash equilibria and put forward an efficient algorithm to find such equilibria. In the second part of the paper, we investigate digital good exchange from a mechanism design perspective. We ask if there is a truthful mechanism in this setting that can achieve good social welfare guarantee. To this end, we design a randomized fixed-price-exchange mechanism that is individually rational and truthful, and for two-player case yields a tight log-approximation with respect to any individually rational allocation",
    "volume": "main",
    "checked": true,
    "id": "3e0ab269c0a57a7057ebfcb314113caedcc4dd5a",
    "citation_count": 4
  },
  "https://www.ijcai.org/Abstract/16/046": {
    "title": "Parallel Behavior Composition for Manufacturing",
    "abstract": "A key problem in the manufacture of highly-customized products is the synthesis of controllers able to manufacture any instance of a given product type on a given production or assembly line. In this paper, we extend classical AI behavior composition to manufacturing settings. We first introduce a novel solution concept for manufacturing composition, target production processes, that are able to manufacture multiple instances of a product simultaneously in a given production plant. We then propose a technique for synthesizing the largest target production process, together with an associated controller for the machines in the plant",
    "volume": "main",
    "checked": true,
    "id": "118b7701dfd0ddd12eab4dc467e860cdffb2a9cb",
    "citation_count": 7
  },
  "https://www.ijcai.org/Abstract/16/047": {
    "title": "Opinion Dynamics with Local Interactions",
    "abstract": "We study convergence properties of opinion dynamics with local interactions and limited information exchange. We adopt a general model where the agents update their opinions in rounds to a weighted average of the opinions in their neighborhoods. For fixed neighborhoods, we present a simple randomized protocol that converges in expectation to the stable state of the Friedkin-Johnsen model. For opinion-dependent neighborhoods, we show that the Hegselmann-Krause model converges to a stable state if each agent's neighborhood is restricted either to a subset of her acquaintances or to a small random subset of agents. Our experimental findings indicate that for a wide range of parameters, the convergence time and the number of opinion clusters of the neighborhood-restricted variants are comparable to those of the standard Hegselmann-Krause model",
    "volume": "main",
    "checked": true,
    "id": "117af29c94f994d40bce0ee1b6577385fce0983d",
    "citation_count": 19
  },
  "https://www.ijcai.org/Abstract/16/048": {
    "title": "Online Mechanism Design for Vehicle-to-Grid Car Parks",
    "abstract": "Vehicle-to-grid (V2G) is a promising approach whereby electric vehicles (EVs) are used to store excess electricity supply (e.g., from renewable sources), which is sold back to the grid in times of scarcity. In this paper we consider the setting of a smart car park, where EVs come and go, and can be used for V2G while parked. We develop novel allocation and payment mechanisms which truthfully elicit the EV owners' preferences and constraints, including arrival, departure, required charge, as well as the costs of discharging due to loss of efficiency of the battery. The car park will schedule the charging and discharging of each EV, ensuring the constraints of the EVs are met, and taking into consideration predictions about future electricity prices. Optimally solving the global problem is intractable, and we present three novel heuristic online scheduling algorithms. We show that, under certain conditions, two of these satisfy monotonicity and are therefore truthful. We furthermore evaluate the algorithms using simulations, and we show that some of our algorithms benefit significantly from V2G, achieving positive benefit for the car park even when agents do not pay for using it",
    "volume": "main",
    "checked": true,
    "id": "77517bc6d516325f8064920b633f7fb60a70aedb",
    "citation_count": 17
  },
  "https://www.ijcai.org/Abstract/16/049": {
    "title": "Moving in a Crowd: Safe and Efficient Navigation among Heterogeneous Agents",
    "abstract": "Multi-agent navigation methods typically assume that all agents use the same underlying framework to navigate to their goal while avoiding colliding with each other. However, such assumption does not hold when agents do not know how other agents will move.We address this issue by proposing a Bayesian inference approach where an agent estimates the navigation model and goal of each neighbor, and uses this to compute a plan that minimizes collisions while driving it to its goal. Simulation experiments performed in many scenarios demonstrate that an agent using our approach computes safer and more time-efficient paths as compared to those generated without our inference approach anda state-of-the-art local navigation framework",
    "volume": "main",
    "checked": true,
    "id": "6996de08e8e09db8d0aaec39bd9ce0495d5274f5",
    "citation_count": 23
  },
  "https://www.ijcai.org/Abstract/16/050": {
    "title": "A Network-Based Rating System and Its Resistance to Bribery",
    "abstract": "We study a rating system in which a set of individuals (e.g., the customers of a restaurant) evaluate a given service (e.g, the restaurant), with their aggregated opinion determining the probability of all individuals to use the service and thus its generated revenue. We explicitly model the influence relation by a social network, with individuals being influenced by the evaluation of their trusted peers. On top of that we allow a malicious service provider (e.g., the restaurant owner) to bribe some individuals, i.e., to invest a part of his or her expected income to modify their opinion, therefore influencing his or her final gain. We analyse the effect of bribing strategies under various constraints, and we show under what conditions the system is bribery-proof, i.e., no bribing strategy yields a strictly positive expected gain to the service provider",
    "volume": "main",
    "checked": true,
    "id": "ee4b19ae9afa7816b1aaad037fc05c14a3f913d9",
    "citation_count": 12
  },
  "https://www.ijcai.org/Abstract/16/051": {
    "title": "Three Strategies to Success: Learning Adversary Models in Security Games",
    "abstract": "State-of-the-art applications of Stackelberg security games — including wildlife protection — offer a wealth of data, which can be used to learn the behavior of the adversary. But existing approaches either make strong assumptions about the structure of the data, or gather new data through online algorithms that are likely to play severely suboptimal strategies. We develop a new approach to learning the parameters of the behavioral model of a bounded rational attacker (thereby pinpointing a near optimal strategy), by observing how the attacker responds to only three defender strategies. We also validate our approach using experiments on real and synthetic data",
    "volume": "main",
    "checked": true,
    "id": "b8a4b5e8eaf9bfe881227561af9fb5c42ff5613f",
    "citation_count": 34
  },
  "https://www.ijcai.org/Abstract/16/052": {
    "title": "Reconfigurability in Reactive Multiagent Systems",
    "abstract": "Reactive agents are suitable for representing physical resources in manufacturing control systems. An important challenge of agent-based manufacturing control systems is to develop formal and structured approaches to support their specification and verification. This paper proposes a logic-based approach, by generalising that of model checking multiagent systems, for the reconfigurability of reactive multiagent systems. Two reconfigurability scenarios are studied, for the resulting system being a monolithic system or an individual module, and their computational complexity results are given",
    "volume": "main",
    "checked": true,
    "id": "3e1b250cbe1affe1eae8b1548c6db757d396e3fd",
    "citation_count": 2
  },
  "https://www.ijcai.org/Abstract/16/053": {
    "title": "Probabilistic Matrix Inspection and Group Scheduling",
    "abstract": "Consider an event organizer who is trying to schedule a group meeting. Availability of agents is unknown to the organizer a priori, but the organizer may have probability estimates on availability of each agent for each date/time option. The organizer can ask an agent to reveal her availability, but it causes inconvenience for the agent, and thus the organizer wishes to find an agreeable outcome at a minimum number of such queries. Motivated by this example, we study the Probabilistic Matrix Inspection problem in which we are given a matrix of Bernoulli random variables that are mutually independent, and the objective is to determine whether the matrix contains a column consisting only of 1's. We are allowed to inspect an arbitrary entry at unit cost, which reveals the realization of the entry, and we wish to find an inspection policy whose expected number of inspections is minimum. We first show that an intuitive greedy algorithm exists for 1-row and 1-column matrices, and we generalize this to design an algorithm that finds an optimal policy in polynomial time for the general case",
    "volume": "main",
    "checked": true,
    "id": "d324bf16e4cdd78785b19ab1642ddc0900d633c9",
    "citation_count": 2
  },
  "https://www.ijcai.org/Abstract/16/054": {
    "title": "Catcher-Evader Games",
    "abstract": "Algorithms for computing game-theoretic solutions have recently been applied to a number of security domains. However, many of the techniques developed for compact representations of security games do not extend to Bayesian security games, which allow us to model uncertainty about the attacker's type. In this paper, we introduce a general framework of catcher-evader games that can capture Bayesian security games as well as other game families of interest. We show that computing Stackelberg strategies is NP-hard, but give an algorithm for computing a Nash equilibrium that performs well in experiments. We also prove that the Nash equilibria of these games satisfy the interchangeability property, so that equilibrium selection is not an issue",
    "volume": "main",
    "checked": true,
    "id": "447d4d55d83d65027d69d6d8bc1bc7193c9fbb72",
    "citation_count": 6
  },
  "https://www.ijcai.org/Abstract/16/055": {
    "title": "Asymptotically Tight Bounds for Inefficiency in Risk-Averse Selfish Routing",
    "abstract": "We consider a nonatomic selfish routing model with independent stochastic travel times for each edge, represented by mean and variance latency functions that depend on arc flows. This model can apply to traffic in the Internet or in a road network. Variability negatively impacts packets or drivers, by introducing jitter in transmission delays which lowers quality of streaming audio or video, or by making it more difficult to predict the arrival time at destination. The price of risk aversion (PRA) has been defined as the worst-case ratio of the cost of an equilibrium with risk-averse players who seek risk-minimizing paths, and that of an equilibrium with risk-neutral users who minimize the mean travel time of a path [Nikolova and Stier-Moses, 2015]. This inefficiency metric captures the degradation of system performance caused by variability and risk aversion. In this paper, we provide the first lower bounds on the PRA. First, we show a family of structural lower bounds, which grow linearly with the size of the graph and players' risk-aversion. They are tight for graph sizes that are powers of two. We also provide asymptotically tight functional bounds that depend on the allowed latency functions but not on the topology. The functional bounds match the price-of-anarchy bounds for congestion games multiplied by an extra factor that accounts for risk aversion. Finally, we provide a closed-form formula of the PRA for a family of graphs that generalize series-parallel graphs and the Braess graph. This formula also applies to the mean-standard deviation user objective a much more complex model of risk-aversion due to the cost of a path being non-additive over edge costs",
    "volume": "main",
    "checked": true,
    "id": "4b32813f91932b960ff50481d6d7d6073f602209",
    "citation_count": 20
  },
  "https://www.ijcai.org/Abstract/16/056": {
    "title": "Social Choice for Agents with General Utilities",
    "abstract": "The existence of truthful social choice mechanisms strongly depends on whether monetary transfers are allowed. Without payments there are no truthful, non-dictatorial mechanisms under mild requirements, whereas the VCG mechanism guarantees truthfulness along with welfare maximization when there are payments and utility is quasi-linear in money. In this paper we study mechanisms in which we can use payments but where agents have non quasi-linear utility functions. Our main result extends the Gibbard-Satterthwaite impossibility result by showing that, for two agents, the only truthful mechanism for at least three alternatives under general decreasing utilities remains dictatorial. We then show how to extend the VCG mechanism to work under a more general utility space than quasi-linear (the \"parallel domain) and show that the parallel domain is maximal—no mechanism with the VCG properties exists in any larger domain",
    "volume": "main",
    "checked": true,
    "id": "69ae86f58aaa69ab701c6441fbcbd50f7eb466c0",
    "citation_count": 8
  }
}