{
  "https://aclanthology.org/2020.tacl-1.1": {
    "title": "Phonotactic Complexity and Its Trade-offs",
    "volume": "main",
    "abstract": "We present methods for calculating a measure of phonotactic complexity—bits per phoneme— that permits a straightforward cross-linguistic comparison. When given a word, represented as a sequence of phonemic segments such as symbols in the international phonetic alphabet, and a statistical model trained on a sample of word types from the language, we can approximately measure bits per phoneme using the negative log-probability of that word under the model. This simple measure allows us to compare the entropy across languages, giving insight into how complex a language's phonotactics is. Using a collection of 1016 basic concept words across 106 languages, we demonstrate a very strong negative correlation of − 0.74 between bits per phoneme and the average length of words",
    "checked": true,
    "id": "c183cde71c3707d972f95491e744b4d493382d13",
    "semantic_title": "phonotactic complexity and its trade-offs",
    "citation_count": 38,
    "authors": [
      "Tiago Pimentel",
      "Brian Roark",
      "Ryan Cotterell"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.2": {
    "title": "AMR-To-Text Generation with Graph Transformer",
    "volume": "main",
    "abstract": "Abstract meaning representation (AMR)-to-text generation is the challenging task of generating natural language texts from AMR graphs, where nodes represent concepts and edges denote relations. The current state-of-the-art methods use graph-to-sequence models; however, they still cannot significantly outperform the previous sequence-to-sequence models or statistical approaches. In this paper, we propose a novel graph-to-sequence model (Graph Transformer) to address this task. The model directly encodes the AMR graphs and learns the node representations. A pairwise interaction function is used for computing the semantic relations between the concepts. Moreover, attention mechanisms are used for aggregating the information from the incoming and outgoing neighbors, which help the model to capture the semantic information effectively. Our model outperforms the state-of-the-art neural approach by 1.5 BLEU points on LDC2015E86 and 4.8 BLEU points on LDC2017T10 and achieves new state-of-the-art performances",
    "checked": true,
    "id": "11d65fd28e17f2c1a6bf141cf06c42d2817e5ef8",
    "semantic_title": "amr-to-text generation with graph transformer",
    "citation_count": 75,
    "authors": [
      "Tianming Wang",
      "Xiaojun Wan",
      "Hanqi Jin"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.3": {
    "title": "What BERT Is Not: Lessons from a New Suite of Psycholinguistic Diagnostics for Language Models",
    "volume": "main",
    "abstract": "Pre-training by language modeling has become a popular and successful approach to NLP tasks, but we have yet to understand exactly what linguistic capacities these pre-training processes confer upon models. In this paper we introduce a suite of diagnostics drawn from human language experiments, which allow us to ask targeted questions about information used by language models for generating predictions in context. As a case study, we apply these diagnostics to the popular BERT model, finding that it can generally distinguish good from bad completions involving shared category or role reversal, albeit with less sensitivity than humans, and it robustly retrieves noun hypernyms, but it struggles with challenging inference and role-based event prediction— and, in particular, it shows clear insensitivity to the contextual impacts of negation",
    "checked": true,
    "id": "a0e49f65b6847437f262c59d0d399255101d0b75",
    "semantic_title": "what bert is not: lessons from a new suite of psycholinguistic diagnostics for language models",
    "citation_count": 613,
    "authors": [
      "Allyson Ettinger"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.4": {
    "title": "Membership Inference Attacks on Sequence-to-Sequence Models: Is My Data In Your Machine Translation System?",
    "volume": "main",
    "abstract": "Data privacy is an important issue for \"machine learning as a service\" providers. We focus on the problem of membership inference attacks: Given a data sample and black-box access to a model's API, determine whether the sample existed in the model's training data. Our contribution is an investigation of this problem in the context of sequence-to-sequence models, which are important in applications such as machine translation and video captioning. We define the membership inference problem for sequence generation, provide an open dataset based on state-of-the-art machine translation models, and report initial results on whether these models leak private information against several kinds of membership inference attacks",
    "checked": true,
    "id": "e61a3a5ba2b93458774f2ccbe480f3cf6cd74fa1",
    "semantic_title": "membership inference attacks on sequence-to-sequence models: is my data in your machine translation system?",
    "citation_count": 111,
    "authors": [
      "Sorami Hisamoto",
      "Matt Post",
      "Kevin Duh"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.5": {
    "title": "SpanBERT: Improving Pre-training by Representing and Predicting Spans",
    "volume": "main",
    "abstract": "We present SpanBERT, a pre-training method that is designed to better represent and predict spans of text. Our approach extends BERT by (1) masking contiguous random spans, rather than random tokens, and (2) training the span boundary representations to predict the entire content of the masked span, without relying on the individual token representations within it. SpanBERT consistently outperforms BERT and our better-tuned baselines, with substantial gains on span selection tasks such as question answering and coreference resolution. In particular, with the same training data and model size as BERTlarge, our single model obtains 94.6% and 88.7% F1 on SQuAD 1.1 and 2.0 respectively. We also achieve a new state of the art on the OntoNotes coreference resolution task (79.6% F1), strong performance on the TACRED relation extraction benchmark, and even gains on GLUE.1",
    "checked": true,
    "id": "81f5810fbbab9b7203b9556f4ce3c741875407bc",
    "semantic_title": "spanbert: improving pre-training by representing and predicting spans",
    "citation_count": 1992,
    "authors": [
      "Mandar Joshi",
      "Danqi Chen",
      "Yinhan Liu",
      "Daniel S. Weld",
      "Luke Zettlemoyer",
      "Omer Levy"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.6": {
    "title": "A Graph-based Model for Joint Chinese Word Segmentation and Dependency Parsing",
    "volume": "main",
    "abstract": "Chinese word segmentation and dependency parsing are two fundamental tasks for Chinese natural language processing. The dependency parsing is defined at the word-level. Therefore word segmentation is the precondition of dependency parsing, which makes dependency parsing suffer from error propagation and unable to directly make use of character-level pre-trained language models (such as BERT). In this paper, we propose a graph-based model to integrate Chinese word segmentation and dependency parsing. Different from previous transition-based joint models, our proposed model is more concise, which results in fewer efforts of feature engineering. Our graph-based joint model achieves better performance than previous joint models and state-of-the-art results in both Chinese word segmentation and dependency parsing. Additionally, when BERT is combined, our model can substantially reduce the performance gap of dependency parsing between joint models and gold-segmented word-based models. Our code is publicly available at https://github.com/fastnlp/JointCwsParser",
    "checked": true,
    "id": "32bedc53ff777fc2f15d231ab856db2b1c9ee8c2",
    "semantic_title": "a graph-based model for joint chinese word segmentation and dependency parsing",
    "citation_count": 33,
    "authors": [
      "Hang Yan",
      "Xipeng Qiu",
      "Xuanjing Huang"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.7": {
    "title": "A Knowledge-Enhanced Pretraining Model for Commonsense Story Generation",
    "volume": "main",
    "abstract": "Story generation, namely, generating a reasonable story from a leading context, is an important but challenging task. In spite of the success in modeling fluency and local coherence, existing neural language generation models (e.g., GPT-2) still suffer from repetition, logic conflicts, and lack of long-range coherence in generated stories. We conjecture that this is because of the difficulty of associating relevant commonsense knowledge, understanding the causal relationships, and planning entities and events with proper temporal order. In this paper, we devise a knowledge-enhanced pretraining model for commonsense story generation. We propose to utilize commonsense knowledge from external knowledge bases to generate reasonable stories. To further capture the causal and temporal dependencies between the sentences in a reasonable story, we use multi-task learning, which combines a discriminative objective to distinguish true and fake stories during fine-tuning. Automatic and manual evaluation shows that our model can generate more reasonable stories than state-of-the-art baselines, particularly in terms of logic and global coherence",
    "checked": true,
    "id": "c6a84615bc36486cd0170f8a3e1b7e5ec8f5344e",
    "semantic_title": "a knowledge-enhanced pretraining model for commonsense story generation",
    "citation_count": 252,
    "authors": [
      "Jian Guan",
      "Fei Huang",
      "Zhihao Zhao",
      "Xiaoyan Zhu",
      "Minlie Huang"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.8": {
    "title": "Improving Candidate Generation for Low-resource Cross-lingual Entity Linking",
    "volume": "main",
    "abstract": "Cross-lingual entity linking (XEL) is the task of finding referents in a target-language knowledge base (KB) for mentions extracted from source-language texts. The first step of (X)EL is candidate generation, which retrieves a list of plausible candidate entities from the target-language KB for each mention. Approaches based on resources from Wikipedia have proven successful in the realm of relatively high-resource languages, but these do not extend well to low-resource languages with few, if any, Wikipedia pages. Recently, transfer learning methods have been shown to reduce the demand for resources in the low-resource languages by utilizing resources in closely related languages, but the performance still lags far behind their high-resource counterparts. In this paper, we first assess the problems faced by current entity candidate generation methods for low-resource XEL, then propose three improvements that (1) reduce the disconnect between entity mentions and KB entries, and (2) improve the robustness of the model to low-resource scenarios. The methods are simple, but effective: We experiment with our approach on seven XEL datasets and find that they yield an average gain of 16.9% in Top-30 gold candidate recall, compared with state-of-the-art baselines. Our improved model also yields an average gain of 7.9% in in-KB accuracy of end-to-end XEL.1",
    "checked": true,
    "id": "2583e7e279e2969493c3290c8f300ab32da40bf9",
    "semantic_title": "improving candidate generation for low-resource cross-lingual entity linking",
    "citation_count": 23,
    "authors": [
      "Shuyan Zhou",
      "Shruti Rijhwani",
      "John Wieting",
      "Jaime Carbonell",
      "Graham Neubig"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.9": {
    "title": "Does Syntax Need to Grow on Trees? Sources of Hierarchical Inductive Bias in Sequence-to-Sequence Networks",
    "volume": "main",
    "abstract": "Learners that are exposed to the same training data might generalize differently due to differing inductive biases. In neural network models, inductive biases could in theory arise from any aspect of the model architecture. We investigate which architectural factors affect the generalization behavior of neural sequence-to-sequence models trained on two syntactic tasks, English question formation and English tense reinflection. For both tasks, the training set is consistent with a generalization based on hierarchical structure and a generalization based on linear order. All architectural factors that we investigated qualitatively affected how models generalized, including factors with no clear connection to hierarchical structure. For example, LSTMs and GRUs displayed qualitatively different inductive biases. However, the only factor that consistently contributed a hierarchical bias across tasks was the use of a tree-structured model rather than a model with sequential recurrence, suggesting that human-like syntactic generalization requires architectural syntactic structure",
    "checked": true,
    "id": "b0ea633e0c22fbd8cbc531c7326376725d16ce25",
    "semantic_title": "does syntax need to grow on trees? sources of hierarchical inductive bias in sequence-to-sequence networks",
    "citation_count": 107,
    "authors": [
      "R. Thomas McCoy",
      "Robert Frank",
      "Tal Linzen"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.10": {
    "title": "Investigating Prior Knowledge for Challenging Chinese Machine Reading Comprehension",
    "volume": "main",
    "abstract": "Machine reading comprehension tasks require a machine reader to answer questions relevant to the given document. In this paper, we present the first free-form multiple-Choice Chinese machine reading Comprehension dataset (C3), containing 13,369 documents (dialogues or more formally written mixed-genre texts) and their associated 19,577 multiple-choice free-form questions collected from Chinese-as-a-second-language examinations. We present a comprehensive analysis of the prior knowledge (i.e., linguistic, domain-specific, and general world knowledge) needed for these real-world problems. We implement rule-based and popular neural methods and find that there is still a significant performance gap between the best performing model (68.5%) and human readers (96.0%), especiallyon problems that require prior knowledge. We further study the effects of distractor plausibility and data augmentation based on translated relevant datasets for English on model performance. We expect C3 to present great challenges to existing systems as answering 86.8% of questions requires both knowledge within and beyond the accompanying document, and we hope that C3 can serve as a platform to study how to leverage various kinds of prior knowledge to better understand a given written or orally oriented text. C3 is available at https://dataset.org/c3/",
    "checked": true,
    "id": "1b07a24b81834116f6ad1d0232485ba81b9445f3",
    "semantic_title": "investigating prior knowledge for challenging chinese machine reading comprehension",
    "citation_count": 99,
    "authors": [
      "Kai Sun",
      "Dian Yu",
      "Dong Yu",
      "Claire Cardie"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.11": {
    "title": "Theoretical Limitations of Self-Attention in Neural Sequence Models",
    "volume": "main",
    "abstract": "Transformers are emerging as the new workhorse of NLP, showing great success across tasks. Unlike LSTMs, transformers process input sequences entirely through self-attention. Previous work has suggested that the computational capabilities of self-attention to process hierarchical structures are limited. In this work, we mathematically investigate the computational power of self-attention to model formal languages. Across both soft and hard attention, we show strong theoretical limitations of the computational abilities of self-attention, finding that it cannot model periodic finite-state languages, nor hierarchical structure, unless the number of layers or heads increases with input length. These limitations seem surprising given the practical success of self-attention and the prominent role assigned to hierarchical structure in linguistics, suggesting that natural language can be approximated well with models that are too weak for the formal languages typically assumed in theoretical linguistics",
    "checked": true,
    "id": "b3564be8b79f25585acb035f3deaf4ae93c26d8f",
    "semantic_title": "theoretical limitations of self-attention in neural sequence models",
    "citation_count": 266,
    "authors": [
      "Michael Hahn"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.12": {
    "title": "Target-Guided Structured Attention Network for Target-Dependent Sentiment Analysis",
    "volume": "main",
    "abstract": "Target-dependent sentiment analysis (TDSA) aims to classify the sentiment of a text towards a given target. The major challenge of this task lies in modeling the semantic relatedness between a target and its context sentence. This paper proposes a novel Target-Guided Structured Attention Network (TG-SAN), which captures target-related contexts for TDSA in a fine-to-coarse manner. Given a target and its context sentence, the proposed TG-SAN first identifies multiple semantic segments from the sentence using a target-guided structured attention mechanism. It then fuses the extracted segments based on their relatedness with the target for sentiment classification. We present comprehensive comparative experiments on three benchmarks with three major findings. First, TG-SAN outperforms the state-of-the-art by up to 1.61% and 3.58% in terms of accuracy and Marco-F1, respectively. Second, it shows a strong advantage in determining the sentiment of a target when the context sentence contains multiple semantic segments. Lastly, visualization results show that the attention scores produced by TG-SAN are highly interpretable",
    "checked": true,
    "id": "96f874fbbc32883399a18206a6f6d77740354c90",
    "semantic_title": "target-guided structured attention network for target-dependent sentiment analysis",
    "citation_count": 19,
    "authors": [
      "Ji Zhang",
      "Chengyao Chen",
      "Pengfei Liu",
      "Chao He",
      "Cane Wing-Ki Leung"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.13": {
    "title": "Break It Down: A Question Understanding Benchmark",
    "volume": "main",
    "abstract": "Understanding natural language questions entails the ability to break down a question into the requisite steps for computing its answer. In this work, we introduce a Question Decomposition Meaning Representation (QDMR) for questions. QDMR constitutes the ordered list of steps, expressed through natural language, that are necessary for answering a question. We develop a crowdsourcing pipeline, showing that quality QDMRs can be annotated at scale, and release the Break dataset, containing over 83K pairs of questions and their QDMRs. We demonstrate the utility of QDMR by showing that (a) it can be used to improve open-domain question answering on the HotpotQA dataset, (b) it can be deterministically converted to a pseudo-SQL formal language, which can alleviate annotation in semantic parsing applications. Last, we use Break to train a sequence-to-sequence model with copying that parses questions into QDMR structures, and show that it substantially outperforms several natural baselines",
    "checked": true,
    "id": "71c908529b12ef6ee8d735127a63d48b1fc5c43c",
    "semantic_title": "break it down: a question understanding benchmark",
    "citation_count": 186,
    "authors": [
      "Tomer Wolfson",
      "Mor Geva",
      "Ankit Gupta",
      "Matt Gardner",
      "Yoav Goldberg",
      "Daniel Deutch",
      "Jonathan Berant"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.14": {
    "title": "Acoustic-Prosodic and Lexical Cues to Deception and Trust: Deciphering How People Detect Lies",
    "volume": "main",
    "abstract": "Humans rarely perform better than chance at lie detection. To better understand human perception of deception, we created a game framework, LieCatcher, to collect ratings of perceived deception using a large corpus of deceptive and truthful interviews. We analyzed the acoustic-prosodic and linguistic characteristics of language trusted and mistrusted by raters and compared these to characteristics of actual truthful and deceptive language to understand how perception aligns with reality. With this data we built classifiers to automatically distinguish trusted from mistrusted speech, achieving an F1 of 66.1%. We next evaluated whether the strategies raters said they used to discriminate between truthful and deceptive responses were in fact useful. Our results show that, although several prosodic and lexical features were consistently perceived as trustworthy, they were not reliable cues. Also, the strategies that judges reported using in deception detection were not helpful for the task. Our work sheds light on the nature of trusted language and provides insight into the challenging problem of human deception detection",
    "checked": true,
    "id": "10b58b4fbc1de596b9102f15548e54b99135293c",
    "semantic_title": "acoustic-prosodic and lexical cues to deception and trust: deciphering how people detect lies",
    "citation_count": 34,
    "authors": [
      "Xi (Leslie) Chen",
      "Sarah Ita Levitan",
      "Michelle Levine",
      "Marko Mandic",
      "Julia Hirschberg"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.15": {
    "title": "Unsupervised Discourse Constituency Parsing Using Viterbi EM",
    "volume": "main",
    "abstract": "In this paper, we introduce an unsupervised discourse constituency parsing algorithm. We use Viterbi EM with a margin-based criterion to train a span-based discourse parser in an unsupervised manner. We also propose initialization methods for Viterbi training of discourse constituents based on our prior knowledge of text structures. Experimental results demonstrate that our unsupervised parser achieves comparable or even superior performance to fully supervised parsers. We also investigate discourse constituents that are learned by our method",
    "checked": true,
    "id": "afee13719b496fe3419c13b33bab28e012e50d80",
    "semantic_title": "unsupervised discourse constituency parsing using viterbi em",
    "citation_count": 14,
    "authors": [
      "Noriki Nishida",
      "Hideki Nakayama"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.16": {
    "title": "Decoding Brain Activity Associated with Literal and Metaphoric Sentence Comprehension Using Distributional Semantic Models",
    "volume": "main",
    "abstract": "Recent years have seen a growing interest within the natural language processing (NLP) community in evaluating the ability of semantic models to capture human meaning representation in the brain. Existing research has mainly focused on applying semantic models to decode brain activity patterns associated with the meaning of individual words, and, more recently, this approach has been extended to sentences and larger text fragments. Our work is the first to investigate metaphor processing in the brain in this context. We evaluate a range of semantic models (word embeddings, compositional, and visual models) in their ability to decode brain activity associated with reading of both literal and metaphoric sentences. Our results suggest that compositional models and word embeddings are able to capture differences in the processing of literal and metaphoric sentences, providing support for the idea that the literal meaning is not fully accessible during familiar metaphor comprehension",
    "checked": true,
    "id": "949ee3373bcad512ad2dd1bb2829f3c0000e7eae",
    "semantic_title": "decoding brain activity associated with literal and metaphoric sentence comprehension using distributional semantic models",
    "citation_count": 12,
    "authors": [
      "Vesna G. Djokic",
      "Jean Maillard",
      "Luana Bulat",
      "Ekaterina Shutova"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.17": {
    "title": "Machine Learning–Driven Language Assessment",
    "volume": "main",
    "abstract": "We describe a method for rapidly creating language proficiency assessments, and provide experimental evidence that such tests can be valid, reliable, and secure. Our approach is the first to use machine learning and natural language processing to induce proficiency scales based on a given standard, and then use linguistic models to estimate item difficulty directly for computer-adaptive testing. This alleviates the need for expensive pilot testing with human subjects. We used these methods to develop an online proficiency exam called the Duolingo English Test, and demonstrate that its scores align significantly with other high-stakes English assessments. Furthermore, our approach produces test scores that are highly reliable, while generating item banks large enough to satisfy security requirements",
    "checked": true,
    "id": "e30f1089e16c07bebe7e951bb27df53f122ee843",
    "semantic_title": "machine learning–driven language assessment",
    "citation_count": 95,
    "authors": [
      "Burr Settles",
      "Geoffrey T. LaFlair",
      "Masato Hagiwara"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.18": {
    "title": "Leveraging Pre-trained Checkpoints for Sequence Generation Tasks",
    "volume": "main",
    "abstract": "Unsupervised pre-training of large neural models has recently revolutionized Natural Language Processing. By warm-starting from the publicly released checkpoints, NLP practitioners have pushed the state-of-the-art on multiple benchmarks while saving significant amounts of compute time. So far the focus has been mainly on the Natural Language Understanding tasks. In this paper, we demonstrate the efficacy of pre-trained checkpoints for Sequence Generation. We developed a Transformer-based sequence-to-sequence model that is compatible with publicly available pre-trained BERT, GPT-2, and RoBERTa checkpoints and conducted an extensive empirical study on the utility of initializing our model, both encoder and decoder, with these checkpoints. Our models result in new state-of-the-art results on Machine Translation, Text Summarization, Sentence Splitting, and Sentence Fusion",
    "checked": true,
    "id": "eb606d9ce65139754232cee62f6ab77f3e0c665f",
    "semantic_title": "leveraging pre-trained checkpoints for sequence generation tasks",
    "citation_count": 434,
    "authors": [
      "Sascha Rothe",
      "Shashi Narayan",
      "Aliaksei Severyn"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.19": {
    "title": "CrossWOZ: A Large-Scale Chinese Cross-Domain Task-Oriented Dialogue Dataset",
    "volume": "main",
    "abstract": "To advance multi-domain (cross-domain) dialogue modeling as well as alleviate the shortage of Chinese task-oriented datasets, we propose CrossWOZ, the first large-scale Chinese Cross-Domain Wizard-of-Oz task-oriented dataset. It contains 6K dialogue sessions and 102K utterances for 5 domains, including hotel, restaurant, attraction, metro, and taxi. Moreover, the corpus contains rich annotation of dialogue states and dialogue acts on both user and system sides. About 60% of the dialogues have cross-domain user goals that favor inter-domain dependency and encourage natural transition across domains in conversation. We also provide a user simulator and several benchmark models for pipelined task-oriented dialogue systems, which will facilitate researchers to compare and evaluate their models on this corpus. The large size and rich annotation of CrossWOZ make it suitable to investigate a variety of tasks in cross-domain dialogue modeling, such as dialogue state tracking, policy learning, user simulation, etc",
    "checked": true,
    "id": "33f1bf39b34144cc1126c061be22187d81f46bf8",
    "semantic_title": "crosswoz: a large-scale chinese cross-domain task-oriented dialogue dataset",
    "citation_count": 110,
    "authors": [
      "Qi Zhu",
      "Kaili Huang",
      "Zheng Zhang",
      "Xiaoyan Zhu",
      "Minlie Huang"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.20": {
    "title": "How Furiously Can Colorless Green Ideas Sleep? Sentence Acceptability in Context",
    "volume": "main",
    "abstract": "We study the influence of context on sentence acceptability. First we compare the acceptability ratings of sentences judged in isolation, with a relevant context, and with an irrelevant context. Our results show that context induces a cognitive load for humans, which compresses the distribution of ratings. Moreover, in relevant contexts we observe a discourse coherence effect that uniformly raises acceptability. Next, we test unidirectional and bidirectional language models in their ability to predict acceptability ratings. The bidirectional models show very promising results, with the best model achieving a new state-of-the-art for unsupervised acceptability prediction. The two sets of experiments provide insights into the cognitive aspects of sentence processing and central issues in the computational modeling of text and discourse",
    "checked": true,
    "id": "09307f588e2800b37c943194c84836b4811eb74e",
    "semantic_title": "how furiously can colorless green ideas sleep? sentence acceptability in context",
    "citation_count": 41,
    "authors": [
      "Jey Han Lau",
      "Carlos Armendariz",
      "Shalom Lappin",
      "Matthew Purver",
      "Chang Shu"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.21": {
    "title": "Learning Lexical Subspaces in a Distributional Vector Space",
    "volume": "main",
    "abstract": "In this paper, we propose LexSub, a novel approach towards unifying lexical and distributional semantics. We inject knowledge about lexical-semantic relations into distributional word embeddings by defining subspaces of the distributional vector space in which a lexical relation should hold. Our framework can handle symmetric attract and repel relations (e.g., synonymy and antonymy, respectively), as well as asymmetric relations (e.g., hypernymy and meronomy). In a suite of intrinsic benchmarks, we show that our model outperforms previous approaches on relatedness tasks and on hypernymy classification and detection, while being competitive on word similarity tasks. It also outperforms previous systems on extrinsic classification tasks that benefit from exploiting lexical relational cues. We perform a series of analyses to understand the behaviors of our model.1Code available at https://github.com/aishikchakraborty/LexSub",
    "checked": true,
    "id": "2677f411aae496be93ee70bcbf0eb0e949c13e0c",
    "semantic_title": "learning lexical subspaces in a distributional vector space",
    "citation_count": 8,
    "authors": [
      "Kushal Arora",
      "Aishik Chakraborty",
      "Jackie C. K. Cheung"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.22": {
    "title": "Syntax-Guided Controlled Generation of Paraphrases",
    "volume": "main",
    "abstract": "Given a sentence (e.g., \"I like mangoes\") and a constraint (e.g., sentiment flip), the goal of controlled text generation is to produce a sentence that adapts the input sentence to meet the requirements of the constraint (e.g., \"I hate mangoes\"). Going beyond such simple constraints, recent work has started exploring the incorporation of complex syntactic-guidance as constraints in the task of controlled paraphrase generation. In these methods, syntactic-guidance is sourced from a separate exemplar sentence. However, this prior work has only utilized limited syntactic information available in the parse tree of the exemplar sentence. We address this limitation in the paper and propose Syntax Guided Controlled Paraphraser (SGCP), an end-to-end framework for syntactic paraphrase generation. We find that Sgcp can generate syntax-conforming sentences while not compromising on relevance. We perform extensive automated and human evaluations over multiple real-world English language datasets to demonstrate the efficacy of Sgcp over state-of-the-art baselines. To drive future research, we have made Sgcp's source code available.1",
    "checked": true,
    "id": "1b9bb6dabb084e0ec06c3956d8384312880bb28e",
    "semantic_title": "syntax-guided controlled generation of paraphrases",
    "citation_count": 93,
    "authors": [
      "Ashutosh Kumar",
      "Kabir Ahuja",
      "Raghuram Vadapalli",
      "Partha Talukdar"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.23": {
    "title": "Better Document-Level Machine Translation with Bayes' Rule",
    "volume": "main",
    "abstract": "We show that Bayes' rule provides an effective mechanism for creating document translation models that can be learned from only parallel sentences and monolingual documents a compelling benefit because parallel documents are not always available. In our formulation, the posterior probability of a candidate translation is the product of the unconditional (prior) probability of the candidate output document and the \"reverse translation probability\" of translating the candidate output back into the source language. Our proposed model uses a powerful autoregressive language model as the prior on target language documents, but it assumes that each sentence is translated independently from the target to the source language. Crucially, at test time, when a source document is observed, the document language model prior induces dependencies between the translations of the source sentences in the posterior. The model's independence assumption not only enables efficient use of available data, but it additionally admits a practical left-to-right beam-search algorithm for carrying out inference. Experiments show that our model benefits from using cross-sentence context in the language model, and it outperforms existing document translation approaches",
    "checked": true,
    "id": "cae07d4d7552cd67a495de1c6c26eec0d2802f09",
    "semantic_title": "better document-level machine translation with bayes' rule",
    "citation_count": 46,
    "authors": [
      "Lei Yu",
      "Laurent Sartran",
      "Wojciech Stokowiec",
      "Wang Ling",
      "Lingpeng Kong",
      "Phil Blunsom",
      "Chris Dyer"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.24": {
    "title": "Hierarchical Mapping for Crosslingual Word Embedding Alignment",
    "volume": "main",
    "abstract": "The alignment of word embedding spaces in different languages into a common crosslingual space has recently been in vogue. Strategies that do so compute pairwise alignments and then map multiple languages to a single pivot language (most often English). These strategies, however, are biased towards the choice of the pivot language, given that language proximity and the linguistic characteristics of the target language can strongly impact the resultant crosslingual space in detriment of topologically distant languages. We present a strategy that eliminates the need for a pivot language by learning the mappings across languages in a hierarchical way. Experiments demonstrate that our strategy significantly improves vocabulary induction scores in all existing benchmarks, as well as in a new non-English–centered benchmark we built, which we make publicly available",
    "checked": true,
    "id": "ff6ed3521ba4aa6a137e88ed8b5cc70467594129",
    "semantic_title": "hierarchical mapping for crosslingual word embedding alignment",
    "citation_count": 6,
    "authors": [
      "Ion Madrazo Azpiazu",
      "Maria Soledad Pera"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.25": {
    "title": "BLiMP: The Benchmark of Linguistic Minimal Pairs for English",
    "volume": "main",
    "abstract": "We introduce The Benchmark of Linguistic Minimal Pairs (BLiMP),1 a challenge set for evaluating the linguistic knowledge of language models (LMs) on major grammatical phenomena in English. BLiMP consists of 67 individual datasets, each containing 1,000 minimal pairs—that is, pairs of minimally different sentences that contrast in grammatical acceptability and isolate specific phenomenon in syntax, morphology, or semantics. We generate the data according to linguist-crafted grammar templates, and human aggregate agreement with the labels is 96.4%. We evaluate n-gram, LSTM, and Transformer (GPT-2 and Transformer-XL) LMs by observing whether they assign a higher probability to the acceptable sentence in each minimal pair. We find that state-of-the-art models identify morphological contrasts related to agreement reliably, but they struggle with some subtle semantic and syntactic phenomena, such as negative polarity items and extraction islands",
    "checked": true,
    "id": "5a2263092f49540fd0e049050a96882ff29b00c3",
    "semantic_title": "blimp: the benchmark of linguistic minimal pairs for english",
    "citation_count": 477,
    "authors": [
      "Alex Warstadt",
      "Alicia Parrish",
      "Haokun Liu",
      "Anhad Mohananey",
      "Wei Peng",
      "Sheng-Fu Wang",
      "Samuel R. Bowman"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.26": {
    "title": "Reproducible and Efficient Benchmarks for Hyperparameter Optimization of Neural Machine Translation Systems",
    "volume": "main",
    "abstract": "Hyperparameter selection is a crucial part of building neural machine translation (NMT) systems across both academia and industry. Fine-grained adjustments to a model's architecture or training recipe can mean the difference between a positive and negative research result or between a state-of-the-art and underperforming system. While recent literature has proposed methods for automatic hyperparameter optimization (HPO), there has been limited work on applying these methods to neural machine translation (NMT), due in part to the high costs associated with experiments that train large numbers of model variants. To facilitate research in this space, we introduce a lookup-based approach that uses a library of pre-trained models for fast, low cost HPO experimentation. Our contributions include (1) the release of a large collection of trained NMT models covering a wide range of hyperparameters, (2) the proposal of targeted metrics for evaluating HPO methods on NMT, and (3) a reproducible benchmark of several HPO methods against our model library, including novel graph-based and multiobjective methods",
    "checked": true,
    "id": "b91f161bde9756d184f1b5640721e801fa67201e",
    "semantic_title": "reproducible and efficient benchmarks for hyperparameter optimization of neural machine translation systems",
    "citation_count": 28,
    "authors": [
      "Xuan Zhang",
      "Kevin Duh"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.27": {
    "title": "Consistent Unsupervised Estimators for Anchored PCFGs",
    "volume": "main",
    "abstract": "Learning probabilistic context-free grammars (PCFGs) from strings is a classic problem in computational linguistics since Horning (1969). Here we present an algorithm based on distributional learning that is a consistent estimator for a large class of PCFGs that satisfy certain natural conditions including being anchored (Stratos et al., 2016). We proceed via a reparameterization of (top–down) PCFGs that we call a bottom–up weighted context-free grammar. We show that if the grammar is anchored and satisfies additional restrictions on its ambiguity, then the parameters can be directly related to distributional properties of the anchoring strings; we show the asymptotic correctness of a naive estimator and present some simulations using synthetic data that show that algorithms based on this approach have good finite sample behavior",
    "checked": true,
    "id": "7c94fd1f86a769cdf0b70c57be7d34d489cc6fb7",
    "semantic_title": "consistent unsupervised estimators for anchored pcfgs",
    "citation_count": 13,
    "authors": [
      "Alexander Clark",
      "Nathanaël Fijalkow"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.28": {
    "title": "How Can We Know What Language Models Know?",
    "volume": "main",
    "abstract": "Recent work has presented intriguing results examining the knowledge contained in language models (LMs) by having the LM fill in the blanks of prompts such as \"Obama is a __ by profession\". These prompts are usually manually created, and quite possibly sub-optimal; another prompt such as \"Obama worked as a __ \" may result in more accurately predicting the correct profession. Because of this, given an inappropriate prompt, we might fail to retrieve facts that the LM does know, and thus any given prompt only provides a lower bound estimate of the knowledge contained in an LM. In this paper, we attempt to more accurately estimate the knowledge contained in LMs by automatically discovering better prompts to use in this querying process. Specifically, we propose mining-based and paraphrasing-based methods to automatically generate high-quality and diverse prompts, as well as ensemble methods to combine answers from different prompts. Extensive experiments on the LAMA benchmark for extracting relational knowledge from LMs demonstrate that our methods can improve accuracy from 31.1% to 39.6%, providing a tighter lower bound on what LMs know. We have released the code and the resulting LM Prompt And Query Archive (LPAQA) at https://github.com/jzbjyb/LPAQA",
    "checked": true,
    "id": "a75649771901a4881b44c0ceafa469fcc6e6f968",
    "semantic_title": "how can we know what language models know?",
    "citation_count": 1387,
    "authors": [
      "Zhengbao Jiang",
      "Frank F. Xu",
      "Jun Araki",
      "Graham Neubig"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.29": {
    "title": "Topic Modeling in Embedding Spaces",
    "volume": "main",
    "abstract": "Topic modeling analyzes documents to learn meaningful patterns of words. However, existing topic models fail to learn interpretable topics when working with large and heavy-tailed vocabularies. To this end, we develop the embedded topic model (etm), a generative model of documents that marries traditional topic models with word embeddings. More specifically, the etm models each word with a categorical distribution whose natural parameter is the inner product between the word's embedding and an embedding of its assigned topic. To fit the etm, we develop an efficient amortized variational inference algorithm. The etm discovers interpretable topics even with large vocabularies that include rare words and stop words. It outperforms existing document models, such as latent Dirichlet allocation, in terms of both topic quality and predictive performance",
    "checked": true,
    "id": "d5f47453a6d00ede2881dfb65fc7ea141a50deeb",
    "semantic_title": "topic modeling in embedding spaces",
    "citation_count": 628,
    "authors": [
      "Adji B. Dieng",
      "Francisco J. R. Ruiz",
      "David M. Blei"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.30": {
    "title": "TyDi QA: A Benchmark for Information-Seeking Question Answering in Typologically Diverse Languages",
    "volume": "main",
    "abstract": "Confidently making progress on multilingual modeling requires challenging, trustworthy evaluations. We present TyDi QA—a question answering dataset covering 11 typologically diverse languages with 204K question-answer pairs. The languages of TyDi QA are diverse with regard to their typology—the set of linguistic features each language expresses—such that we expect models performing well on this set to generalize across a large number of the world's languages. We present a quantitative analysis of the data quality and example-level qualitative linguistic analyses of observed language phenomena that would not be found in English-only corpora. To provide a realistic information-seeking task and avoid priming effects, questions are written by people who want to know the answer, but don't know the answer yet, and the data is collected directly in each language without the use of translation",
    "checked": true,
    "id": "83a820fe19944a7621238b8cfcc0b8a0cbc0f4b6",
    "semantic_title": "tydi qa: a benchmark for information-seeking question answering in typologically diverse languages",
    "citation_count": 601,
    "authors": [
      "Jonathan H. Clark",
      "Eunsol Choi",
      "Michael Collins",
      "Dan Garrette",
      "Tom Kwiatkowski",
      "Vitaly Nikolaev",
      "Jennimaria Palomaki"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.31": {
    "title": "A Neural Generative Model for Joint Learning Topics and Topic-Specific Word Embeddings",
    "volume": "main",
    "abstract": "We propose a novel generative model to explore both local and global context for joint learning topics and topic-specific word embeddings. In particular, we assume that global latent topics are shared across documents, a word is generated by a hidden semantic vector encoding its contextual semantic meaning, and its context words are generated conditional on both the hidden semantic vector and global latent topics. Topics are trained jointly with the word embeddings. The trained model maps words to topic-dependent embeddings, which naturally addresses the issue of word polysemy. Experimental results show that the proposed model outperforms the word-level embedding methods in both word similarity evaluation and word sense disambiguation. Furthermore, the model also extracts more coherent topics compared with existing neural topic models or other models for joint learning of topics and word embeddings. Finally, the model can be easily integrated with existing deep contextualized word embedding learning methods to further improve the performance of downstream tasks such as sentiment classification",
    "checked": true,
    "id": "4a7dcc5687fb0342f9f6b9c18cbbf269e8ec0ed0",
    "semantic_title": "a neural generative model for joint learning topics and topic-specific word embeddings",
    "citation_count": 14,
    "authors": [
      "Lixing Zhu",
      "Yulan He",
      "Deyu Zhou"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.32": {
    "title": "Nurse is Closer to Woman than Surgeon? Mitigating Gender-Biased Proximities in Word Embeddings",
    "volume": "main",
    "abstract": "Word embeddings are the standard model for semantic and syntactic representations of words. Unfortunately, these models have been shown to exhibit undesirable word associations resulting from gender, racial, and religious biases. Existing post-processing methods for debiasing word embeddings are unable to mitigate gender bias hidden in the spatial arrangement of word vectors. In this paper, we propose RAN-Debias, a novel gender debiasing methodology that not only eliminates the bias present in a word vector but also alters the spatial distribution of its neighboring vectors, achieving a bias-free setting while maintaining minimal semantic offset. We also propose a new bias evaluation metric, Gender-based Illicit Proximity Estimate (GIPE), which measures the extent of undue proximity in word vectors resulting from the presence of gender-based predilections. Experiments based on a suite of evaluation metrics show that RAN-Debias significantly outperforms the state-of-the-art in reducing proximity bias (GIPE) by at least 42.02%. It also reduces direct bias, adding minimal semantic disturbance, and achieves the best performance in a downstream application task (coreference resolution)",
    "checked": true,
    "id": "c2ecc9073672a8d8bf21fe442dbf3f76356858ee",
    "semantic_title": "nurse is closer to woman than surgeon? mitigating gender-biased proximities in word embeddings",
    "citation_count": 46,
    "authors": [
      "Vaibhav Kumar",
      "Tenzin Singhay Bhotia",
      "Vaibhav Kumar",
      "Tanmoy Chakraborty"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.33": {
    "title": "PERL: Pivot-based Domain Adaptation for Pre-trained Deep Contextualized Embedding Models",
    "volume": "main",
    "abstract": "Pivot-based neural representation models have led to significant progress in domain adaptation for NLP. However, previous research following this approach utilize only labeled data from the source domain and unlabeled data from the source and target domains, but neglect to incorporate massive unlabeled corpora that are not necessarily drawn from these domains. To alleviate this, we propose PERL: A representation learning model that extends contextualized word embedding models such as BERT (Devlin et al., 2019) with pivot-based fine-tuning. PERL outperforms strong baselines across 22 sentiment classification domain adaptation setups, improves in-domain model performance, yields effective reduced-size models, and increases model stability.1",
    "checked": true,
    "id": "a33b09d1a41db92ca14185a28f9163056ca2a115",
    "semantic_title": "perl: pivot-based domain adaptation for pre-trained deep contextualized embedding models",
    "citation_count": 62,
    "authors": [
      "Eyal Ben-David",
      "Carmel Rabinovitz",
      "Roi Reichart"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.34": {
    "title": "AMR Similarity Metrics from Principles",
    "volume": "main",
    "abstract": "Different metrics have been proposed to compare Abstract Meaning Representation (AMR) graphs. The canonical Smatch metric (Cai and Knight, 2013) aligns the variables of two graphs and assesses triple matches. The recent SemBleu metric (Song and Gildea, 2019) is based on the machine-translation metric Bleu (Papineni et al., 2002) and increases computational efficiency by ablating the variable-alignment. In this paper, i) we establish criteria that enable researchers to perform a principled assessment of metrics comparing meaning representations like AMR; ii) we undertake a thorough analysis of Smatch and SemBleu where we show that the latter exhibits some undesirable properties. For example, it does not conform to the identity of indiscernibles rule and introduces biases that are hard to control; and iii) we propose a novel metric S2 match that is more benevolent to only very slight meaning deviations and targets the fulfilment of all established criteria. We assess its suitability and show its advantages over Smatch and SemBleu",
    "checked": true,
    "id": "d9255df54d7e5db413d73a90be83e07fe8eb8758",
    "semantic_title": "amr similarity metrics from principles",
    "citation_count": 42,
    "authors": [
      "Juri Opitz",
      "Letitia Parcalabescu",
      "Anette Frank"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.35": {
    "title": "Unsupervised Quality Estimation for Neural Machine Translation",
    "volume": "main",
    "abstract": "Quality Estimation (QE) is an important component in making Machine Translation (MT) useful in real-world applications, as it is aimed to inform the user on the quality of the MT output at test time. Existing approaches require large amounts of expert annotated data, computation, and time for training. As an alternative, we devise an unsupervised approach to QE where no training or access to additional resources besides the MT system itself is required. Different from most of the current work that treats the MT system as a black box, we explore useful information that can be extracted from the MT system as a by-product of translation. By utilizing methods for uncertainty quantification, we achieve very good correlation with human judgments of quality, rivaling state-of-the-art supervised QE models. To evaluate our approach we collect the first dataset that enables work on both black-box and glass-box approaches to QE",
    "checked": true,
    "id": "8ae3421420ec57d551ef2f524b48dcc78f9337fc",
    "semantic_title": "unsupervised quality estimation for neural machine translation",
    "citation_count": 196,
    "authors": [
      "Marina Fomicheva",
      "Shuo Sun",
      "Lisa Yankovskaya",
      "Frédéric Blain",
      "Francisco Guzmán",
      "Mark Fishel",
      "Nikolaos Aletras",
      "Vishrav Chaudhary",
      "Lucia Specia"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.36": {
    "title": "Task-Oriented Dialogue as Dataflow Synthesis",
    "volume": "main",
    "abstract": "We describe an approach to task-oriented dialogue in which dialogue state is represented as a dataflow graph. A dialogue agent maps each user utterance to a program that extends this graph. Programs include metacomputation operators for reference and revision that reuse dataflow fragments from previous turns. Our graph-based state enables the expression and manipulation of complex user intents, and explicit metacomputation makes these intents easier for learned models to predict. We introduce a new dataset, SMCalFlow, featuring complex dialogues about events, weather, places, and people. Experiments show that dataflow graphs and metacomputation substantially improve representability and predictability in these natural dialogues. Additional experiments on the MultiWOZ dataset show that our dataflow representation enables an otherwise off-the-shelf sequence-to-sequence model to match the best existing task-specific state tracking model. The SMCalFlow dataset, code for replicating experiments, and a public leaderboard are available at https://www.microsoft.com/en-us/research/project/dataflow-based-dialogue-semantic-machines",
    "checked": true,
    "id": "f430773cdc0fdd62192a48a372601d6aa40f3d7b",
    "semantic_title": "task-oriented dialogue as dataflow synthesis",
    "citation_count": 155,
    "authors": [
      "Jacob Andreas",
      "John Bufe",
      "David Burkett",
      "Charles Chen",
      "Josh Clausman",
      "Jean Crawford",
      "Kate Crim",
      "Jordan DeLoach",
      "Leah Dorner",
      "Jason Eisner",
      "Hao Fang",
      "Alan Guo",
      "David Hall",
      "Kristin Hayes",
      "Kellie Hill",
      "Diana Ho",
      "Wendy Iwaszuk",
      "Smriti Jha",
      "Dan Klein",
      "Jayant Krishnamurthy",
      "Theo Lanman",
      "Percy Liang",
      "Christopher H. Lin",
      "Ilya Lintsbakh",
      "Andy McGovern",
      "Aleksandr Nisnevich",
      "Adam Pauls",
      "Dmitrij Petters",
      "Brent Read",
      "Dan Roth",
      "Subhro Roy",
      "Jesse Rusak",
      "Beth Short",
      "Div Slomin",
      "Ben Snyder",
      "Stephon Striplin",
      "Yu Su",
      "Zachary Tellman",
      "Sam Thomson",
      "Andrei Vorobev",
      "Izabela Witoszko",
      "Jason Wolfe",
      "Abby Wray",
      "Yuchen Zhang",
      "Alexander Zotov"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.37": {
    "title": "What Does My QA Model Know? Devising Controlled Probes Using Expert Knowledge",
    "volume": "main",
    "abstract": "Open-domain question answering (QA) involves many knowledge and reasoning challenges, but are successful QA models actually learning such knowledge when trained on benchmark QA tasks? We investigate this via several new diagnostic tasks probing whether multiple-choice QA models know definitions and taxonomic reasoning—two skills widespread in existing benchmarks and fundamental to more complex reasoning. We introduce a methodology for automatically building probe datasets from expert knowledge sources, allowing for systematic control and a comprehensive evaluation. We include ways to carefully control for artifacts that may arise during this process. Our evaluation confirms that transformer-based multiple-choice QA models are already predisposed to recognize certain types of structural linguistic knowledge. However, it also reveals a more nuanced picture: their performance notably degrades even with a slight increase in the number of \"hops\" in the underlying taxonomic hierarchy, and with more challenging distractor candidates. Further, existing models are far from perfect when assessed at the level of clusters of semantically connected probes, such as all hypernym questions about a single concept",
    "checked": true,
    "id": "5a9001cdccdb8b1de227a45eccc503d32d1a2464",
    "semantic_title": "what does my qa model know? devising controlled probes using expert knowledge",
    "citation_count": 45,
    "authors": [
      "Kyle Richardson",
      "Ashish Sabharwal"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.38": {
    "title": "Modeling Global and Local Node Contexts for Text Generation from Knowledge Graphs",
    "volume": "main",
    "abstract": "Recent graph-to-text models generate text from graph-based data using either global or local aggregation to learn node representations. Global node encoding allows explicit communication between two distant nodes, thereby neglecting graph topology as all nodes are directly connected. In contrast, local node encoding considers the relations between neighbor nodes capturing the graph structure, but it can fail to capture long-range relations. In this work, we gather both encoding strategies, proposing novel neural models that encode an input graph combining both global and local node contexts, in order to learn better contextualized node embeddings. In our experiments, we demonstrate that our approaches lead to significant improvements on two graph-to-text datasets achieving BLEU scores of 18.01 on the AGENDA dataset, and 63.69 on the WebNLG dataset for seen categories, outperforming state-of-the-art models by 3.7 and 3.1 points, respectively.1",
    "checked": true,
    "id": "c96ef1c40f509f3864f08fef6949b76f5309452b",
    "semantic_title": "modeling global and local node contexts for text generation from knowledge graphs",
    "citation_count": 72,
    "authors": [
      "Leonardo F. R. Ribeiro",
      "Yue Zhang",
      "Claire Gardent",
      "Iryna Gurevych"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.39": {
    "title": "Nested Named Entity Recognition via Second-best Sequence Learning and Decoding",
    "volume": "main",
    "abstract": "When an entity name contains other names within it, the identification of all combinations of names can become difficult and expensive. We propose a new method to recognize not only outermost named entities but also inner nested ones. We design an objective function for training a neural model that treats the tag sequence for nested entities as the second best path within the span of their parent entity. In addition, we provide the decoding method for inference that extracts entities iteratively from outermost ones to inner ones in an outside-to-inside way. Our method has no additional hyperparameters to the conditional random field based model widely used for flat named entity recognition tasks. Experiments demonstrate that our method performs better than or at least as well as existing methods capable of handling nested entities, achieving F1-scores of 85.82%, 84.34%, and 77.36% on ACE-2004, ACE-2005, and GENIA datasets, respectively",
    "checked": true,
    "id": "23eb64d518d0255883b8cabaa7f445f8bd1c21e0",
    "semantic_title": "nested named entity recognition via second-best sequence learning and decoding",
    "citation_count": 127,
    "authors": [
      "Takashi Shibuya",
      "Eduard Hovy"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.40": {
    "title": "An Empirical Study on Robustness to Spurious Correlations using Pre-trained Language Models",
    "volume": "main",
    "abstract": "Recent work has shown that pre-trained language models such as BERT improve robustness to spurious correlations in the dataset. Intrigued by these results, we find that the key to their success is generalization from a small amount of counterexamples where the spurious correlations do not hold. When such minority examples are scarce, pre-trained models perform as poorly as models trained from scratch. In the case of extreme minority, we propose to use multi-task learning (MTL) to improve generalization. Our experiments on natural language inference and paraphrase identification show that MTL with the right auxiliary tasks significantly improves performance on challenging examples without hurting the in-distribution performance. Further, we show that the gain from MTL mainly comes from improved generalization from the minority examples. Our results highlight the importance of data diversity for overcoming spurious correlations.1",
    "checked": true,
    "id": "04422085a52050516b9741e0fd1fda964b73dd53",
    "semantic_title": "an empirical study on robustness to spurious correlations using pre-trained language models",
    "citation_count": 185,
    "authors": [
      "Lifu Tu",
      "Garima Lalwani",
      "Spandana Gella",
      "He He"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.41": {
    "title": "Data Weighted Training Strategies for Grammatical Error Correction",
    "volume": "main",
    "abstract": "Recent progress in the task of Grammatical Error Correction (GEC) has been driven by addressing data sparsity, both through new methods for generating large and noisy pretraining data and through the publication of small and higher-quality finetuning data in the BEA-2019 shared task. Building upon recent work in Neural Machine Translation (NMT), we make use of both kinds of data by deriving example-level scores on our large pretraining data based on a smaller, higher-quality dataset. In this work, we perform an empirical study to discover how to best incorporate delta-log-perplexity, a type of example scoring, into a training schedule for GEC. In doing so, we perform experiments that shed light on the function and applicability of delta-log-perplexity. Models trained on scored data achieve state- of-the-art results on common GEC test sets",
    "checked": true,
    "id": "c29286b86c6acbfc54491823afe30d04e2892c97",
    "semantic_title": "data weighted training strategies for grammatical error correction",
    "citation_count": 47,
    "authors": [
      "Jared Lichtarge",
      "Chris Alberti",
      "Shankar Kumar"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.42": {
    "title": "The Return of Lexical Dependencies: Neural Lexicalized PCFGs",
    "volume": "main",
    "abstract": "In this paper we demonstrate that context free grammar (CFG) based methods for grammar induction benefit from modeling lexical dependencies. This contrasts to the most popular current methods for grammar induction, which focus on discovering either constituents or dependencies. Previous approaches to marry these two disparate syntactic formalisms (e.g., lexicalized PCFGs) have been plagued by sparsity, making them unsuitable for unsupervised grammar induction. However, in this work, we present novel neural models of lexicalized PCFGs that allow us to overcome sparsity problems and effectively induce both constituents and dependencies within a single model. Experiments demonstrate that this unified framework results in stronger results on both representations than achieved when modeling either formalism alone.1",
    "checked": true,
    "id": "65c2a39f1579a947926ac5746888445ea4afdf6e",
    "semantic_title": "the return of lexical dependencies: neural lexicalized pcfgs",
    "citation_count": 30,
    "authors": [
      "Hao Zhu",
      "Yonatan Bisk",
      "Graham Neubig"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.43": {
    "title": "Beat the AI: Investigating Adversarial Human Annotation for Reading Comprehension",
    "volume": "main",
    "abstract": "Innovations in annotation methodology have been a catalyst for Reading Comprehension (RC) datasets and models. One recent trend to challenge current RC models is to involve a model in the annotation process: Humans create questions adversarially, such that the model fails to answer them correctly. In this work we investigate this annotation methodology and apply it in three different settings, collecting a total of 36,000 samples with progressively stronger models in the annotation loop. This allows us to explore questions such as the reproducibility of the adversarial effect, transfer from data collected with varying model-in-the-loop strengths, and generalization to data collected without a model. We find that training on adversarially collected samples leads to strong generalization to non-adversarially collected datasets, yet with progressive performance deterioration with increasingly stronger models-in-the-loop. Furthermore, we find that stronger models can still learn from datasets collected with substantially weaker models-in-the-loop. When trained on data collected with a BiDAF model in the loop, RoBERTa achieves 39.9F1 on questions that it cannot answer when trained on SQuAD—only marginally lower than when trained on data collected using RoBERTa itself (41.0F1)",
    "checked": true,
    "id": "693cce5d9764f9e9e0c9c583bf840ac019e2179f",
    "semantic_title": "beat the ai: investigating adversarial human annotation for reading comprehension",
    "citation_count": 168,
    "authors": [
      "Max Bartolo",
      "Alastair Roberts",
      "Johannes Welbl",
      "Sebastian Riedel",
      "Pontus Stenetorp"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.44": {
    "title": "Sketch-Driven Regular Expression Generation from Natural Language and Examples",
    "volume": "main",
    "abstract": "Recent systems for converting natural language descriptions into regular expressions (regexes) have achieved some success, but typically deal with short, formulaic text and can only produce simple regexes. Real-world regexes are complex, hard to describe with brief sentences, and sometimes require examples to fully convey the user's intent. We present a framework for regex synthesis in this setting where both natural language (NL) and examples are available. First, a semantic parser (either grammar-based or neural) maps the natural language description into an intermediate sketch, which is an incomplete regex containing holes to denote missing components. Then a program synthesizer searches over the regex space defined by the sketch and finds a regex that is consistent with the given string examples. Our semantic parser can be trained purely from weak supervision based on correctness of the synthesized regex, or it can leverage heuristically derived sketches. We evaluate on two prior datasets (Kushman and Barzilay 2013; Locascio et al. 2016) and a real-world dataset from Stack Overflow. Our system achieves state-of-the-art performance on the prior datasets and solves 57% of the real-world dataset, which existing neural systems completely fail on.1",
    "checked": true,
    "id": "1bb27a0180f0c5fdd66cf34864752dfb1d6d94d2",
    "semantic_title": "sketch-driven regular expression generation from natural language and examples",
    "citation_count": 26,
    "authors": [
      "Xi Ye",
      "Qiaochu Chen",
      "Xinyu Wang",
      "Isil Dillig",
      "Greg Durrett"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.45": {
    "title": "Consistent Transcription and Translation of Speech",
    "volume": "main",
    "abstract": "The conventional paradigm in speech translation starts with a speech recognition step to generate transcripts, followed by a translation step with the automatic transcripts as input. To address various shortcomings of this paradigm, recent work explores end-to-end trainable direct models that translate without transcribing. However, transcripts can be an indispensable output in practical applications, which often display transcripts alongside the translations to users. We make this common requirement explicit and explore the task of jointly transcribing and translating speech. Although high accuracy of transcript and translation are crucial, even highly accurate systems can suffer from inconsistencies between both outputs that degrade the user experience. We introduce a methodology to evaluate consistency and compare several modeling approaches, including the traditional cascaded approach and end-to-end models. We find that direct models are poorly suited to the joint transcription/translation task, but that end-to-end models that feature a coupled inference procedure are able to achieve strong consistency. We further introduce simple techniques for directly optimizing for consistency, and analyze the resulting trade-offs between consistency, transcription accuracy, and translation accuracy.1",
    "checked": true,
    "id": "041220d41128a7fd41855ff51476bdb005cd1499",
    "semantic_title": "consistent transcription and translation of speech",
    "citation_count": 18,
    "authors": [
      "Matthias Sperber",
      "Hendra Setiawan",
      "Christian Gollan",
      "Udhyakumar Nallasamy",
      "Matthias Paulik"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.46": {
    "title": "Synthesizing Parallel Data of User-Generated Texts with Zero-Shot Neural Machine Translation",
    "volume": "main",
    "abstract": "Neural machine translation (NMT) systems are usually trained on clean parallel data. They can perform very well for translating clean in-domain texts. However, as demonstrated by previous work, the translation quality significantly worsens when translating noisy texts, such as user-generated texts (UGT) from online social media. Given the lack of parallel data of UGT that can be used to train or adapt NMT systems, we synthesize parallel data of UGT, exploiting monolingual data of UGT through crosslingual language model pre-training and zero-shot NMT systems. This paper presents two different but complementary approaches: One alters given clean parallel data into UGT-like parallel data whereas the other generates translations from monolingual data of UGT. On the MTNT translation tasks, we show that our synthesized parallel data can lead to better NMT systems for UGT while making them more robust in translating texts from various domains and styles",
    "checked": true,
    "id": "c0242dd05016958e40aced52d0b9811d6834526f",
    "semantic_title": "synthesizing parallel data of user-generated texts with zero-shot neural machine translation",
    "citation_count": 6,
    "authors": [
      "Benjamin Marie",
      "Atsushi Fujita"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.47": {
    "title": "Multilingual Denoising Pre-training for Neural Machine Translation",
    "volume": "main",
    "abstract": "This paper demonstrates that multilingual denoising pre-training produces significant performance gains across a wide variety of machine translation (MT) tasks. We present mBART—a sequence-to-sequence denoising auto-encoder pre-trained on large-scale monolingual corpora in many languages using the BART objective (Lewis et al., 2019). mBART is the first method for pre-training a complete sequence-to-sequence model by denoising full texts in multiple languages, whereas previous approaches have focused only on the encoder, decoder, or reconstructing parts of the text. Pre-training a complete model allows it to be directly fine-tuned for supervised (both sentence-level and document-level) and unsupervised machine translation, with no task- specific modifications. We demonstrate that adding mBART initialization produces performance gains in all but the highest-resource settings, including up to 12 BLEU points for low resource MT and over 5 BLEU points for many document-level and unsupervised models. We also show that it enables transfer to language pairs with no bi-text or that were not in the pre-training corpus, and present extensive analysis of which factors contribute the most to effective pre-training.1",
    "checked": true,
    "id": "495da6f19baa09c6db3697d839e10432cdc25934",
    "semantic_title": "multilingual denoising pre-training for neural machine translation",
    "citation_count": 1785,
    "authors": [
      "Yinhan Liu",
      "Jiatao Gu",
      "Naman Goyal",
      "Xian Li",
      "Sergey Edunov",
      "Marjan Ghazvininejad",
      "Mike Lewis",
      "Luke Zettlemoyer"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.48": {
    "title": "oLMpics-On What Language Model Pre-training Captures",
    "volume": "main",
    "abstract": "Recent success of pre-trained language models (LMs) has spurred widespread interest in the language capabilities that they possess. However, efforts to understand whether LM representations are useful for symbolic reasoning tasks have been limited and scattered. In this work, we propose eight reasoning tasks, which conceptually require operations such as comparison, conjunction, and composition. A fundamental challenge is to understand whether the performance of a LM on a task should be attributed to the pre-trained representations or to the process of fine-tuning on the task data. To address this, we propose an evaluation protocol that includes both zero-shot evaluation (no fine-tuning), as well as comparing the learning curve of a fine-tuned LM to the learning curve of multiple controls, which paints a rich picture of the LM capabilities. Our main findings are that: (a) different LMs exhibit qualitatively different reasoning abilities, e.g., RoBERTa succeeds in reasoning tasks where BERT fails completely; (b) LMs do not reason in an abstract manner and are context-dependent, e.g., while RoBERTa can compare ages, it can do so only when the ages are in the typical range of human ages; (c) On half of our reasoning tasks all models fail completely. Our findings and infrastructure can help future work on designing new datasets, models, and objective functions for pre-training",
    "checked": true,
    "id": "5e0cffc51e8b64a8f11326f955fa4b4f1803e3be",
    "semantic_title": "olmpics-on what language model pre-training captures",
    "citation_count": 303,
    "authors": [
      "Alon Talmor",
      "Yanai Elazar",
      "Yoav Goldberg",
      "Jonathan Berant"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.49": {
    "title": "Interactive Text Ranking with Bayesian Optimization: A Case Study on Community QA and Summarization",
    "volume": "main",
    "abstract": "For many NLP applications, such as question answering and summarization, the goal is to select the best solution from a large space of candidates to meet a particular user's needs. To address the lack of user or task-specific training data, we propose an interactive text ranking approach that actively selects pairs of candidates, from which the user selects the best. Unlike previous strategies, which attempt to learn a ranking across the whole candidate space, our method uses Bayesian optimization to focus the user's labeling effort on high quality candidates and integrate prior knowledge to cope better with small data scenarios. We apply our method to community question answering (cQA) and extractive multidocument summarization, finding that it significantly outperforms existing interactive approaches. We also show that the ranking function learned by our method is an effective reward function for reinforcement learning, which improves the state of the art for interactive summarization",
    "checked": true,
    "id": "82e2c4c479bee622a0371c51b847fe3b911d8d9b",
    "semantic_title": "interactive text ranking with bayesian optimization: a case study on community qa and summarization",
    "citation_count": 10,
    "authors": [
      "Edwin Simpson",
      "Yang Gao",
      "Iryna Gurevych"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.50": {
    "title": "Syntactic Structure Distillation Pretraining for Bidirectional Encoders",
    "volume": "main",
    "abstract": "Textual representation learners trained on large amounts of data have achieved notable success on downstream tasks; intriguingly, they have also performed well on challenging tests of syntactic competence. Hence, it remains an open question whether scalable learners like BERT can become fully proficient in the syntax of natural language by virtue of data scale alone, or whether they still benefit from more explicit syntactic biases. To answer this question, we introduce a knowledge distillation strategy for injecting syntactic biases into BERT pretraining, by distilling the syntactically informative predictions of a hierarchical—albeit harder to scale—syntactic language model. Since BERT models masked words in bidirectional context, we propose to distill the approximate marginal distribution over words in context from the syntactic LM. Our approach reduces relative error by 2–21% on a diverse set of structured prediction tasks, although we obtain mixed results on the GLUE benchmark. Our findings demonstrate the benefits of syntactic biases, even for representation learners that exploit large amounts of data, and contribute to a better understanding of where syntactic biases are helpful in benchmarks of natural language understanding",
    "checked": true,
    "id": "0b46915313f95a0112564fdfd2baaa2bcf36565a",
    "semantic_title": "syntactic structure distillation pretraining for bidirectional encoders",
    "citation_count": 33,
    "authors": [
      "Adhiguna Kuncoro",
      "Lingpeng Kong",
      "Daniel Fried",
      "Dani Yogatama",
      "Laura Rimell",
      "Chris Dyer",
      "Phil Blunsom"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.51": {
    "title": "Best-First Beam Search",
    "volume": "main",
    "abstract": "Decoding for many NLP tasks requires an effective heuristic algorithm for approximating exact search because the problem of searching the full output space is often intractable, or impractical in many settings. The default algorithm for this job is beam search—a pruned version of breadth-first search. Quite surprisingly, beam search often returns better results than exact inference due to beneficial search bias for NLP tasks. In this work, we show that the standard implementation of beam search can be made up to 10x faster in practice. Our method assumes that the scoring function is monotonic in the sequence length, which allows us to safely prune hypotheses that cannot be in the final set of hypotheses early on. We devise effective monotonic approximations to popular nonmonontic scoring functions, including length normalization and mutual information decoding. Lastly, we propose a memory-reduced variant of best-first beam search, which has a similar beneficial search bias in terms of downstream performance, but runs in a fraction of the time",
    "checked": true,
    "id": "a6e6197fcbb5bbe7d332904f2624e7bf1687c024",
    "semantic_title": "best-first beam search",
    "citation_count": 71,
    "authors": [
      "Clara Meister",
      "Tim Vieira",
      "Ryan Cotterell"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.52": {
    "title": "Improving Dialog Evaluation with a Multi-reference Adversarial Dataset and Large Scale Pretraining",
    "volume": "main",
    "abstract": "There is an increasing focus on model-based dialog evaluation metrics such as ADEM, RUBER, and the more recent BERT-based metrics. These models aim to assign a high score to all relevant responses and a low score to all irrelevant responses. Ideally, such models should be trained using multiple relevant and irrelevant responses for any given context. However, no such data is publicly available, and hence existing models are usually trained using a single relevant response and multiple randomly selected responses from other contexts (random negatives). To allow for better training and robust evaluation of model-based metrics, we introduce the DailyDialog++ dataset, consisting of (i) five relevant responses for each context and (ii) five adversarially crafted irrelevant responses for each context. Using this dataset, we first show that even in the presence of multiple correct references, n-gram based metrics and embedding based metrics do not perform well at separating relevant responses from even random negatives. While model-based metrics perform better than n-gram and embedding based metrics on random negatives, their performance drops substantially when evaluated on adversarial examples. To check if large scale pretraining could help, we propose a new BERT-based evaluation metric called DEB, which is pretrained on 727M Reddit conversations and then finetuned on our dataset. DEB significantly outperforms existing models, showing better correlation with human judgments and better performance on random negatives (88.27% accuracy). However, its performance again drops substantially when evaluated on adversarial responses, thereby highlighting that even large-scale pretrained evaluation models are not robust to the adversarial examples in our dataset. The dataset1 and code2 are publicly available",
    "checked": true,
    "id": "a279efc0938433e5e81a085f1a614b5817d3435c",
    "semantic_title": "improving dialog evaluation with a multi-reference adversarial dataset and large scale pretraining",
    "citation_count": 68,
    "authors": [
      "Ananya B. Sai",
      "Akash Kumar Mohankumar",
      "Siddhartha Arora",
      "Mitesh M. Khapra"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.53": {
    "title": "Unsupervised Bitext Mining and Translation via Self-Trained Contextual Embeddings",
    "volume": "main",
    "abstract": "We describe an unsupervised method to create pseudo-parallel corpora for machine translation (MT) from unaligned text. We use multilingual BERT to create source and target sentence embeddings for nearest-neighbor search and adapt the model via self-training. We validate our technique by extracting parallel sentence pairs on the BUCC 2017 bitext mining task and observe up to a 24.5 point increase (absolute) in F1 scores over previous unsupervised methods. We then improve an XLM-based unsupervised neural MT system pre-trained on Wikipedia by supplementing it with pseudo-parallel text mined from the same corpus, boosting unsupervised translation performance by up to 3.5 BLEU on the WMT'14 French-English and WMT'16 German-English tasks and outperforming the previous state-of-the-art. Finally, we enrich the IWSLT'15 English-Vietnamese corpus with pseudo-parallel Wikipedia sentence pairs, yielding a 1.2 BLEU improvement on the low-resource MT task. We demonstrate that unsupervised bitext mining is an effective way of augmenting MT datasets and complements existing techniques like initializing with pre-trained contextual embeddings",
    "checked": true,
    "id": "172daf0763d0196763c9afcfec7661b520df4d21",
    "semantic_title": "unsupervised bitext mining and translation via self-trained contextual embeddings",
    "citation_count": 25,
    "authors": [
      "Phillip Keung",
      "Julian Salazar",
      "Yichao Lu",
      "Noah A. Smith"
    ]
  },
  "https://aclanthology.org/2020.tacl-1.54": {
    "title": "A Primer in BERTology: What We Know About How BERT Works",
    "volume": "main",
    "abstract": "Transformer-based models have pushed state of the art in many areas of NLP, but our understanding of what is behind their success is still limited. This paper is the first survey of over 150 studies of the popular BERT model. We review the current state of knowledge about how BERT works, what kind of information it learns and how it is represented, common modifications to its training objectives and architecture, the overparameterization issue, and approaches to compression. We then outline directions for future research",
    "checked": true,
    "id": "bd20069f5cac3e63083ecf6479abc1799db33ce0",
    "semantic_title": "a primer in bertology: what we know about how bert works",
    "citation_count": 1478,
    "authors": [
      "Anna Rogers",
      "Olga Kovaleva",
      "Anna Rumshisky"
    ]
  }
}