{
  "https://aclanthology.org/Q18-1001": {
    "title": "Whodunnit? Crime Drama as a Case for Natural Language Understanding",
    "volume": "main",
    "abstract": "In this paper we argue that crime drama exemplified in television programs such as CSI: Crime Scene Investigation is an ideal testbed for approximating real-world natural language understanding and the complex inferences associated with it. We propose to treat crime drama as a new inference task, capitalizing on the fact that each episode poses the same basic question (i.e., who committed the crime) and naturally provides the answer when the perpetrator is revealed. We develop a new dataset based on CSI episodes, formalize perpetrator identification as a sequence labeling problem, and develop an LSTM-based model which learns from multi-modal data. Experimental results show that an incremental inference strategy is key to making accurate guesses as well as learning from representations fusing textual, visual, and acoustic input",
    "checked": true,
    "id": "f6dd15b7e674755b01fe605efb42d03d920ebcde",
    "semantic_title": "whodunnit? crime drama as a case for natural language understanding",
    "citation_count": 27,
    "authors": [
      "Lea Frermann",
      "Shay B. Cohen",
      "Mirella Lapata"
    ]
  },
  "https://aclanthology.org/Q18-1002": {
    "title": "Multiple Instance Learning Networks for Fine-Grained Sentiment Analysis",
    "volume": "main",
    "abstract": "We consider the task of fine-grained sentiment analysis from the perspective of multiple instance learning (MIL). Our neural model is trained on document sentiment labels, and learns to predict the sentiment of text segments, i.e. sentences or elementary discourse units (EDUs), without segment-level supervision. We introduce an attention-based polarity scoring method for identifying positive and negative text snippets and a new dataset which we call SpoT (as shorthand for Segment-level POlariTy annotations) for evaluating MIL-style sentiment models like ours. Experimental results demonstrate superior performance against multiple baselines, whereas a judgement elicitation study shows that EDU-level opinion extraction produces more informative summaries than sentence-based alternatives",
    "checked": true,
    "id": "ab60cb9bb176aa01c1116b7487395137c6700c5d",
    "semantic_title": "multiple instance learning networks for fine-grained sentiment analysis",
    "citation_count": 129,
    "authors": [
      "Stefanos Angelidis",
      "Mirella Lapata"
    ]
  },
  "https://aclanthology.org/Q18-1003": {
    "title": "Joint Semantic Synthesis and Morphological Analysis of the Derived Word",
    "volume": "main",
    "abstract": "Much like sentences are composed of words, words themselves are composed of smaller units. For example, the English word questionably can be analyzed as question+able+ly. However, this structural decomposition of the word does not directly give us a semantic representation of the word's meaning. Since morphology obeys the principle of compositionality, the semantics of the word can be systematically derived from the meaning of its parts. In this work, we propose a novel probabilistic model of word formation that captures both the analysis of a word w into its constituent segments and the synthesis of the meaning of w from the meanings of those segments. Our model jointly learns to segment words into morphemes and compose distributional semantic vectors of those morphemes. We experiment with the model on English CELEX data and German DErivBase (Zeller et al., 2013) data. We show that jointly modeling semantics increases both segmentation accuracy and morpheme F1 by between 3% and 5%. Additionally, we investigate different models of vector composition, showing that recurrent neural networks yield an improvement over simple additive models. Finally, we study the degree to which the representations correspond to a linguist's notion of morphological productivity",
    "checked": true,
    "id": "38afef35de217bdce44e2d02f366ca42bedfb60e",
    "semantic_title": "joint semantic synthesis and morphological analysis of the derived word",
    "citation_count": 36,
    "authors": [
      "Ryan Cotterell",
      "Hinrich Schütze"
    ]
  },
  "https://aclanthology.org/Q18-1004": {
    "title": "Representation Learning for Grounded Spatial Reasoning",
    "volume": "main",
    "abstract": "The interpretation of spatial references is highly contextual, requiring joint inference over both language and the environment. We consider the task of spatial reasoning in a simulated environment, where an agent can act and receive rewards. The proposed model learns a representation of the world steered by instruction text. This design allows for precise alignment of local neighborhoods with corresponding verbalizations, while also handling global references in the instructions. We train our model with reinforcement learning using a variant of generalized value iteration. The model outperforms state-of-the-art approaches on several metrics, yielding a 45% reduction in goal localization error",
    "checked": true,
    "id": "878ad1aa6e7858d664c0269d60451c91f144e0b9",
    "semantic_title": "representation learning for grounded spatial reasoning",
    "citation_count": 73,
    "authors": [
      "Michael Janner",
      "Karthik Narasimhan",
      "Regina Barzilay"
    ]
  },
  "https://aclanthology.org/Q18-1005": {
    "title": "Learning Structured Text Representations",
    "volume": "main",
    "abstract": "In this paper, we focus on learning structure-aware document representations from data without recourse to a discourse parser or additional annotations. Drawing inspiration from recent efforts to empower neural networks with a structural bias (Cheng et al., 2016; Kim et al., 2017), we propose a model that can encode a document while automatically inducing rich structural dependencies. Specifically, we embed a differentiable non-projective parsing algorithm into a neural model and use attention mechanisms to incorporate the structural biases. Experimental evaluations across different tasks and datasets show that the proposed model achieves state-of-the-art results on document modeling tasks while inducing intermediate structures which are both interpretable and meaningful",
    "checked": true,
    "id": "29219d826ead654f2b863de6eceb69811850b7d4",
    "semantic_title": "learning structured text representations",
    "citation_count": 152,
    "authors": [
      "Yang Liu",
      "Mirella Lapata"
    ]
  },
  "https://aclanthology.org/Q18-1006": {
    "title": "Event Time Extraction with a Decision Tree of Neural Classifiers",
    "volume": "main",
    "abstract": "Extracting the information from text when an event happened is challenging. Documents do not only report on current events, but also on past events as well as on future events. Often, the relevant time information for an event is scattered across the document. In this paper we present a novel method to automatically anchor events in time. To our knowledge it is the first approach that takes temporal information from the complete document into account. We created a decision tree that applies neural network based classifiers at its nodes. We use this tree to incrementally infer, in a stepwise manner, at which time frame an event happened. We evaluate the approach on the TimeBank-EventTime Corpus (Reimers et al., 2016) achieving an accuracy of 42.0% compared to an inter-annotator agreement (IAA) of 56.7%. For events that span over a single day we observe an accuracy improvement of 33.1 points compared to the state-of-the-art CAEVO system (Chambers et al., 2014). Without retraining, we apply this model to the SemEval-2015 Task 4 on automatic timeline generation and achieve an improvement of 4.01 points F1-score compared to the state-of-the-art. Our code is publically available",
    "checked": true,
    "id": "a6436d09a637c44552673b9b2d51c5434f6650ca",
    "semantic_title": "event time extraction with a decision tree of neural classifiers",
    "citation_count": 19,
    "authors": [
      "Nils Reimers",
      "Nazanin Dehghani",
      "Iryna Gurevych"
    ]
  },
  "https://aclanthology.org/Q18-1007": {
    "title": "Towards Evaluating Narrative Quality In Student Writing",
    "volume": "main",
    "abstract": "This work lays the foundation for automated assessments of narrative quality in student writing. We first manually score essays for narrative-relevant traits and sub-traits, and measure inter-annotator agreement. We then explore linguistic features that are indicative of good narrative writing and use them to build an automated scoring system. Experiments show that our features are more effective in scoring specific aspects of narrative quality than a state-of-the-art feature set",
    "checked": true,
    "id": "0c4c98584158cec208d20ee0271b7463dd229e16",
    "semantic_title": "towards evaluating narrative quality in student writing",
    "citation_count": 32,
    "authors": [
      "Swapna Somasundaran",
      "Michael Flor",
      "Martin Chodorow",
      "Hillary Molloy",
      "Binod Gyawali",
      "Laura McCulla"
    ]
  },
  "https://aclanthology.org/Q18-1008": {
    "title": "Evaluating the Stability of Embedding-based Word Similarities",
    "volume": "main",
    "abstract": "Word embeddings are increasingly being used as a tool to study word associations in specific corpora. However, it is unclear whether such embeddings reflect enduring properties of language or if they are sensitive to inconsequential variations in the source documents. We find that nearest-neighbor distances are highly sensitive to small changes in the training corpus for a variety of algorithms. For all methods, including specific documents in the training set can result in substantial variations. We show that these effects are more prominent for smaller training corpora. We recommend that users never rely on single embedding models for distance calculations, but rather average over multiple bootstrap samples, especially for small corpora",
    "checked": true,
    "id": "c5ea28d0292dc6e9cd12e1ddf6a07aac63e6dc65",
    "semantic_title": "evaluating the stability of embedding-based word similarities",
    "citation_count": 175,
    "authors": [
      "Maria Antoniak",
      "David Mimno"
    ]
  },
  "https://aclanthology.org/Q18-1009": {
    "title": "Conversation Modeling on Reddit Using a Graph-Structured LSTM",
    "volume": "main",
    "abstract": "This paper presents a novel approach for modeling threaded discussions on social media using a graph-structured bidirectional LSTM (long-short term memory) which represents both hierarchical and temporal conversation structure. In experiments with a task of predicting popularity of comments in Reddit discussions, the proposed model outperforms a node-independent architecture for different sets of input features. Analyses show a benefit to the model over the full course of the discussion, improving detection in both early and late stages. Further, the use of language cues with the bidirectional tree state updates helps with identifying controversial comments",
    "checked": true,
    "id": "0a5c8afbd905e286bf7a3abb09b71cb765660d25",
    "semantic_title": "conversation modeling on reddit using a graph-structured lstm",
    "citation_count": 88,
    "authors": [
      "Victoria Zayats",
      "Mari Ostendorf"
    ]
  },
  "https://aclanthology.org/Q18-1010": {
    "title": "Learning Representations Specialized in Spatial Knowledge: Leveraging Language and Vision",
    "volume": "main",
    "abstract": "Spatial understanding is crucial in many real-world problems, yet little progress has been made towards building representations that capture spatial knowledge. Here, we move one step forward in this direction and learn such representations by leveraging a task consisting in predicting continuous 2D spatial arrangements of objects given object-relationship-object instances (e.g., \"cat under chair\") and a simple neural network model that learns the task from annotated images. We show that the model succeeds in this task and, furthermore, that it is capable of predicting correct spatial arrangements for unseen objects if either CNN features or word embeddings of the objects are provided. The differences between visual and linguistic features are discussed. Next, to evaluate the spatial representations learned in the previous task, we introduce a task and a dataset consisting in a set of crowdsourced human ratings of spatial similarity for object pairs. We find that both CNN (convolutional neural network) features and word embeddings predict human judgments of similarity well and that these vectors can be further specialized in spatial knowledge if we update them when training the model that predicts spatial arrangements of objects. Overall, this paper paves the way towards building distributed spatial representations, contributing to the understanding of spatial expressions in language",
    "checked": true,
    "id": "70671018d4597b6d2d0c99b38b1f1a3f1271eaec",
    "semantic_title": "learning representations specialized in spatial knowledge: leveraging language and vision",
    "citation_count": 10,
    "authors": [
      "Guillem Collell",
      "Marie-Francine Moens"
    ]
  },
  "https://aclanthology.org/Q18-1011": {
    "title": "Modeling Past and Future for Neural Machine Translation",
    "volume": "main",
    "abstract": "Existing neural machine translation systems do not explicitly model what has been translated and what has not during the decoding phase. To address this problem, we propose a novel mechanism that separates the source information into two parts: translated Past contents and untranslated Future contents, which are modeled by two additional recurrent layers. The Past and Future contents are fed to both the attention model and the decoder states, which provides Neural Machine Translation (NMT) systems with the knowledge of translated and untranslated contents. Experimental results show that the proposed approach significantly improves the performance in Chinese-English, German-English, and English-German translation tasks. Specifically, the proposed model outperforms the conventional coverage model in terms of both the translation quality and the alignment error rate",
    "checked": true,
    "id": "2b5c3e34c64b068e7de280abc87b626735ca01b7",
    "semantic_title": "modeling past and future for neural machine translation",
    "citation_count": 48,
    "authors": [
      "Zaixiang Zheng",
      "Hao Zhou",
      "Shujian Huang",
      "Lili Mou",
      "Xinyu Dai",
      "Jiajun Chen",
      "Zhaopeng Tu"
    ]
  },
  "https://aclanthology.org/Q18-1012": {
    "title": "Mapping to Declarative Knowledge for Word Problem Solving",
    "volume": "main",
    "abstract": "Math word problems form a natural abstraction to a range of quantitative reasoning problems, such as understanding financial news, sports results, and casualties of war. Solving such problems requires the understanding of several mathematical concepts such as dimensional analysis, subset relationships, etc. In this paper, we develop declarative rules which govern the translation of natural language description of these concepts to math expressions. We then present a framework for incorporating such declarative knowledge into word problem solving. Our method learns to map arithmetic word problem text to math expressions, by learning to select the relevant declarative knowledge for each operation of the solution expression. This provides a way to handle multiple concepts in the same problem while, at the same time, supporting interpretability of the answer expression. Our method models the mapping to declarative knowledge as a latent variable, thus removing the need for expensive annotations. Experimental evaluation suggests that our domain knowledge based solver outperforms all other systems, and that it generalizes better in the realistic case where the training data it is exposed to is biased in a different way than the test data",
    "checked": true,
    "id": "83cc0d20275fdc3a97cceacdc41fbb19953fa901",
    "semantic_title": "mapping to declarative knowledge for word problem solving",
    "citation_count": 104,
    "authors": [
      "Subhro Roy",
      "Dan Roth"
    ]
  },
  "https://aclanthology.org/Q18-1013": {
    "title": "Video Captioning with Multi-Faceted Attention",
    "volume": "main",
    "abstract": "Video captioning has attracted an increasing amount of interest, due in part to its potential for improved accessibility and information retrieval. While existing methods rely on different kinds of visual features and model architectures, they do not make full use of pertinent semantic cues. We present a unified and extensible framework to jointly leverage multiple sorts of visual features and semantic attributes. Our novel architecture builds on LSTMs with two multi-faceted attention layers. These first learn to automatically select the most salient visual features or semantic attributes, and then yield overall representations for the input and output of the sentence generation component via custom feature scaling operations. Experimental results on the challenging MSVD and MSR-VTT datasets show that our framework outperforms previous work and performs robustly even in the presence of added noise to the features and attributes",
    "checked": true,
    "id": "5a732016c3f74dc7d78899bf33cf25df03ef46b4",
    "semantic_title": "video captioning with multi-faceted attention",
    "citation_count": 88,
    "authors": [
      "Xiang Long",
      "Chuang Gan",
      "Gerard de Melo"
    ]
  },
  "https://aclanthology.org/Q18-1014": {
    "title": "Unsupervised Word Mapping Using Structural Similarities in Monolingual Embeddings",
    "volume": "main",
    "abstract": "Most existing methods for automatic bilingual dictionary induction rely on prior alignments between the source and target languages, such as parallel corpora or seed dictionaries. For many language pairs, such supervised alignments are not readily available. We propose an unsupervised approach for learning a bilingual dictionary for a pair of languages given their independently-learned monolingual word embeddings. The proposed method exploits local and global structures in monolingual vector spaces to align them such that similar words are mapped to each other. We show empirically that the performance of bilingual correspondents that are learned using our proposed unsupervised method is comparable to that of using supervised bilingual correspondents from a seed dictionary",
    "checked": true,
    "id": "4b528868ccf992ebc5cdb5e2a7fec60b225a58ea",
    "semantic_title": "unsupervised word mapping using structural similarities in monolingual embeddings",
    "citation_count": 29,
    "authors": [
      "Hanan Aldarmaki",
      "Mahesh Mohan",
      "Mona Diab"
    ]
  },
  "https://aclanthology.org/Q18-1015": {
    "title": "Knowledge Completion for Generics using Guided Tensor Factorization",
    "volume": "main",
    "abstract": "Given a knowledge base or KB containing (noisy) facts about common nouns or generics, such as \"all trees produce oxygen\" or \"some animals live in forests\", we consider the problem of inferring additional such facts at a precision similar to that of the starting KB. Such KBs capture general knowledge about the world, and are crucial for various applications such as question answering. Different from commonly studied named entity KBs such as Freebase, generics KBs involve quantification, have more complex underlying regularities, tend to be more incomplete, and violate the commonly used locally closed world assumption (LCWA). We show that existing KB completion methods struggle with this new task, and present the first approach that is successful. Our results demonstrate that external information, such as relation schemas and entity taxonomies, if used appropriately, can be a surprisingly powerful tool in this setting. First, our simple yet effective knowledge guided tensor factorization approach achieves state-of-the-art results on two generics KBs (80% precise) for science, doubling their size at 74%–86% precision. Second, our novel taxonomy guided, submodular, active learning method for collecting annotations about rare entities (e.g., oriole, a bird) is 6x more effective at inferring further new facts about them than multiple active learning baselines",
    "checked": true,
    "id": "ca2f1875b042d839761e454c3dfb78ea04165792",
    "semantic_title": "knowledge completion for generics using guided tensor factorization",
    "citation_count": 13,
    "authors": [
      "Hanie Sedghi",
      "Ashish Sabharwal"
    ]
  },
  "https://aclanthology.org/Q18-1016": {
    "title": "Unsupervised Grammar Induction with Depth-bounded PCFG",
    "volume": "main",
    "abstract": "There has been recent interest in applying cognitively- or empirically-motivated bounds on recursion depth to limit the search space of grammar induction models (Ponvert et al., 2011; Noji and Johnson, 2016; Shain et al., 2016). This work extends this depth-bounding approach to probabilistic context-free grammar induction (DB-PCFG), which has a smaller parameter space than hierarchical sequence models, and therefore more fully exploits the space reductions of depth-bounding. Results for this model on grammar acquisition from transcribed child-directed speech and newswire text exceed or are competitive with those of other models when evaluated on parse accuracy. Moreover, grammars acquired from this model demonstrate a consistent use of category labels, something which has not been demonstrated by other acquisition models",
    "checked": true,
    "id": "676e9f13ddc89e8feb838bdec7ba04738dd53f41",
    "semantic_title": "unsupervised grammar induction with depth-bounded pcfg",
    "citation_count": 28,
    "authors": [
      "Lifeng Jin",
      "Finale Doshi-Velez",
      "Timothy Miller",
      "William Schuler",
      "Lane Schwartz"
    ]
  },
  "https://aclanthology.org/Q18-1017": {
    "title": "Scheduled Multi-Task Learning: From Syntax to Translation",
    "volume": "main",
    "abstract": "Neural encoder-decoder models of machine translation have achieved impressive results, while learning linguistic knowledge of both the source and target languages in an implicit end-to-end manner. We propose a framework in which our model begins learning syntax and translation interleaved, gradually putting more focus on translation. Using this approach, we achieve considerable improvements in terms of BLEU score on relatively large parallel corpus (WMT14 English to German) and a low-resource (WIT German to English) setup",
    "checked": true,
    "id": "5054f6080e232c4ef456e2888950c211a6d0d268",
    "semantic_title": "scheduled multi-task learning: from syntax to translation",
    "citation_count": 82,
    "authors": [
      "Eliyahu Kiperwasser",
      "Miguel Ballesteros"
    ]
  },
  "https://aclanthology.org/Q18-1018": {
    "title": "Questionable Answers in Question Answering Research: Reproducibility and Variability of Published Results",
    "volume": "main",
    "abstract": "Based on theoretical reasoning it has been suggested that the reliability of findings published in the scientific literature decreases with the popularity of a research field\" (Pfeiffer and Hoffmann, 2009). As we know, deep learning is very popular and the ability to reproduce results is an important part of science. There is growing concern within the deep learning community about the reproducibility of results that are presented. In this paper we present a number of controllable, yet unreported, effects that can substantially change the effectiveness of a sample model, and thusly the reproducibility of those results. Through these environmental effects we show that the commonly held belief that distribution of source code is all that is needed for reproducibility is not enough. Source code without a reproducible environment does not mean anything at all. In addition the range of results produced from these effects can be larger than the majority of incremental improvement reported",
    "checked": true,
    "id": "8c0548331e02c2ead48d6c0380f9a80471ea5d80",
    "semantic_title": "questionable answers in question answering research: reproducibility and variability of published results",
    "citation_count": 74,
    "authors": [
      "Matt Crane"
    ]
  },
  "https://aclanthology.org/Q18-1019": {
    "title": "Do latent tree learning models identify meaningful structure in sentences?",
    "volume": "main",
    "abstract": "Recent work on the problem of latent tree learning has made it possible to train neural networks that learn to both parse a sentence and use the resulting parse to interpret the sentence, all without exposure to ground-truth parse trees at training time. Surprisingly, these models often perform better at sentence understanding tasks than models that use parse trees from conventional parsers. This paper aims to investigate what these latent tree learning models learn. We replicate two such models in a shared codebase and find that (i) only one of these models outperforms conventional tree-structured models on sentence classification, (ii) its parsing strategies are not especially consistent across random restarts, (iii) the parses it produces tend to be shallower than standard Penn Treebank (PTB) parses, and (iv) they do not resemble those of PTB or any other semantic or syntactic formalism that the authors are aware of",
    "checked": true,
    "id": "8f46c21fef31a4cdf7b1808e67171466a9317882",
    "semantic_title": "do latent tree learning models identify meaningful structure in sentences?",
    "citation_count": 121,
    "authors": [
      "Adina Williams",
      "Andrew Drozdov",
      "Samuel R. Bowman"
    ]
  },
  "https://aclanthology.org/Q18-1020": {
    "title": "Bootstrap Domain-Specific Sentiment Classifiers from Unlabeled Corpora",
    "volume": "main",
    "abstract": "There is often the need to perform sentiment classification in a particular domain where no labeled document is available. Although we could make use of a general-purpose off-the-shelf sentiment classifier or a pre-built one for a different domain, the effectiveness would be inferior. In this paper, we explore the possibility of building domain-specific sentiment classifiers with unlabeled documents only. Our investigation indicates that in the word embeddings learned from the unlabeled corpus of a given domain, the distributed word representations (vectors) for opposite sentiments form distinct clusters, though those clusters are not transferable across domains. Exploiting such a clustering structure, we are able to utilize machine learning algorithms to induce a quality domain-specific sentiment lexicon from just a few typical sentiment words (\"seeds\"). An important finding is that simple linear model based supervised learning algorithms (such as linear SVM) can actually work better than more sophisticated semi-supervised/transductive learning algorithms which represent the state-of-the-art technique for sentiment lexicon induction. The induced lexicon could be applied directly in a lexicon-based method for sentiment classification, but a higher performance could be achieved through a two-phase bootstrapping method which uses the induced lexicon to assign positive/negative sentiment scores to unlabeled documents first, a nd t hen u ses those documents found to have clear sentiment signals as pseudo-labeled examples to train a document sentiment classifier v ia supervised learning algorithms (such as LSTM). On several benchmark datasets for document sentiment classification, our end-to-end pipelined approach which is overall unsupervised (except for a tiny set of seed words) outperforms existing unsupervised approaches and achieves an accuracy comparable to that of fully supervised approaches",
    "checked": true,
    "id": "b3883c93f89da025db30ba2cf9b3e115398364ac",
    "semantic_title": "bootstrap domain-specific sentiment classifiers from unlabeled corpora",
    "citation_count": 13,
    "authors": [
      "Andrius Mudinas",
      "Dell Zhang",
      "Mark Levene"
    ]
  },
  "https://aclanthology.org/Q18-1021": {
    "title": "Constructing Datasets for Multi-hop Reading Comprehension Across Documents",
    "volume": "main",
    "abstract": "Most Reading Comprehension methods limit themselves to queries which can be answered using a single sentence, paragraph, or document. Enabling models to combine disjoint pieces of textual evidence would extend the scope of machine comprehension methods, but currently no resources exist to train and test this capability. We propose a novel task to encourage the development of models for text understanding across multiple documents and to investigate the limits of existing methods. In our task, a model learns to seek and combine evidence — effectively performing multihop, alias multi-step, inference. We devise a methodology to produce datasets for this task, given a collection of query-answer pairs and thematically linked documents. Two datasets from different domains are induced, and we identify potential pitfalls and devise circumvention strategies. We evaluate two previously proposed competitive models and find that one can integrate information across documents. However, both models struggle to select relevant information; and providing documents guaranteed to be relevant greatly improves their performance. While the models outperform several strong baselines, their best accuracy reaches 54.5% on an annotated test set, compared to human performance at 85.0%, leaving ample room for improvement",
    "checked": true,
    "id": "7d5cf22c70484fe217936c66741fb73b2a278bde",
    "semantic_title": "constructing datasets for multi-hop reading comprehension across documents",
    "citation_count": 515,
    "authors": [
      "Johannes Welbl",
      "Pontus Stenetorp",
      "Sebastian Riedel"
    ]
  },
  "https://aclanthology.org/Q18-1022": {
    "title": "Leveraging Orthographic Similarity for Multilingual Neural Transliteration",
    "volume": "main",
    "abstract": "We address the task of joint training of transliteration models for multiple language pairs (multilingual transliteration). This is an instance of multitask learning, where individual tasks (language pairs) benefit from sharing knowledge with related tasks. We focus on transliteration involving related tasks i.e., languages sharing writing systems and phonetic properties (orthographically similar languages). We propose a modified neural encoder-decoder model that maximizes parameter sharing across language pairs in order to effectively leverage orthographic similarity. We show that multilingual transliteration significantly outperforms bilingual transliteration in different scenarios (average increase of 58% across a variety of languages we experimented with). We also show that multilingual transliteration models can generalize well to languages/language pairs not encountered during training and hence perform well on the zeroshot transliteration task. We show that further improvements can be achieved by using phonetic feature input",
    "checked": true,
    "id": "69c4e3bbc2970a42504a55df824836032c86233d",
    "semantic_title": "leveraging orthographic similarity for multilingual neural transliteration",
    "citation_count": 30,
    "authors": [
      "Anoop Kunchukuttan",
      "Mitesh Khapra",
      "Gurneet Singh",
      "Pushpak Bhattacharyya"
    ]
  },
  "https://aclanthology.org/Q18-1023": {
    "title": "The NarrativeQA Reading Comprehension Challenge",
    "volume": "main",
    "abstract": "Reading comprehension (RC)—in contrast to information retrieval—requires integrating information and reasoning about events, entities, and their relations across a full document. Question answering is conventionally used to assess RC ability, in both artificial agents and children learning to read. However, existing RC datasets and tasks are dominated by questions that can be solved by selecting answers using superficial information (e.g., local context similarity or global term frequency); they thus fail to test for the essential integrative aspect of RC. To encourage progress on deeper comprehension of language, we present a new dataset and set of tasks in which the reader must answer questions about stories by reading entire books or movie scripts. These tasks are designed so that successfully answering their questions requires understanding the underlying narrative rather than relying on shallow pattern matching or salience. We show that although humans solve the tasks easily, standard RC models struggle on the tasks presented here. We provide an analysis of the dataset and the challenges it presents",
    "checked": true,
    "id": "d91043f0d48b9b2c8ff7ee321abb8fd7efafff7a",
    "semantic_title": "the narrativeqa reading comprehension challenge",
    "citation_count": 817,
    "authors": [
      "Tomáš Kočiský",
      "Jonathan Schwarz",
      "Phil Blunsom",
      "Chris Dyer",
      "Karl Moritz Hermann",
      "Gábor Melis",
      "Edward Grefenstette"
    ]
  },
  "https://aclanthology.org/Q18-1024": {
    "title": "Native Language Cognate Effects on Second Language Lexical Choice",
    "volume": "main",
    "abstract": "We present a computational analysis of cognate effects on the spontaneous linguistic productions of advanced non-native speakers. Introducing a large corpus of highly competent non-native English speakers, and using a set of carefully selected lexical items, we show that the lexical choices of non-natives are affected by cognates in their native language. This effect is so powerful that we are able to reconstruct the phylogenetic language tree of the Indo-European language family solely from the frequencies of specific lexical items in the English of authors with various native languages. We quantitatively analyze non-native lexical choice, highlighting cognate facilitation as one of the important phenomena shaping the language of non-native speakers",
    "checked": true,
    "id": "dc894c67f7d54641dca22c54e2ec79ba521a8c45",
    "semantic_title": "native language cognate effects on second language lexical choice",
    "citation_count": 40,
    "authors": [
      "Ella Rabinovich",
      "Yulia Tsvetkov",
      "Shuly Wintner"
    ]
  },
  "https://aclanthology.org/Q18-1025": {
    "title": "From Characters to Time Intervals: New Paradigms for Evaluation and Neural Parsing of Time Normalizations",
    "volume": "main",
    "abstract": "This paper presents the first model for time normalization trained on the SCATE corpus. In the SCATE schema, time expressions are annotated as a semantic composition of time entities. This novel schema favors machine learning approaches, as it can be viewed as a semantic parsing task. In this work, we propose a character level multi-output neural network that outperforms previous state-of-the-art built on the TimeML schema. To compare predictions of systems that follow both SCATE and TimeML, we present a new scoring metric for time intervals. We also apply this new metric to carry out a comparative analysis of the annotations of both schemes in the same corpus",
    "checked": true,
    "id": "cf10f4696ad89f894d332ba3f064b99484127dee",
    "semantic_title": "from characters to time intervals: new paradigms for evaluation and neural parsing of time normalizations",
    "citation_count": 30,
    "authors": [
      "Egoitz Laparra",
      "Dongfang Xu",
      "Steven Bethard"
    ]
  },
  "https://aclanthology.org/Q18-1026": {
    "title": "Finding Convincing Arguments Using Scalable Bayesian Preference Learning",
    "volume": "main",
    "abstract": "We introduce a scalable Bayesian preference learning method for identifying convincing arguments in the absence of gold-standard ratings or rankings. In contrast to previous work, we avoid the need for separate methods to perform quality control on training data, predict rankings and perform pairwise classification. Bayesian approaches are an effective solution when faced with sparse or noisy training data, but have not previously been used to identify convincing arguments. One issue is scalability, which we address by developing a stochastic variational inference method for Gaussian process (GP) preference learning. We show how our method can be applied to predict argument convincingness from crowdsourced data, outperforming the previous state-of-the-art, particularly when trained with small amounts of unreliable data. We demonstrate how the Bayesian approach enables more effective active learning, thereby reducing the amount of data required to identify convincing arguments for new users and domains. While word embeddings are principally used with neural networks, our results show that word embeddings in combination with linguistic features also benefit GPs when predicting argument convincingness",
    "checked": true,
    "id": "4cc28c9d282c6ed95dc8e186a8f39c10590b1507",
    "semantic_title": "finding convincing arguments using scalable bayesian preference learning",
    "citation_count": 53,
    "authors": [
      "Edwin Simpson",
      "Iryna Gurevych"
    ]
  },
  "https://aclanthology.org/Q18-1027": {
    "title": "Polite Dialogue Generation Without Parallel Data",
    "volume": "main",
    "abstract": "Stylistic dialogue response generation, with valuable applications in personality-based conversational agents, is a challenging task because the response needs to be fluent, contextually-relevant, as well as paralinguistically accurate. Moreover, parallel datasets for regular-to-stylistic pairs are usually unavailable. We present three weakly-supervised models that can generate diverse, polite (or rude) dialogue responses without parallel data. Our late fusion model (Fusion) merges the decoder of an encoder-attention-decoder dialogue model with a language model trained on stand-alone polite utterances. Our label-finetuning (LFT) model prepends to each source sequence a politeness-score scaled label (predicted by our state-of-the-art politeness classifier) during training, and at test time is able to generate polite, neutral, and rude responses by simply scaling the label embedding by the corresponding score. Our reinforcement learning model (Polite-RL) encourages politeness generation by assigning rewards proportional to the politeness classifier score of the sampled response. We also present two retrievalbased, polite dialogue model baselines. Human evaluation validates that while the Fusion and the retrieval-based models achieve politeness with poorer context-relevance, the LFT and Polite-RL models can produce significantly more polite responses without sacrificing dialogue quality",
    "checked": true,
    "id": "f1cba8a5a73c8151c2f5cb6edd5bc6a7c03e80fa",
    "semantic_title": "polite dialogue generation without parallel data",
    "citation_count": 174,
    "authors": [
      "Tong Niu",
      "Mohit Bansal"
    ]
  },
  "https://aclanthology.org/Q18-1028": {
    "title": "Measuring the Evolution of a Scientific Field through Citation Frames",
    "volume": "main",
    "abstract": "Citations have long been used to characterize the state of a scientific field and to identify influential works. However, writers use citations for different purposes, and this varied purpose influences uptake by future scholars. Unfortunately, our understanding of how scholars use and frame citations has been limited to small-scale manual citation analysis of individual papers. We perform the largest behavioral study of citations to date, analyzing how scientific works frame their contributions through different types of citations and how this framing affects the field as a whole. We introduce a new dataset of nearly 2,000 citations annotated for their function, and use it to develop a state-of-the-art classifier and label the papers of an entire field: Natural Language Processing. We then show how differences in framing affect scientific uptake and reveal the evolution of the publication venues and the field as a whole. We demonstrate that authors are sensitive to discourse structure and publication venue when citing, and that how a paper frames its work through citations is predictive of the citation count it will receive. Finally, we use changes in citation framing to show that the field of NLP is undergoing a significant increase in consensus",
    "checked": true,
    "id": "16be95fd3f9b635e9ede5812cc223deebf0142bc",
    "semantic_title": "measuring the evolution of a scientific field through citation frames",
    "citation_count": 265,
    "authors": [
      "David Jurgens",
      "Srijan Kumar",
      "Raine Hoover",
      "Dan McFarland",
      "Dan Jurafsky"
    ]
  },
  "https://aclanthology.org/Q18-1029": {
    "title": "Learning to Remember Translation History with a Continuous Cache",
    "volume": "main",
    "abstract": "Existing neural machine translation (NMT) models generally translate sentences in isolation, missing the opportunity to take advantage of document-level information. In this work, we propose to augment NMT models with a very light-weight cache-like memory network, which stores recent hidden representations as translation history. The probability distribution over generated words is updated online depending on the translation history retrieved from the memory, endowing NMT models with the capability to dynamically adapt over time. Experiments on multiple domains with different topics and styles show the effectiveness of the proposed approach with negligible impact on the computational cost",
    "checked": true,
    "id": "ae28c9932e7d16d6b2a25aa14532f9fd0138ba3a",
    "semantic_title": "learning to remember translation history with a continuous cache",
    "citation_count": 182,
    "authors": [
      "Zhaopeng Tu",
      "Yang Liu",
      "Shuming Shi",
      "Tong Zhang"
    ]
  },
  "https://aclanthology.org/Q18-1030": {
    "title": "Universal Word Segmentation: Implementation and Interpretation",
    "volume": "main",
    "abstract": "Word segmentation is a low-level NLP task that is non-trivial for a considerable number of languages. In this paper, we present a sequence tagging framework and apply it to word segmentation for a wide range of languages with different writing systems and typological characteristics. Additionally, we investigate the correlations between various typological factors and word segmentation accuracy. The experimental results indicate that segmentation accuracy is positively related to word boundary markers and negatively to the number of unique non-segmental terms. Based on the analysis, we design a small set of language-specific settings and extensively evaluate the segmentation system on the Universal Dependencies datasets. Our model obtains state-of-the-art accuracies on all the UD languages. It performs substantially better on languages that are non-trivial to segment, such as Chinese, Japanese, Arabic and Hebrew, when compared to previous work",
    "checked": true,
    "id": "2e638ac785703b7332393e5f2d8064b03a3fccf8",
    "semantic_title": "universal word segmentation: implementation and interpretation",
    "citation_count": 42,
    "authors": [
      "Yan Shao",
      "Christian Hardmeier",
      "Joakim Nivre"
    ]
  },
  "https://aclanthology.org/Q18-1031": {
    "title": "Generating Sentences by Editing Prototypes",
    "volume": "main",
    "abstract": "We propose a new generative language model for sentences that first samples a prototype sentence from the training corpus and then edits it into a new sentence. Compared to traditional language models that generate from scratch either left-to-right or by first sampling a latent sentence vector, our prototype-then-edit model improves perplexity on language modeling and generates higher quality outputs according to human evaluation. Furthermore, the model gives rise to a latent edit vector that captures interpretable semantics such as sentence similarity and sentence-level analogies",
    "checked": true,
    "id": "f4faa5a838afb1d6d15b77d2c122818e4b6d642b",
    "semantic_title": "generating sentences by editing prototypes",
    "citation_count": 317,
    "authors": [
      "Kelvin Guu",
      "Tatsunori B. Hashimoto",
      "Yonatan Oren",
      "Percy Liang"
    ]
  },
  "https://aclanthology.org/Q18-1032": {
    "title": "Language Modeling for Morphologically Rich Languages: Character-Aware Modeling for Word-Level Prediction",
    "volume": "main",
    "abstract": "Neural architectures are prominent in the construction of language models (LMs). However, word-level prediction is typically agnostic of subword-level information (characters and character sequences) and operates over a closed vocabulary, consisting of a limited word set. Indeed, while subword-aware models boost performance across a variety of NLP tasks, previous work did not evaluate the ability of these models to assist next-word prediction in language modeling tasks. Such subword-level informed models should be particularly effective for morphologically-rich languages (MRLs) that exhibit high type-to-token ratios. In this work, we present a large-scale LM study on 50 typologically diverse languages covering a wide variety of morphological systems, and offer new LM benchmarks to the community, while considering subword-level information. The main technical contribution of our work is a novel method for injecting subword-level information into semantic word vectors, integrated into the neural language modeling training, to facilitate word-level prediction. We conduct experiments in the LM setting where the number of infrequent words is large, and demonstrate strong perplexity gains across our 50 languages, especially for morphologically-rich languages. Our code and data sets are publicly available",
    "checked": true,
    "id": "4dd9d67a0259eef54ca32770db24fab5e42d362a",
    "semantic_title": "language modeling for morphologically rich languages: character-aware modeling for word-level prediction",
    "citation_count": 51,
    "authors": [
      "Daniela Gerz",
      "Ivan Vulić",
      "Edoardo Ponti",
      "Jason Naradowsky",
      "Roi Reichart",
      "Anna Korhonen"
    ]
  },
  "https://aclanthology.org/Q18-1033": {
    "title": "Detecting Institutional Dialog Acts in Police Traffic Stops",
    "volume": "main",
    "abstract": "We apply computational dialog methods to police body-worn camera footage to model conversations between police officers and community members in traffic stops. Relying on the theory of institutional talk, we develop a labeling scheme for police speech during traffic stops, and a tagger to detect institutional dialog acts (Reasons, Searches, Offering Help) from transcribed text at the turn (78% F-score) and stop (89% F-score) level. We then develop speech recognition and segmentation algorithms to detect these acts at the stop level from raw camera audio (81% F-score, with even higher accuracy for crucial acts like conveying the reason for the stop). We demonstrate that the dialog structures produced by our tagger could reveal whether officers follow law enforcement norms like introducing themselves, explaining the reason for the stop, and asking permission for searches. This work may therefore inform and aid efforts to ensure the procedural justice of police-community interactions",
    "checked": true,
    "id": "b9b5037585a4237cf90935351ec805a54868e77d",
    "semantic_title": "detecting institutional dialog acts in police traffic stops",
    "citation_count": 15,
    "authors": [
      "Vinodkumar Prabhakaran",
      "Camilla Griffiths",
      "Hang Su",
      "Prateek Verma",
      "Nelson Morgan",
      "Jennifer L. Eberhardt",
      "Dan Jurafsky"
    ]
  },
  "https://aclanthology.org/Q18-1034": {
    "title": "Linear Algebraic Structure of Word Senses, with Applications to Polysemy",
    "volume": "main",
    "abstract": "Word embeddings are ubiquitous in NLP and information retrieval, but it is unclear what they represent when the word is polysemous. Here it is shown that multiple word senses reside in linear superposition within the word embedding and simple sparse coding can recover vectors that approximately capture the senses. The success of our approach, which applies to several embedding methods, is mathematically explained using a variant of the random walk on discourses model (Arora et al., 2016). A novel aspect of our technique is that each extracted word sense is accompanied by one of about 2000 \"discourse atoms\" that gives a succinct description of which other words co-occur with that word sense. Discourse atoms can be of independent interest, and make the method potentially more useful. Empirical tests are used to verify and support the theory",
    "checked": true,
    "id": "45ea9f9ae5368774d921e56e28fade358d171b2f",
    "semantic_title": "linear algebraic structure of word senses, with applications to polysemy",
    "citation_count": 292,
    "authors": [
      "Sanjeev Arora",
      "Yuanzhi Li",
      "Yingyu Liang",
      "Tengyu Ma",
      "Andrej Risteski"
    ]
  },
  "https://aclanthology.org/Q18-1035": {
    "title": "Low-Rank RNN Adaptation for Context-Aware Language Modeling",
    "volume": "main",
    "abstract": "A context-aware language model uses location, user and/or domain metadata (context) to adapt its predictions. In neural language models, context information is typically represented as an embedding and it is given to the RNN as an additional input, which has been shown to be useful in many applications. We introduce a more powerful mechanism for using context to adapt an RNN by letting the context vector control a low-rank transformation of the recurrent layer weight matrix. Experiments show that allowing a greater fraction of the model parameters to be adjusted has benefits in terms of perplexity and classification for several different types of context",
    "checked": true,
    "id": "5835af39301c156456a1c7168f44ba9321b50278",
    "semantic_title": "low-rank rnn adaptation for context-aware language modeling",
    "citation_count": 25,
    "authors": [
      "Aaron Jaech",
      "Mari Ostendorf"
    ]
  },
  "https://aclanthology.org/Q18-1036": {
    "title": "Neural Lattice Language Models",
    "volume": "main",
    "abstract": "In this work, we propose a new language modeling paradigm that has the ability to perform both prediction and moderation of information flow at multiple granularities: neural lattice language models. These models construct a lattice of possible paths through a sentence and marginalize across this lattice to calculate sequence probabilities or optimize parameters. This approach allows us to seamlessly incorporate linguistic intuitions — including polysemy and the existence of multiword lexical items — into our language model. Experiments on multiple language modeling tasks show that English neural lattice language models that utilize polysemous embeddings are able to improve perplexity by 9.95% relative to a word-level baseline, and that a Chinese model that handles multi-character tokens is able to improve perplexity by 20.94% relative to a character-level baseline",
    "checked": true,
    "id": "0ca2a7465fe88f1f4912b8dd7b4b0db69a268b0b",
    "semantic_title": "neural lattice language models",
    "citation_count": 30,
    "authors": [
      "Jacob Buckman",
      "Graham Neubig"
    ]
  },
  "https://aclanthology.org/Q18-1037": {
    "title": "Planning, Inference and Pragmatics in Sequential Language Games",
    "volume": "main",
    "abstract": "We study sequential language games in which two players, each with private information, communicate to achieve a common goal. In such games, a successful player must (i) infer the partner's private information from the partner's messages, (ii) generate messages that are most likely to help with the goal, and (iii) reason pragmatically about the partner's strategy. We propose a model that captures all three characteristics and demonstrate their importance in capturing human behavior on a new goal-oriented dataset we collected using crowdsourcing",
    "checked": true,
    "id": "7dd78b1b9e1bb4b8e4bb9f08de97dc7e3ffde0cd",
    "semantic_title": "planning, inference and pragmatics in sequential language games",
    "citation_count": 27,
    "authors": [
      "Fereshte Khani",
      "Noah D. Goodman",
      "Percy Liang"
    ]
  },
  "https://aclanthology.org/Q18-1038": {
    "title": "Probabilistic Verb Selection for Data-to-Text Generation",
    "volume": "main",
    "abstract": "In data-to-text Natural Language Generation (NLG) systems, computers need to find the right words to describe phenomena seen in the data. This paper focuses on the problem of choosing appropriate verbs to express the direction and magnitude of a percentage change (e.g., in stock prices). Rather than simply using the same verbs again and again, we present a principled data-driven approach to this problem based on Shannon's noisy-channel model so as to bring variation and naturalness into the generated text. Our experiments on three large-scale real-world news corpora demonstrate that the proposed probabilistic model can be learned to accurately imitate human authors' pattern of usage around verbs, outperforming the state-of-the-art method significantly",
    "checked": true,
    "id": "afa2c8f4bab3006a2e209b005be4818e6fc32bfa",
    "semantic_title": "probabilistic verb selection for data-to-text generation",
    "citation_count": 7,
    "authors": [
      "Dell Zhang",
      "Jiahao Yuan",
      "Xiaoling Wang",
      "Adam Foster"
    ]
  },
  "https://aclanthology.org/Q18-1039": {
    "title": "Adversarial Deep Averaging Networks for Cross-Lingual Sentiment Classification",
    "volume": "main",
    "abstract": "In recent years great success has been achieved in sentiment classification for English, thanks in part to the availability of copious annotated resources. Unfortunately, most languages do not enjoy such an abundance of labeled data. To tackle the sentiment classification problem in low-resource languages without adequate annotated data, we propose an Adversarial Deep Averaging Network (ADAN1) to transfer the knowledge learned from labeled data on a resource-rich source language to low-resource languages where only unlabeled data exist. ADAN has two discriminative branches: a sentiment classifier and an adversarial language discriminator. Both branches take input from a shared feature extractor to learn hidden representations that are simultaneously indicative for the classification task and invariant across languages. Experiments on Chinese and Arabic sentiment classification demonstrate that ADAN significantly outperforms state-of-the-art systems",
    "checked": true,
    "id": "aee4010d58fd1501f04ac556252ddb7bf4acd143",
    "semantic_title": "adversarial deep averaging networks for cross-lingual sentiment classification",
    "citation_count": 317,
    "authors": [
      "Xilun Chen",
      "Yu Sun",
      "Ben Athiwaratkun",
      "Claire Cardie",
      "Kilian Weinberger"
    ]
  },
  "https://aclanthology.org/Q18-1040": {
    "title": "Comparing Bayesian Models of Annotation",
    "volume": "main",
    "abstract": "The analysis of crowdsourced annotations in natural language processing is concerned with identifying (1) gold standard labels, (2) annotator accuracies and biases, and (3) item difficulties and error patterns. Traditionally, majority voting was used for 1, and coefficients of agreement for 2 and 3. Lately, model-based analysis of corpus annotations have proven better at all three tasks. But there has been relatively little work comparing them on the same datasets. This paper aims to fill this gap by analyzing six models of annotation, covering different approaches to annotator ability, item difficulty, and parameter pooling (tying) across annotators and items. We evaluate these models along four aspects: comparison to gold labels, predictive accuracy for new annotations, annotator characterization, and item difficulty, using four datasets with varying degrees of noise in the form of random (spammy) annotators. We conclude with guidelines for model selection, application, and implementation",
    "checked": true,
    "id": "6806f6aba9170a4d6e8a6ebeb25c539fe756aebb",
    "semantic_title": "comparing bayesian models of annotation",
    "citation_count": 96,
    "authors": [
      "Silviu Paun",
      "Bob Carpenter",
      "Jon Chamberlain",
      "Dirk Hovy",
      "Udo Kruschwitz",
      "Massimo Poesio"
    ]
  },
  "https://aclanthology.org/Q18-1041": {
    "title": "Data Statements for Natural Language Processing: Toward Mitigating System Bias and Enabling Better Science",
    "volume": "main",
    "abstract": "In this paper, we propose data statements as a design solution and professional practice for natural language processing technologists, in both research and development. Through the adoption and widespread use of data statements, the field can begin to address critical scientific and ethical issues that result from the use of data from certain populations in the development of technology for other populations. We present a form that data statements can take and explore the implications of adopting them as part of regular practice. We argue that data statements will help alleviate issues related to exclusion and bias in language technology, lead to better precision in claims about how natural language processing research can generalize and thus better engineering results, protect companies from public embarrassment, and ultimately lead to language technology that meets its users in their own preferred linguistic style and furthermore does not misrepresent them to others",
    "checked": true,
    "id": "97bfa89addc6e5d76361e4c1e296949cad887b86",
    "semantic_title": "data statements for natural language processing: toward mitigating system bias and enabling better science",
    "citation_count": 896,
    "authors": [
      "Emily M. Bender",
      "Batya Friedman"
    ]
  },
  "https://aclanthology.org/Q18-1042": {
    "title": "Mind the GAP: A Balanced Corpus of Gendered Ambiguous Pronouns",
    "volume": "main",
    "abstract": "Coreference resolution is an important task for natural language understanding, and the resolution of ambiguous pronouns a longstanding challenge. Nonetheless, existing corpora do not capture ambiguous pronouns in sufficient volume or diversity to accurately indicate the practical utility of models. Furthermore, we find gender bias in existing corpora and systems favoring masculine entities. To address this, we present and release GAP, a gender-balanced labeled corpus of 8,908 ambiguous pronoun–name pairs sampled to provide diverse coverage of challenges posed by real-world text. We explore a range of baselines that demonstrate the complexity of the challenge, the best achieving just 66.9% F1. We show that syntactic structure and continuous neural models provide promising, complementary cues for approaching the challenge",
    "checked": true,
    "id": "57032c1e327c88a53ab41c17e91bf1406f9ef5c9",
    "semantic_title": "",
    "citation_count": 202,
    "authors": [
      "Kellie Webster",
      "Marta Recasens",
      "Vera Axelrod",
      "Jason Baldridge"
    ]
  },
  "https://aclanthology.org/Q18-1043": {
    "title": "Exploring Neural Methods for Parsing Discourse Representation Structures",
    "volume": "main",
    "abstract": "Neural methods have had several recent successes in semantic parsing, though they have yet to face the challenge of producing meaning representations based on formal semantics. We present a sequence-to-sequence neural semantic parser that is able to produce Discourse Representation Structures (DRSs) for English sentences with high accuracy, outperforming traditional DRS parsers. To facilitate the learning of the output, we represent DRSs as a sequence of flat clauses and introduce a method to verify that produced DRSs are well-formed and interpretable. We compare models using characters and words as input and see (somewhat surprisingly) that the former performs better than the latter. We show that eliminating variable names from the output using De Bruijn indices increases parser performance. Adding silver training data boosts performance even further",
    "checked": true,
    "id": "64d62a3a14de53416dd833bac7feebc38531c27f",
    "semantic_title": "exploring neural methods for parsing discourse representation structures",
    "citation_count": 62,
    "authors": [
      "Rik van Noord",
      "Lasha Abzianidze",
      "Antonio Toral",
      "Johan Bos"
    ]
  },
  "https://aclanthology.org/Q18-1044": {
    "title": "Integrating Weakly Supervised Word Sense Disambiguation into Neural Machine Translation",
    "volume": "main",
    "abstract": "This paper demonstrates that word sense disambiguation (WSD) can improve neural machine translation (NMT) by widening the source context considered when modeling the senses of potentially ambiguous words. We first introduce three adaptive clustering algorithms for WSD, based on k-means, Chinese restaurant processes, and random walks, which are then applied to large word contexts represented in a low-rank space and evaluated on SemEval shared-task data. We then learn word vectors jointly with sense vectors defined by our best WSD method, within a state-of-the-art NMT system. We show that the concatenation of these vectors, and the use of a sense selection mechanism based on the weighted average of sense vectors, outperforms several baselines including sense-aware ones. This is demonstrated by translation on five language pairs. The improvements are more than 1 BLEU point over strong NMT baselines, +4% accuracy over all ambiguous nouns and verbs, or +20% when scored manually over several challenging words",
    "checked": true,
    "id": "1e1bf6b13f3ad7e301a3bbe79a254eacb99d67ad",
    "semantic_title": "integrating weakly supervised word sense disambiguation into neural machine translation",
    "citation_count": 41,
    "authors": [
      "Xiao Pu",
      "Nikolaos Pappas",
      "James Henderson",
      "Andrei Popescu-Belis"
    ]
  },
  "https://aclanthology.org/Q18-1045": {
    "title": "Recurrent Neural Networks in Linguistic Theory: Revisiting Pinker and Prince (1988) and the Past Tense Debate",
    "volume": "main",
    "abstract": "Can advances in NLP help advance cognitive modeling? We examine the role of artificial neural networks, the current state of the art in many common NLP tasks, by returning to a classic case study. In 1986, Rumelhart and McClelland famously introduced a neural architecture that learned to transduce English verb stems to their past tense forms. Shortly thereafter in 1988, Pinker and Prince presented a comprehensive rebuttal of many of Rumelhart and McClelland's claims. Much of the force of their attack centered on the empirical inadequacy of the Rumelhart and McClelland model. Today, however, that model is severely outmoded. We show that the Encoder-Decoder network architectures used in modern NLP systems obviate most of Pinker and Prince's criticisms without requiring any simplification of the past tense mapping problem. We suggest that the empirical performance of modern networks warrants a reexamination of their utility in linguistic and cognitive modeling",
    "checked": true,
    "id": "df6dadfd989b5623c928cad17809b1ff3fff081e",
    "semantic_title": "recurrent neural networks in linguistic theory: revisiting pinker and prince (1988) and the past tense debate",
    "citation_count": 80,
    "authors": [
      "Christo Kirov",
      "Ryan Cotterell"
    ]
  },
  "https://aclanthology.org/Q18-1046": {
    "title": "Surface Statistics of an Unknown Language Indicate How to Parse It",
    "volume": "main",
    "abstract": "We introduce a novel framework for delexicalized dependency parsing in a new language. We show that useful features of the target language can be extracted automatically from an unparsed corpus, which consists only of gold part-of-speech (POS) sequences. Providing these features to our neural parser enables it to parse sequences like those in the corpus. Strikingly, our system has no supervision in the target language. Rather, it is a multilingual system that is trained end-to-end on a variety of other languages, so it learns a feature extractor that works well. We show experimentally across multiple languages: (1) Features computed from the unparsed corpus improve parsing accuracy. (2) Including thousands of synthetic languages in the training yields further improvement. (3) Despite being computed from unparsed corpora, our learned task-specific features beat previous work's interpretable typological features that require parsed corpora or expert categorization of the language. Our best method improved attachment scores on held-out test languages by an average of 5.6 percentage points over past work that does not inspect the unparsed data (McDonald et al., 2011), and by 20.7 points over past \"grammar induction\" work that does not use training languages (Naseem et al., 2010)",
    "checked": true,
    "id": "f783cf30a49114dacc6e1a3f3a401e0a34c58b40",
    "semantic_title": "surface statistics of an unknown language indicate how to parse it",
    "citation_count": 15,
    "authors": [
      "Dingquan Wang",
      "Jason Eisner"
    ]
  },
  "https://aclanthology.org/Q18-1047": {
    "title": "Attentive Convolution: Equipping CNNs with RNN-style Attention Mechanisms",
    "volume": "main",
    "abstract": "In NLP, convolutional neural networks (CNNs) have benefited less than recurrent neural networks (RNNs) from attention mechanisms. We hypothesize that this is because the attention in CNNs has been mainly implemented as attentive pooling (i.e., it is applied to pooling) rather than as attentive convolution (i.e., it is integrated into convolution). Convolution is the differentiator of CNNs in that it can powerfully model the higher-level representation of a word by taking into account its local fixed-size context in the input text tx. In this work, we propose an attentive convolution network, ATTCONV. It extends the context scope of the convolution operation, deriving higher-level features for a word not only from local context, but also from information extracted from nonlocal context by the attention mechanism commonly used in RNNs. This nonlocal context can come (i) from parts of the input text tx that are distant or (ii) from extra (i.e., external) contexts ty. Experiments on sentence modeling with zero-context (sentiment analysis), single-context (textual entailment) and multiple-context (claim verification) demonstrate the effectiveness of ATTCONV in sentence representation learning with the incorporation of context. In particular, attentive convolution outperforms attentive pooling and is a strong competitor to popular attentive RNNs.1",
    "checked": true,
    "id": "7fd49178dd454b622fcc7680e70bf613fa2d81ab",
    "semantic_title": "attentive convolution: equipping cnns with rnn-style attention mechanisms",
    "citation_count": 43,
    "authors": [
      "Wenpeng Yin",
      "Hinrich Schütze"
    ]
  },
  "https://aclanthology.org/Q18-1048": {
    "title": "Learning Typed Entailment Graphs with Global Soft Constraints",
    "volume": "main",
    "abstract": "This paper presents a new method for learning typed entailment graphs from text. We extract predicate-argument structures from multiple-source news corpora, and compute local distributional similarity scores to learn entailments between predicates with typed arguments (e.g., person contracted disease). Previous work has used transitivity constraints to improve local decisions, but these constraints are intractable on large graphs. We instead propose a scalable method that learns globally consistent similarity scores based on new soft constraints that consider both the structures across typed entailment graphs and inside each graph. Learning takes only a few hours to run over 100K predicates and our results show large improvements over local similarity scores on two entailment data sets. We further show improvements over paraphrases and entailments from the Paraphrase Database, and prior state-of-the-art entailment graphs. We show that the entailment graphs improve performance in a downstream task",
    "checked": true,
    "id": "99ceef1e4a7e4fbe994166b022045b5a899aa22f",
    "semantic_title": "learning typed entailment graphs with global soft constraints",
    "citation_count": 34,
    "authors": [
      "Mohammad Javad Hosseini",
      "Nathanael Chambers",
      "Siva Reddy",
      "Xavier R. Holt",
      "Shay B. Cohen",
      "Mark Johnson",
      "Mark Steedman"
    ]
  }
}