{
  "https://openreview.net/forum?id=g01OVahtN9": {
    "title": "Controlling Federated Learning for Covertness",
    "volume": "main",
    "abstract": "A learner aims to minimize a function $f$ by repeatedly querying a distributed oracle that provides noisy gradient evaluations. At the same time, the learner seeks to hide $\\arg\\min f$ from a malicious eavesdropper that observes the learner's queries. This paper considers the problem of \\textit{covert} or \\textit{learner-private} optimization, where the learner has to dynamically choose between learning and obfuscation by exploiting the stochasticity. The problem of controlling the stochastic gradient algorithm for covert optimization is modeled as a Markov decision process, and we show that the dynamic programming operator has a supermodular structure implying that the optimal policy has a monotone threshold structure. A computationally efficient policy gradient algorithm is proposed to search for the optimal querying policy without knowledge of the transition probabilities. As a practical application, our methods are demonstrated on a hate speech classification task in a federated setting where an eavesdropper can use the optimal weights to generate toxic content, which is more easily misclassified. Numerical results show that when the learner uses the optimal policy, an eavesdropper can only achieve a validation accuracy of $52\\%$ with no information and $69\\%$ when it has a public dataset with $10\\%$ positive samples compared to $83\\%$ when the learner employs a greedy policy",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "2a864f9dbd52e8965818cce75b2b51fecc6d47f4",
    "semantic_title": "controlling federated learning for covertness",
    "citation_count": 0,
    "authors": [
      "Adit Jain",
      "Vikram Krishnamurthy"
    ]
  },
  "https://openreview.net/forum?id=ynG5Ak7n7Q": {
    "title": "The Fair Value of Data Under Heterogeneous Privacy Constraints in Federated Learning",
    "volume": "main",
    "abstract": "Modern data aggregation often involves a platform collecting data from a network of users with various privacy options. Platforms must solve the problem of how to allocate incentives to users to convince them to share their data. This paper puts forth an idea for a fair amount to compensate users for their data at a given privacy level based on an axiomatic definition of fairness, along the lines of the celebrated Shapley value. To the best of our knowledge, these are the first fairness concepts for data that explicitly consider privacy constraints. We also formulate a heterogeneous federated learning problem for the platform with privacy level options for users. By studying this problem, we investigate the amount of compensation users receive under fair allocations with different privacy levels, amounts of data, and degrees of heterogeneity. We also discuss what happens when the platform is forced to design fair incentives. Under certain conditions we find that when privacy sensitivity is low, the platform will set incentives to ensure that it collects all the data with the lowest privacy options. When the privacy sensitivity is above a given threshold, the platform will provide no incentives to users. Between these two extremes, the platform will set the incentives so some fraction of the users chooses the higher privacy option and the others chooses the lower privacy option",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "7fb6e66238e89be76d818586c8ffb15a7e68ca66",
    "semantic_title": "the fair value of data under heterogeneous privacy constraints",
    "citation_count": 4,
    "authors": [
      "Justin Singh Kang",
      "Ramtin Pedarsani",
      "Kannan Ramchandran"
    ]
  },
  "https://openreview.net/forum?id=pWsfWDnJDa": {
    "title": "Out-of-Distribution Optimality of Invariant Risk Minimization",
    "volume": "main",
    "abstract": "Deep Neural Networks often inherit spurious correlations embedded in training data and hence may fail to generalize to unseen domains, which have different distributions from the domain to provide training data. M. Arjovsky et al. (2019) introduced the concept out-of-distribution (o.o.d.) risk, which is the maximum risk among all domains, and formulated the issue caused by spurious correlations as a minimization problem of the o.o.d. risk. Invariant Risk Minimization (IRM) is considered to be a promising approach to minimize the o.o.d. risk: IRM estimates a minimum of the o.o.d. risk by solving a bi-level optimization problem. While IRM has attracted considerable attention with empirical success, it comes with few theoretical guarantees. Especially, a solid theoretical guarantee that the bi-level optimization problem gives the minimum of the o.o.d. risk has not yet been established. Aiming at providing a theoretical justification for IRM, this paper rigorously proves that a solution to the bi-level optimization problem minimizes the o.o.d. risk under certain conditions. The result also provides sufficient conditions on distributions providing training data and on a dimension of feature space for the bi-leveled optimization problem to minimize the o.o.d. risk",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "1b326b04bfe326295e588e18ebfd94b26a878c85",
    "semantic_title": "out-of-distribution optimality of invariant risk minimization",
    "citation_count": 0,
    "authors": [
      "Shoji Toyota",
      "Kenji Fukumizu"
    ]
  },
  "https://openreview.net/forum?id=ZLVbQEu4Ab": {
    "title": "When is Momentum Extragradient Optimal? A Polynomial-Based Analysis",
    "volume": "main",
    "abstract": "The extragradient method has gained popularity due to its robust convergence properties for differentiable games. Unlike single-objective optimization, game dynamics involve complex interactions reflected by the eigenvalues of the game vector field's Jacobian scattered across the complex plane. This complexity can cause the simple gradient method to diverge, even for bilinear games, while the extragradient method achieves convergence. Building on the recently proven accelerated convergence of the momentum extragradient method for bilinear games \\citep{azizian2020accelerating}, we use a polynomial-based analysis to identify three distinct scenarios where this method exhibits further accelerated convergence. These scenarios encompass situations where the eigenvalues reside on the (positive) real line, lie on the real line alongside complex conjugates, or exist solely as complex conjugates. Furthermore, we derive the hyperparameters for each scenario that achieve the fastest convergence rate",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "1412997ab05fabe40a9dec6e1d8622c8480a8c71",
    "semantic_title": "when is momentum extragradient optimal? a polynomial-based analysis",
    "citation_count": 0,
    "authors": [
      "Junhyung Lyle Kim",
      "Gauthier Gidel",
      "Anastasios Kyrillidis",
      "Fabian Pedregosa"
    ]
  },
  "https://openreview.net/forum?id=Wqn8zirthg": {
    "title": "DDLP: Unsupervised Object-centric Video Prediction with Deep Dynamic Latent Particles",
    "volume": "main",
    "abstract": "We propose a new object-centric video prediction algorithm based on the deep latent particle (DLP) representation of Daniel and Tamar (2022). In comparison to existing slot- or patch-based representations, DLPs model the scene using a set of keypoints with learned parameters for properties such as position and size, and are both efficient and interpretable. Our method, \\textit{deep dynamic latent particles} (DDLP), yields state-of-the-art object-centric video prediction results on several challenging datasets. The interpretable nature of DDLP allows us to perform ``what-if'' generation -- predict the consequence of changing properties of objects in the initial frames, and DLP's compact structure enables efficient diffusion-based unconditional video generation. Videos, code and pre-trained models are available: https://taldatech.github.io/ddlp-web",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "7d22e6d110a2be18ef7236fb2238fd85463de4b2",
    "semantic_title": "ddlp: unsupervised object-centric video prediction with deep dynamic latent particles",
    "citation_count": 1,
    "authors": [
      "Tal Daniel",
      "Aviv Tamar"
    ]
  },
  "https://openreview.net/forum?id=vWTZO1RXZR": {
    "title": "Introspective Experience Replay: Look Back When Surprised",
    "volume": "main",
    "abstract": "In reinforcement learning (RL), experience replay-based sampling techniques are crucial in promoting convergence by eliminating spurious correlations. However, widely used methods such as uniform experience replay (UER) and prioritized experience replay (PER) have been shown to have sub-optimal convergence and high seed sensitivity, respectively. To address these issues, we propose a novel approach called Introspective Experience Replay (IER) that selectively samples batches of data points prior to surprising events. Our method is inspired from the reverse experience replay (RER) technique, which has been shown to reduce bias in the output of Q-learning-type algorithms with linear function approximation. However, RER is not always practically reliable when using neural function approximation. Through empirical evaluations, we demonstrate that IER with neural function approximation yields reliable and superior performance compared to UER, PER, and hindsight experience replay (HER) across most tasks",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "e6bd20a796c48f9c17ef55c6a821ec678a341b3b",
    "semantic_title": "introspective experience replay: look back when surprised",
    "citation_count": 0,
    "authors": [
      "Ramnath Kumar",
      "Dheeraj Mysore Nagaraj"
    ]
  },
  "https://openreview.net/forum?id=O9RUANpPmb": {
    "title": "Domain-Generalizable Multiple-Domain Clustering",
    "volume": "main",
    "abstract": "This work generalizes the problem of unsupervised domain generalization to the case in which no labeled samples are available (completely unsupervised). We are given unlabeled samples from multiple source domains, and we aim to learn a shared predictor that assigns examples to semantically related clusters. Evaluation is done by predicting cluster assignments in previously unseen domains. Towards this goal, we propose a two-stage training framework: (1) self-supervised pre-training for extracting domain invariant semantic features. (2) multi-head cluster prediction with pseudo labels, which rely on both the feature space and cluster head prediction, further leveraging a novel prediction-based label smoothing scheme. We demonstrate empirically that our model is more accurate than baselines that require fine-tuning using samples from the target domain or some level of supervision. Our code is available at \\url{https://github.com/AmitRozner/domain-generalizable-multiple-domain-clustering}",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "dfe2fffe974ec43dff94f02228d545270e3e63fb",
    "semantic_title": "domain-generalizable multiple-domain clustering",
    "citation_count": 2,
    "authors": [
      "Amit Rozner",
      "Barak Battash",
      "Lior Wolf",
      "Ofir Lindenbaum"
    ]
  },
  "https://openreview.net/forum?id=vsCpILiWHu": {
    "title": "RoboCat: A Self-Improving Generalist Agent for Robotic Manipulation",
    "volume": "main",
    "abstract": "The ability to leverage heterogeneous robotic experience from different robots and tasks to quickly master novel skills and embodiments has the potential to transform robot learning. Inspired by recent advances in foundation models for vision and language, we propose a multi-embodiment, multi-task generalist agent for robotic manipulation. This agent, named RoboCat, is a visual goal-conditioned decision transformer capable of consuming action-labelled visual experience. This data spans a large repertoire of motor control skills from simulated and real robotic arms with varying sets of observations and actions. With RoboCat, we demonstrate the ability to generalise to new tasks and robots, both zero-shot as well as through adaptation using only 100–1000 examples for the target task. We also show how a trained model itself can be used to generate data for subsequent training iterations, thus providing a basic building block for an autonomous improvement loop. We investigate the agent's capabilities, with large-scale evaluations both in simulation and on three different real robot embodiments. We find that as we grow and diversify its training data, RoboCat not only shows signs of cross-task transfer, but also becomes more efficient at adapting to new tasks",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "2562fe379554d201aad312f786903f4c60b68acf",
    "semantic_title": "robocat: a self-improving generalist agent for robotic manipulation",
    "citation_count": 18,
    "authors": [
      "Konstantinos Bousmalis",
      "Giulia Vezzani",
      "Dushyant Rao",
      "Coline Manon Devin",
      "Alex X. Lee",
      "Maria Bauza Villalonga",
      "Todor Davchev",
      "Yuxiang Zhou",
      "Agrim Gupta",
      "Akhil Raju",
      "Antoine Laurens",
      "Claudio Fantacci",
      "Valentin Dalibard",
      "Martina Zambelli",
      "Murilo Fernandes Martins",
      "Rugile Pevceviciute",
      "Michiel Blokzijl",
      "Misha Denil",
      "Nathan Batchelor",
      "Thomas Lampe",
      "Emilio Parisotto",
      "Konrad Zolna",
      "Scott Reed",
      "Sergio Gómez Colmenarejo",
      "Jonathan Scholz",
      "Abbas Abdolmaleki",
      "Oliver Groth",
      "Jean-Baptiste Regli",
      "Oleg Sushkov",
      "Thomas Rothörl",
      "Jose Enrique Chen",
      "Yusuf Aytar",
      "David Barker",
      "Joy Ortiz",
      "Martin Riedmiller",
      "Jost Tobias Springenberg",
      "Raia Hadsell",
      "Francesco Nori",
      "Nicolas Heess"
    ]
  },
  "https://openreview.net/forum?id=Igxp7FC8uf": {
    "title": "Fixed-Budget Best-Arm Identification in Sparse Linear Bandits",
    "volume": "main",
    "abstract": "We study the best-arm identification problem in sparse linear bandits under the fixed-budget setting. In sparse linear bandits, the unknown feature vector $\\theta^*$ may be of large dimension $d$, but only a few, say $s \\ll d$ of these features have non-zero values. We design a two-phase algorithm, Lasso and Optimal-Design- (Lasso-OD) based linear best-arm identification. The first phase of Lasso-OD leverages the sparsity of the feature vector by applying the thresholded Lasso introduced by Zhou (2009), which estimates the support of $\\theta^*$ correctly with high probability using rewards from the selected arms and a judicious choice of the design matrix. The second phase of Lasso-OD applies the OD-LinBAI algorithm by Yang and Tan (2022) on that estimated support. We derive a non-asymptotic upper bound on the error probability of Lasso-OD by carefully choosing hyperparameters (such as Lasso's regularization parameter) and balancing the error probabilities of both phases. For fixed sparsity $s$ and budget $T$, the exponent in the error probability of Lasso-OD depends on $s$ but not on the dimension $d$, yielding a significant performance improvement for sparse and high-dimensional linear bandits. Furthermore, we show that Lasso-OD is almost minimax optimal in the exponent. Finally, we provide numerical examples to demonstrate the significant performance improvement over the existing algorithms for non-sparse linear bandits such as OD-LinBAI, BayesGap, Peace, LinearExploration, and GSE",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "e59f0a8bceffaefb7f646723e53afcb3ff3bc9e0",
    "semantic_title": "fixed-budget best-arm identification in sparse linear bandits",
    "citation_count": 0,
    "authors": [
      "Recep Can Yavas",
      "Vincent Y. F. Tan"
    ]
  },
  "https://openreview.net/forum?id=6BDHUkSPna": {
    "title": "Understanding the Role of Layer Normalization in Label-Skewed Federated Learning",
    "volume": "main",
    "abstract": "Layer normalization (LN) is a widely adopted deep learning technique especially in the era of foundation models. Recently, LN has been shown to be surprisingly effective in federated learning (FL) with non-i.i.d. data. However, exactly why and how it works remains mysterious. In this work, we reveal the profound connection between layer normalization and the label shift problem in federated learning. To understand layer normalization better in FL, we identify the key contributing mechanism of normalization methods in FL, called feature normalization (FN), which applies normalization to the latent feature representation before the classifier head. Although LN and FN do not improve expressive power, they control feature collapse and local overfitting to heavily skewed datasets, and thus accelerates global training. Empirically, we show that normalization leads to drastic improvements on standard benchmarks under extreme label shift. Moreover, we conduct extensive ablation studies to understand the critical factors of layer normalization in FL. Our results verify that FN is an essential ingredient inside LN to significantly improve the convergence of FL while remaining robust to learning rate choices, especially under extreme label shift where each client has access to few classes",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "dcf939f84b63e38a0235868ac3e7b9f99a196765",
    "semantic_title": "understanding the role of layer normalization in label-skewed federated learning",
    "citation_count": 2,
    "authors": [
      "Guojun Zhang",
      "Mahdi Beitollahi",
      "Alex Bie",
      "Xi Chen"
    ]
  },
  "https://openreview.net/forum?id=KKARKoPcEA": {
    "title": "Learning to Abstain From Uninformative Data",
    "volume": "main",
    "abstract": "Learning and decision-making in domains with naturally high noise-to-signal ratios – such as Finance or Healthcare – is often challenging, while the stakes are very high. In this paper, we study the problem of learning and acting under a general noisy generative process. In this problem, the data distribution has a significant proportion of uninformative samples with high noise in the label, while part of the data contains useful information represented by low label noise. This dichotomy is present during both training and inference, which requires the proper handling of uninformative data during both training and testing. We propose a novel approach to learning under these conditions via a loss inspired by the selective learning theory. By minimizing this loss, the model is guaranteed to make a near-optimal decision by distinguishing informative data from uninformative data and making predictions. We build upon the strength of our theoretical guarantees by describing an iterative algorithm, which jointly optimizes both a predictor and a selector, and evaluates its empirical performance in a variety of settings",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "6df82e80441fc2a67c6ad81879001313fab36568",
    "semantic_title": "learning to abstain from uninformative data",
    "citation_count": 0,
    "authors": [
      "Yikai Zhang",
      "Songzhu Zheng",
      "Mina Dalirrooyfard",
      "Pengxiang Wu",
      "Anderson Schneider",
      "Anant Raj",
      "Yuriy Nevmyvaka",
      "Chao Chen"
    ]
  },
  "https://openreview.net/forum?id=6wpInwnzs8": {
    "title": "WaveBench: Benchmarks Datasets for Modeling Linear Wave Propagation PDEs",
    "volume": "main",
    "abstract": "Wave-based imaging techniques play a critical role in diverse scientific, medical, and industrial endeavors, from discovering hidden structures beneath the Earth's surface to ultrasound diagnostics. They rely on accurate solutions to the forward and inverse problems for partial differential equations (PDEs) that govern wave propagation. Surrogate PDE solvers based on machine learning emerged as an effective approach to computing the solutions more efficiently than via classical numerical schemes. However, existing datasets for PDE surrogates offer only limited coverage of the wave propagation phenomenon. In this paper, we present WaveBench, a comprehensive collection of benchmark datasets for wave propagation PDEs. WaveBench (1) contains 24 datasets that cover a wide range of forward and inverse problems for time-harmonic and time-varying wave phenomena; (2) includes a user-friendly PyTorch environment for comparing learning-based methods; and (3) comprises reference performance and model checkpoints of popular PDE surrogates such as Fourier neural operators and U-Nets. Our evaluation on WaveBench demonstrates the impressive performance of PDE surrogates on in-distribution samples, while simultaneously unveiling their limitations on out-of-distribution samples, indicating room for future improvements. We anticipate that WaveBench will stimulate the development of accurate wave-based imaging techniques through machine learning",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Tianlin Liu",
      "Jose Antonio Lara Benitez",
      "Florian Faucher",
      "AmirEhsan Khorashadizadeh",
      "Maarten V. de Hoop",
      "Ivan Dokmanić"
    ]
  },
  "https://openreview.net/forum?id=fUhOb14sQv": {
    "title": "Using Motion Cues to Supervise Single-frame Body Pose & Shape Estimation in Low Data Regimes",
    "volume": "main",
    "abstract": "When enough annotated training data is available, supervised deep-learning algorithms excel at estimating human body pose and shape using a single camera. The effects of too little such data being available can be mitigated by using other information sources, such as databases of body shapes, to learn priors. Unfortunately, such sources are not always available either. We show that, in such cases, easy to-obtain unannotated videos can be used instead to provide the required supervisory signals. Given a trained model using too little annotated data, we compute poses in consecutive frames along with the optical flow between them. We then enforce consistency between the image optical flow and the one that can be inferred from the change in pose from one frame to the next. This provides enough additional supervision to effectively refine the network weights and to perform on par with methods trained using far more annotated data",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "04ebb3d96065b4296c85dcd030ac1ea9654c9412",
    "semantic_title": "using motion cues to supervise single-frame body pose and shape estimation in low data regimes",
    "citation_count": 0,
    "authors": [
      "Andrey Davydov",
      "Alexey Sidnev",
      "Artsiom Sanakoyeu",
      "Yuhua Chen",
      "Mathieu Salzmann",
      "Pascal Fua"
    ]
  },
  "https://openreview.net/forum?id=E8m8oySvPJ": {
    "title": "LLMs and the Abstraction and Reasoning Corpus: Successes, Failures, and the Importance of Object-based Representations",
    "volume": "main",
    "abstract": "Can a Large Language Model (LLM) solve simple abstract reasoning problems? We explore this broad question through a systematic analysis of GPT on the Abstraction and Reasoning Corpus (ARC), a representative benchmark of abstract reasoning ability from limited examples in which solutions require some \"core knowledge\" of concepts such as objects, goal states, counting, and basic geometry. GPT-4 solves only 13/50 of the most straightforward ARC tasks when using textual encodings for their two-dimensional input-output grids. Our failure analysis reveals that GPT-4's capacity to identify objects and reason about them is significantly influenced by the sequential nature of the text that represents an object within a text encoding of a task. To test this hypothesis, we design a new benchmark, the 1D-ARC, which consists of one-dimensional (array-like) tasks that are more conducive to GPT-based reasoning, and where it indeed performs better than on the (2D) ARC. To alleviate this issue, we propose an object-based representation that is obtained through an external tool, resulting in nearly doubling the performance on solved ARC tasks and near-perfect scores on the easier 1D-ARC. Although the state-of-the-art GPT-4 is unable to \"reason\" perfectly within non-language domains such as the 1D-ARC or a simple ARC subset, our study reveals that the use of object-based representations can significantly improve its reasoning ability. Visualizations, GPT logs, and data are available at https://khalil-research.github.io/LLM4ARC",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "8826311d922135dbf0cfdb4a661ebab347e3b826",
    "semantic_title": "llms and the abstraction and reasoning corpus: successes, failures, and the importance of object-based representations",
    "citation_count": 10,
    "authors": [
      "Yudong Xu",
      "Wenhao Li",
      "Pashootan Vaezipoor",
      "Scott Sanner",
      "Elias Boutros Khalil"
    ]
  },
  "https://openreview.net/forum?id=fJAwemcvpL": {
    "title": "Candidate Set Re-ranking for Composed Image Retrieval with Dual Multi-modal Encoder",
    "volume": "main",
    "abstract": "Composed image retrieval aims to find an image that best matches a given multi-modal user query consisting of a reference image and text pair. Existing methods commonly pre-compute image embeddings over the entire corpus and compare these to a reference image embedding modified by the query text at test time. Such a pipeline is very efficient at test time since fast vector distances can be used to evaluate candidates, but modifying the reference image embedding guided only by a short textual description can be difficult, especially independent of potential candidates. An alternative approach is to allow interactions between the query and every possible candidate, i.e., reference-text-candidate triplets, and pick the best from the entire set. Though this approach is more discriminative, for large-scale datasets the computational cost is prohibitive since pre-computation of candidate embeddings is no longer possible. We propose to combine the merits of both schemes using a two-stage model. Our first stage adopts the conventional vector distancing metric and performs a fast pruning among candidates. Meanwhile, our second stage employs a dual-encoder architecture, which effectively attends to the input triplet of reference-text-candidate and re-ranks the candidates. Both stages utilize a vision-and-language pre-trained network, which has proven beneficial for various downstream tasks. Our method consistently outperforms state-of-the-art approaches on standard benchmarks for the task. Our implementation is available at https://github.com/Cuberick-Orion/Candidate-Reranking-CIR",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "5eceaeac5d45d49e1d5698947ed8292ff3fccd81",
    "semantic_title": "candidate set re-ranking for composed image retrieval with dual multi-modal encoder",
    "citation_count": 3,
    "authors": [
      "Zheyuan Liu",
      "Weixuan Sun",
      "Damien Teney",
      "Stephen Gould"
    ]
  },
  "https://openreview.net/forum?id=jesKcQxQ7j": {
    "title": "A Review of the Applications of Deep Learning-Based Emergent Communication",
    "volume": "main",
    "abstract": "Emergent communication, or emergent language, is the field of research which studies how human language-like communication systems emerge de novo in deep multi-agent reinforcement learning environments. The possibilities of replicating the emergence of a complex behavior like language have strong intuitive appeal, yet it is necessary to complement this with clear notions of how such research can be applicable to other fields of science, technology, and engineering. This paper comprehensively reviews the applications of emergent communication research across machine learning, natural language processing, linguistics, and cognitive science. Each application is illustrated with a description of its scope, an explication of emergent communication's unique role in addressing it, a summary of the extant literature working towards the application, and brief recommendations for near-term research directions",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Brendon Boldt",
      "David R Mortensen"
    ]
  },
  "https://openreview.net/forum?id=mH6TelHVKD": {
    "title": "Data-Dependent Generalization Bounds for Neural Networks with ReLU",
    "volume": "main",
    "abstract": "We try to establish that one of the correct data-dependent quantities to look at while trying to prove generalization bounds, even for overparameterized neural networks, are the gradients encountered by stochastic gradient descent while training the model. If these are small, then the model generalizes. To make this conclusion rigorous, we weaken the notion of uniform stability of a learning algorithm in a probabilistic way by positing the notion of almost sure (a.s.) support stability and showing that algorithms that have this form of stability have generalization error tending to 0 as the training set size increases. Further, we show that for Stochastic Gradient Descent to be a.s. support stable we only need the loss function to be a.s. locally Lipschitz and locally Smooth at the training points, thereby showing low generalization error with weaker conditions than have been used in the literature. We then show that Neural Networks with ReLU activation and a doubly differentiable loss function possess these properties. Our notion of stability is the first data-dependent notion to be able to show good generalization bounds for non-convex functions with learning rates strictly slower than $1/t$ at the $t$-th step. Finally, we present experimental evidence to validate our theoretical results",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "a41b8b0dfafb417f7bb058670cebbce9e7bf15ac",
    "semantic_title": "sparsity-aware generalization theory for deep neural networks",
    "citation_count": 3,
    "authors": [
      "Harsh Pandey",
      "Amitabha Bagchi",
      "Srikanta J. Bedathur",
      "Arindam Bhattacharya"
    ]
  },
  "https://openreview.net/forum?id=5nBqY1y96B": {
    "title": "Two Failures of Self-Consistency in the Multi-Step Reasoning of LLMs",
    "volume": "main",
    "abstract": "Large language models (LLMs) have achieved widespread success on a variety of in-context few-shot tasks, but this success is typically evaluated via correctness rather than consistency. We argue that self-consistency is an important criteria for valid multi-step reasoning in tasks where the solution is composed of the answers to multiple sub-steps. We propose two types of self-consistency that are particularly important for multi-step reasoning -- hypothetical consistency (a model's ability to predict what its output would be in a hypothetical other context) and compositional consistency (consistency of a model's final outputs when intermediate sub-steps are replaced with the model's outputs for those steps). We demonstrate that multiple variants of the GPT-3/-4 models exhibit poor consistency rates across both types of consistency on a variety of tasks",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "3200a0d6fef7164f0341cf1938f584da6057ffd6",
    "semantic_title": "two failures of self-consistency in the multi-step reasoning of llms",
    "citation_count": 8,
    "authors": [
      "Angelica Chen",
      "Jason Phang",
      "Alicia Parrish",
      "Vishakh Padmakumar",
      "Chen Zhao",
      "Samuel R. Bowman",
      "Kyunghyun Cho"
    ]
  },
  "https://openreview.net/forum?id=OdDsCaacZ0": {
    "title": "MOCA: Self-supervised Representation Learning by Predicting Masked Online Codebook Assignments",
    "volume": "main",
    "abstract": "Self-supervised learning can be used for mitigating the greedy needs of Vision Transformer networks for very large fully-annotated datasets. Different classes of self-supervised learning offer representations with either good contextual reasoning properties, e.g., using masked image modeling strategies, or invariance to image perturbations, e.g., with contrastive methods. In this work, we propose a single-stage and standalone method, MOCA, which unifies both desired properties using novel mask-and-predict objectives defined with high-level features (instead of pixel-level details). Moreover, we show how to effectively employ both learning paradigms in a synergistic and computation-efficient way. Doing so, we achieve new state-of-the-art results on low-shot settings and strong experimental results in various evaluation protocols with a training that is at least 3 times faster than prior methods. We provide the implementation code at https://github.com/valeoai/MOCA",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "39ffd546e3b64b6313035164ed899339456307a2",
    "semantic_title": "moca: self-supervised representation learning by predicting masked online codebook assignments",
    "citation_count": 0,
    "authors": [
      "Spyros Gidaris",
      "Andrei Bursuc",
      "Oriane Siméoni",
      "Antonín Vobecký",
      "Nikos Komodakis",
      "Matthieu Cord",
      "Patrick Perez"
    ]
  },
  "https://openreview.net/forum?id=emXh4M7TyH": {
    "title": "Transfer Learning for Bayesian Optimization on Heterogeneous Search Spaces",
    "volume": "main",
    "abstract": "Bayesian optimization (BO) is a popular black-box function optimization method, which makes sequential decisions based on a Bayesian model, typically a Gaussian process (GP), of the function. To ensure the quality of the model, transfer learning approaches have been developed to automatically design GP priors by learning from observations on \"training\" functions. These training functions are typically required to have the same domain as the \"test\" function (black-box function to be optimized). In this paper, we introduce MPHD, a model pre-training method on heterogeneous domains, which uses a neural net mapping from domain-specific contexts to specifications of hierarchical GPs. MPHD can be seamlessly integrated with BO to transfer knowledge across heterogeneous search spaces. Our theoretical and empirical results demonstrate the validity of MPHD and its superior performance on challenging black-box function optimization tasks",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "7889cf92ff5120430db0371ff5c70aeb151ac71d",
    "semantic_title": "transfer learning for bayesian optimization on heterogeneous search spaces",
    "citation_count": 0,
    "authors": [
      "Zhou Fan",
      "Xinran Han",
      "Zi Wang"
    ]
  },
  "https://openreview.net/forum?id=zc0Y0cAuTV": {
    "title": "A Multilinear Least-Squares Formulation for Sparse Tensor Canonical Correlation Analysis",
    "volume": "main",
    "abstract": "Tensor data are becoming important recently in various applications, e.g., image and video recognition, which pose new challenges for data modeling and analysis approaches, such as high-order relations of large complexity, varying data scale and gross noise. In this paper, we consider the problem of sparse canonical correlation analysis for arbitrary tensor data. Although several methods have been proposed for this task, there are still limitations hindering its practical applications. To this end, we present a general Sparse Tensor Canonical Correlation Analysis (gSTCCA) method from a multilinear least-squares perspective. Specifically, we formulate the problem as a constrained multilinear least-squares problem with tensor-structured sparsity regularization based on CANDECOMP/PARAFAC (CP) decomposition. Then we present a divide-and-conquer deflation approach to tackle the problem by successive rank-one tensor estimation of the residual tensors, where the overall model is broken up into a set of unconstrained linear least-squares problems that can be efficiently solved. Through extensive experiments conducted on five different datasets for recognition tasks, we demonstrate that the proposed method achieves promising performance compared to the SOTA vector- and tensor-based canonical correlation analysis methods in terms of classification accuracy, model sparsity, and robustness to missing and noisy data. The code is publicly available at https://github.com/junfish/gSTCCA",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Jun Yu",
      "Zhaoming Kong",
      "Kun Chen",
      "Xin Zhang",
      "Yong Chen",
      "Lifang He"
    ]
  },
  "https://openreview.net/forum?id=xLg8ljlEba": {
    "title": "Generalizing Neural Additive Models via Statistical Multimodal Analysis",
    "volume": "main",
    "abstract": "Interpretable models are gaining increasing attention in the machine learning community, and significant progress is being made to develop simple, interpretable, yet powerful deep learning approaches. Generalized Additive Models (GAM) and Neural Additive Models (NAM) are prime examples. Despite these methods' great potential and popularity in critical applications, e.g., medical applications, they fail to generalize to distributions with more than one mode (multimodal\\footnote{In this paper, multimodal refers to the context of distributions, wherein a distribution possesses more than one mode.}). The main reason behind this limitation is that these \"all-fit-one\" models collapse multiple relationships by being forced to fit the data unimodally. We address this critical limitation by proposing interpretable multimodal network frameworks capable of learning a Mixture of Neural Additive Models (MNAM). The proposed MNAM learns relationships between input features and outputs in a multimodal fashion and assigns a probability to each mode. The proposed method shares similarities with Mixture Density Networks (MDN) while keeping the interpretability that characterizes GAM and NAM. We demonstrate how the proposed MNAM balances between rich representations and interpretability with numerous empirical observations and pedagogical studies. We present and discuss different training alternatives and provided extensive practical evaluation to assess the proposed framework. The code is available at \\href{https://github.com/youngkyungkim93/MNAM}{https://github.com/youngkyungkim93/MNAM}",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "e6bbd1042f603a777a0bd03f059d00a1e52a842a",
    "semantic_title": "generalizing neural wave functions",
    "citation_count": 10,
    "authors": [
      "Young Kyung Kim",
      "Juan Matias Di Martino",
      "Guillermo Sapiro"
    ]
  },
  "https://openreview.net/forum?id=5G3PI1hEdw": {
    "title": "A Joint Study of Phrase Grounding and Task Performance in Vision and Language Models",
    "volume": "main",
    "abstract": "Key to tasks that require reasoning about natural language in visual contexts is grounding words and phrases to image regions. However, observing this grounding in contemporary models is complex, even if it is generally expected to take place if the task is addressed in a way that is conductive to generalization. We propose a framework to jointly study task performance and phrase grounding, and propose three benchmarks to study the relation between the two. Our results show that contemporary models demonstrate inconsistency between their ability to ground phrases and solve tasks. We show how this can be addressed through brute-force training on ground phrasing annotations, and analyze the dynamics it creates. Code and data are available at https://github.com/lil-lab/phrase_grounding",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "b38a634a2902a333cce1f97789df03ae3189ed76",
    "semantic_title": "a joint study of phrase grounding and task performance in vision and language models",
    "citation_count": 1,
    "authors": [
      "Noriyuki Kojima",
      "Hadar Averbuch-Elor",
      "Yoav Artzi"
    ]
  },
  "https://openreview.net/forum?id=RwmWODTNFE": {
    "title": "Size Lowerbounds for Deep Operator Networks",
    "volume": "main",
    "abstract": "Deep Operator Networks are an increasingly popular paradigm for solving regression in infinite dimensions and hence solve families of PDEs in one shot. In this work, we aim to establish a first-of-its-kind data-dependent lowerbound on the size of DeepONets required for them to be able to reduce empirical error on noisy data. In particular, we show that for low training errors to be obtained on $n$ data points it is necessary that the common output dimension of the branch and the trunk net be scaling as $\\Omega \\left ( \\sqrt[\\leftroot{-1}\\uproot{-1}4]{n} \\right )$. This inspires our experiments with DeepONets solving the advection-diffusion-reaction PDE, where we demonstrate the possibility that at a fixed model size, to leverage increase in this common output dimension and get monotonic lowering of training error, the size of the training data might necessarily need to scale at least quadratically with it",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "cf80dd08c9a3783c62585203a71f50e6e1a238f8",
    "semantic_title": "size lowerbounds for deep operator networks",
    "citation_count": 1,
    "authors": [
      "Anirbit Mukherjee",
      "Amartya Roy"
    ]
  },
  "https://openreview.net/forum?id=0T2OTVCCC1": {
    "title": "Extending Path-Dependent NJ-ODEs to Noisy Observations and a Dependent Observation Framework",
    "volume": "main",
    "abstract": "The \\emph{Path-Dependent Neural Jump Ordinary Differential Equation (PD-NJ-ODE)} is a model for predicting continuous-time stochastic processes with irregular and incomplete observations. In particular, the method learns optimal forecasts given irregularly sampled time series of incomplete past observations. So far the process itself and the coordinate-wise observation times were assumed to be independent and observations were assumed to be noiseless. In this work we discuss two extensions to lift these restrictions and provide theoretical guarantees as well as empirical examples for them. In particular, we can lift the assumption of independence by extending the theory to much more realistic settings of conditional independence without any need to change the algorithm. Moreover, we introduce a new loss function, which allows us to deal with noisy observations and explain why the previously used loss function did not lead to a consistent estimator",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "4c384b8a6b5ff1550926eeddb8f32f7f77771469",
    "semantic_title": "extending path-dependent nj-odes to noisy observations and a dependent observation framework",
    "citation_count": 1,
    "authors": [
      "William Andersson",
      "Jakob Heiss",
      "Florian Krach",
      "Josef Teichmann"
    ]
  },
  "https://openreview.net/forum?id=3s7ior0WZ5": {
    "title": "Blind Biological Sequence Denoising with Self-Supervised Set Learning",
    "volume": "main",
    "abstract": "Biological sequence analysis relies on the ability to denoise the imprecise output of sequencing platforms. We consider a common setting where a short sequence is read out repeatedly using a high-throughput long-read platform to generate multiple subreads, or noisy obser- vations of the same sequence. Denoising these subreads with alignment-based approaches often fails when too few subreads are available or error rates are too high. In this paper, we propose a novel method for blindly denoising sets of sequences without directly observing clean source sequence labels. Our method, Self-Supervised Set Learning (SSSL), gathers subreads together in an embedding space and estimates a single set embedding as the mid- point of the subreads in both the latent and sequence spaces. This set embedding represents the \"average\" of the subreads and can be decoded into a prediction of the clean sequence. In experiments on simulated long-read DNA data, SSSL methods denoise small reads of ≤ 6 subreads with 17% fewer errors and large reads of > 6 subreads with 8% fewer errors compared to the best baseline. On a real dataset of antibody sequences, SSSL improves over baselines on two self-supervised metrics, with a significant improvement on difficult small reads that comprise over 60% of the test set. By accurately denoising these reads, SSSL promises to better realize the potential of high-throughput DNA sequencing data for downstream scientific applications",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "512d4baaacb28578464db7697a49ee5dcd69f915",
    "semantic_title": "blind biological sequence denoising with self-supervised set learning",
    "citation_count": 0,
    "authors": [
      "Nathan Hoyen Ng",
      "Ji Won Park",
      "Jae Hyeon Lee",
      "Ryan Lewis Kelly",
      "Stephen Ra",
      "Kyunghyun Cho"
    ]
  },
  "https://openreview.net/forum?id=wyU3Q4gahM": {
    "title": "Unsupervised Discovery of Steerable Factors When Graph Deep Generative Models Are Entangled",
    "volume": "main",
    "abstract": "Deep generative models (DGMs) have been widely developed for graph data. However, much less investigation has been carried out on understanding the latent space of such pretrained graph DGMs. These understandings possess the potential to provide constructive guidelines for crucial tasks, such as graph controllable generation. Thus in this work, we are interested in studying this problem and propose GraphCG, a method for the unsupervised discovery of steerable factors in the latent space of pretrained graph DGMs. We first examine the representation space of three pretrained graph DGMs with six disentanglement metrics, and we observe that the pretrained representation space is entangled. Motivated by this observation, GraphCG learns the steerable factors via maximizing the mutual information between semantic-rich directions, where the controlled graph moving along the same direction will share the same steerable factors. We quantitatively verify that GraphCG outperforms four competitive baselines on two graph DGMs pretrained on two molecule datasets. Additionally, we qualitatively illustrate seven steerable factors learned by GraphCG on five pretrained DGMs over five graph datasets, including two for molecules and three for point clouds",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "7856380962bcdd4a98ca7c8381dc7c80f963623e",
    "semantic_title": "unsupervised discovery of steerable factors when graph deep generative models are entangled",
    "citation_count": 0,
    "authors": [
      "Shengchao Liu",
      "Chengpeng Wang",
      "Jiarui Lu",
      "Weili Nie",
      "Hanchen Wang",
      "Zhuoxinran Li",
      "Bolei Zhou",
      "Jian Tang"
    ]
  },
  "https://openreview.net/forum?id=n2YifD4Dxo": {
    "title": "Are you using test log-likelihood correctly?",
    "volume": "main",
    "abstract": "Test log-likelihood is commonly used to compare different models of the same data or different approximate inference algorithms for fitting the same probabilistic model. We present simple examples demonstrating how comparisons based on test log-likelihood can contradict comparisons according to other objectives. Specifically, our examples show that (i) approximate Bayesian inference algorithms that attain higher test log-likelihoods need not also yield more accurate posterior approximations and (ii) conclusions about forecast accuracy based on test log-likelihood comparisons may not agree with conclusions based on root mean squared error",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "b6e363f617667014aea2d609136816fad22affc7",
    "semantic_title": "are you using test log-likelihood correctly?",
    "citation_count": 1,
    "authors": [
      "Sameer Deshpande",
      "Soumya Ghosh",
      "Tin D. Nguyen",
      "Tamara Broderick"
    ]
  },
  "https://openreview.net/forum?id=M2m618iIPk": {
    "title": "Blockwise Self-Supervised Learning at Scale",
    "volume": "main",
    "abstract": "Current state-of-the-art deep networks are all powered by backpropagation. However, long backpropagation paths as found in end-to-end training are biologically implausible, as well as inefficient in terms of energy consumption. In this paper, we explore alternatives to full backpropagation in the form of blockwise learning rules, leveraging the latest developments in self-supervised learning. We show that a blockwise pretraining procedure consisting of training independently the 4 main blocks of layers of a ResNet-50 with Barlow Twins' loss function at each block performs almost as well as end-to-end backpropagation on ImageNet: a linear probe trained on top of our blockwise pretrained model obtains a top-1 classification accuracy of 70.48\\%, only 1.1\\% below the accuracy of an end-to-end pretrained network (71.57\\% accuracy). We perform extensive experiments to understand the impact of different components within our method and explore a variety of adaptations of self-supervised learning to the blockwise paradigm, building an exhaustive understanding of the critical avenues for scaling local learning rules to large networks, with implications ranging from hardware design to neuroscience",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "a09a197325be3fb2e865692b164e8827042201d1",
    "semantic_title": "blockwise self-supervised learning at scale",
    "citation_count": 7,
    "authors": [
      "Shoaib Siddiqui",
      "David Krueger",
      "Yann LeCun",
      "Stephane Deny"
    ]
  },
  "https://openreview.net/forum?id=zSeoG5dRHK": {
    "title": "Temporally Rich Deep Learning Models for Magnetoencephalography",
    "volume": "main",
    "abstract": "Deep learning has been used in a wide range of applications, but it has only very recently been applied to Magnetoencephalography (MEG). MEG is a neurophysiological technique used to investigate a variety of cognitive processes such as language and learning, and an emerging technology in the quest to identify neural correlates of cognitive impairments such as those occurring in dementia. Recent work has shown that it is possible to apply deep learning to MEG to categorise induced responses to stimuli across subjects. While novel in the application of deep learning, such work has generally used relatively simple neural network (NN) models compared to those being used in domains such as computer vision and natural language processing. In these other domains, there is a long history in developing complex NN models that combine spatial and temporal information. We propose more complex NN models that focus on modelling temporal relationships in the data, and apply them to the challenges of MEG data. We apply these models to an extended range of MEG-based tasks, and find that they substantially outperform existing work on a range of tasks, particularly but not exclusively temporally-oriented ones. We also show that an autoencoder-based preprocessing component that focuses on the temporal aspect of the data can improve the performance of existing models. Our source code is available at https://github.com/tim-chard/DeepLearningForMEG",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "d05a8b09e7bd605ff964afba97b00b19cd8bce6d",
    "semantic_title": "towards global glacier mapping with deep learning and open earth observation data",
    "citation_count": 0,
    "authors": [
      "Tim Chard",
      "Mark Dras",
      "Paul Sowman",
      "Steve Cassidy",
      "Jia Wu"
    ]
  },
  "https://openreview.net/forum?id=KhMLfEIoUm": {
    "title": "Disciplined Saddle Programming",
    "volume": "main",
    "abstract": "We consider convex-concave saddle point problems, and more generally convex optimization problems we refer to as saddle problems, which include the partial supremum or infimum of convex-concave saddle functions. Saddle problems arise in a wide range of applications, including game theory, machine learning, and finance. It is well known that a saddle problem can be reduced to a single convex optimization problem by dualizing either the convex (min) or concave (max) objectives, reducing a min-max problem into a min-min (or max-max) problem. Carrying out this conversion by hand can be tedious and error prone. In this paper we introduce disciplined saddle programming (DSP), a domain specific language (DSL) for specifying saddle problems, for which the dualizing trick can be automated. The language and methods are based on recent work by Juditsky and Nemirovski, who developed the idea of conic-representable saddle point programs, and showed how to carry out the required dualization automatically using conic duality. Juditsky and Nemirovski's conic representation of saddle problems extends Nesterov and Nemirovski's earlier development of conic representable convex problems; DSP can be thought of as extending disciplined convex programming (DCP) to saddle problems. Just as DCP makes it easy for users to formulate and solve complex convex problems, DSP allows users to easily formulate and solve saddle problems. Our method is implemented in an open-source package, also called DSP",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "3e544c28b964c434885dee829b7c83ab3814d0f0",
    "semantic_title": "disciplined saddle programming",
    "citation_count": 4,
    "authors": [
      "Philipp Schiele",
      "Eric Sager Luxenberg",
      "Stephen P. Boyd"
    ]
  },
  "https://openreview.net/forum?id=Sj7bFPeR6W": {
    "title": "Federated Sampling with Langevin Algorithm under Isoperimetry",
    "volume": "main",
    "abstract": "Federated learning uses a set of techniques to efficiently distribute the training of a machine learning algorithm across several devices, who own the training data. These techniques critically rely on reducing the communication cost---the main bottleneck---between the devices and a central server. Federated learning algorithms usually take an optimization approach: they are algorithms for minimizing the training loss subject to communication (and other) constraints. In this work, we instead take a Bayesian approach for the training task, and propose a communication-efficient variant of the Langevin algorithm to sample \\textit{a posteriori}. The latter approach is more robust and provides more knowledge of the \\textit{a posteriori} distribution than its optimization counterpart. We analyze our algorithm without assuming that the target distribution is strongly log-concave. Instead, we assume the weaker log Sobolev inequality, which allows for nonconvexity",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "a61bd279b52cccdd338e007fcfb6a379778e9308",
    "semantic_title": "federated learning with a sampling algorithm under isoperimetry",
    "citation_count": 5,
    "authors": [
      "Lukang Sun",
      "Adil Salim",
      "Peter Richtárik"
    ]
  },
  "https://openreview.net/forum?id=rQqzt4gYcc": {
    "title": "TensorVAE: a simple and efficient generative model for conditional molecular conformation generation",
    "volume": "main",
    "abstract": "Efficient generation of 3D conformations of a molecule from its 2D graph is a key challenge in in-silico drug discovery. Deep learning (DL) based generative modelling has recently become a potent tool to tackling this challenge. However, many existing DL-based methods are either indirect–leveraging inter-atomic distances or direct–but requiring numerous sampling steps to generate conformations. In this work, we propose a simple model abbreviated TensorVAE capable of generating conformations directly from a 2D molecular graph in a single step. The main novelty of the proposed method is focused on feature engineering. We develop a novel encoding and feature extraction mechanism relying solely on standard convolution operation to generate token-like feature vector for each atom. These feature vectors are then transformed through standard transformer encoders under a conditional Variational Autoencoder framework for generating conformations directly. We show through experiments on two benchmark datasets that with intuitive feature engineering, a relatively simple and standard model can provide promising generative capability outperforming more than a dozen state-of-the-art models employing more sophisticated and specialized generative architecture",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Hongyang Yu",
      "Hongjiang Yu"
    ]
  },
  "https://openreview.net/forum?id=qyfz0QrkqP": {
    "title": "PixMIM: Rethinking Pixel Reconstruction in Masked Image Modeling",
    "volume": "main",
    "abstract": "Masked Image Modeling (MIM) has achieved promising progress with the advent of Masked Autoencoders (MAE) and BEiT. However, subsequent works have complicated the framework with new auxiliary tasks or extra pre-trained models, inevitably increasing computational overhead. This paper undertakes a fundamental analysis of MIM from the perspective of pixel reconstruction, which examines the input image patches and reconstruction target, and highlights two critical but previously overlooked bottlenecks. Based on this analysis, we propose a remarkably simple and effective method, PixMIM, that entails two strategies: 1) filtering the high-frequency components from the reconstruction target to de-emphasize the network's focus on texture-rich details and 2) adopting a conservative data transform strategy to alleviate the problem of missing foreground in MIM training. PixMIM can be easily integrated into most existing pixel-based MIM approaches (i.e., using raw images as reconstruction target) with negligible additional computation. Without bells and whistles, our method consistently improves four MIM approaches, MAE, MFF, ConvMAE, and LSMAE, across various downstream tasks. We believe this effective plug-and-play method will serve as a strong baseline for self-supervised learning and provide insights for future improvements of the MIM framework. Code and models will be available",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "0a84577447a81d34aa9363a6790a65eb600f8384",
    "semantic_title": "pixmim: rethinking pixel reconstruction in masked image modeling",
    "citation_count": 7,
    "authors": [
      "Yuan Liu",
      "Songyang Zhang",
      "Jiacheng Chen",
      "Kai Chen",
      "Dahua Lin"
    ]
  },
  "https://openreview.net/forum?id=eN9CjU3h1b": {
    "title": "MMD-Regularized Unbalanced Optimal Transport",
    "volume": "main",
    "abstract": "We study the unbalanced optimal transport (UOT) problem, where the marginal constraints are enforced using Maximum Mean Discrepancy (MMD) regularization. Our work is motivated by the observation that the literature on UOT is focused on regularization based on $\\phi$-divergence (e.g., KL divergence). Despite the popularity of MMD, its role as a regularizer in the context of UOT seems less understood. We begin by deriving a specific dual of MMD-regularized UOT (MMD-UOT), which helps us prove several useful properties. One interesting outcome of this duality result is that MMD-UOT induces novel metrics, which not only lift the ground metric like the Wasserstein but are also sample-wise efficient to estimate like the MMD. Further, for real-world applications involving non-discrete measures, we present an estimator for the transport plan that is supported only on the given ($m$) samples. Under certain conditions, we prove that the estimation error with this finitely-supported transport plan is also $\\mathcal{O}(1/\\sqrt{m})$. As far as we know, such error bounds that are free from the curse of dimensionality are not known for $\\phi$-divergence regularized UOT. Finally, we discuss how the proposed estimator can be computed efficiently using accelerated gradient descent. Our experiments show that MMD-UOT consistently outperforms popular baselines, including KL-regularized UOT and MMD, in diverse machine learning applications",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "04b067014849852f1ffd8ca240436522e202c0af",
    "semantic_title": "unbalanced low-rank optimal transport solvers",
    "citation_count": 1,
    "authors": [
      "Piyushi Manupriya",
      "SakethaNath Jagarlapudi",
      "Pratik Jawanpuria"
    ]
  },
  "https://openreview.net/forum?id=oGIR0ic3jU": {
    "title": "Bandits Corrupted by Nature: Lower Bounds on Regret and Robust Optimistic Algorithms",
    "volume": "main",
    "abstract": "We study the corrupted bandit problem, i.e. a stochastic multi-armed bandit problem with $k$ unknown reward distributions, which are heavy-tailed and corrupted by a history-independent adversary or Nature. To be specific, the reward obtained by playing an arm comes from corresponding heavy-tailed reward distribution with probability $1-\\varepsilon \\in (0.5,1]$ and an arbitrary corruption distribution of unbounded support with probability $\\varepsilon \\in [0,0.5)$. First, we provide \\textit{a problem-dependent lower bound on the regret} of any corrupted bandit algorithm. The lower bounds indicate that the corrupted bandit problem is harder than the classical stochastic bandit problem with subGaussian or heavy-tail rewards. Following that, we propose a novel UCB-type algorithm for corrupted bandits, namely \\texttt{HubUCB}, that builds on Huber's estimator for robust mean estimation. Leveraging a novel concentration inequality of Huber's estimator, we prove that \\texttt{HubUCB} achieves a near-optimal regret upper bound. Since computing Huber's estimator has quadratic complexity, we further introduce a sequential version of Huber's estimator that exhibits linear complexity. We leverage this sequential estimator to design \\texttt{SeqHubUCB} that enjoys similar regret guarantees while reducing the computational burden. Finally, we experimentally illustrate the efficiency of \\texttt{HubUCB} and \\texttt{SeqHubUCB} in solving corrupted bandits for different reward distributions and different levels of corruptions",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "71be523a35f799fb7d5bf9278f386d6cdb65b34d",
    "semantic_title": "bandits corrupted by nature: lower bounds on regret and robust optimistic algorithm",
    "citation_count": 4,
    "authors": [
      "Timothée Mathieu",
      "Debabrota Basu",
      "Odalric-Ambrym Maillard"
    ]
  },
  "https://openreview.net/forum?id=eTgxr7gPuU": {
    "title": "High-dimensional Bayesian Optimization via Covariance Matrix Adaptation Strategy",
    "volume": "main",
    "abstract": "Bayesian Optimization (BO) is an effective method for finding the global optimum of expensive black-box functions. However, it is well known that applying BO to high-dimensional optimization problems is challenging. To address this issue, a promising solution is to use a local search strategy that partitions the search domain into local regions with high likelihood of containing the global optimum, and then use BO to optimize the objective function within these regions. In this paper, we propose a novel technique for defining the local regions using the Covariance Matrix Adaptation (CMA) strategy. Specifically, we use CMA to learn a search distribution that can estimate the probabilities of data points being the global optimum of the objective function. Based on this search distribution, we then define the local regions consisting of data points with high probabilities of being the global optimum. Our approach serves as a meta-algorithm as it can incorporate existing black-box BO optimizers, such as BO, TuRBO, and BAxUS, to find the global optimum of the objective function within our derived local regions. We evaluate our proposed method on various benchmark synthetic and real-world problems. The results demonstrate that our method outperforms existing state-of-the-art techniques",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "7c1ee8b8c4065b0ae6a81946696b6bc72e1514d7",
    "semantic_title": "high-dimensional bayesian optimization via covariance matrix adaptation strategy",
    "citation_count": 0,
    "authors": [
      "Lam Ngo",
      "Huong Ha",
      "Jeffrey Chan",
      "Vu Nguyen",
      "Hongyu Zhang"
    ]
  },
  "https://openreview.net/forum?id=cvOpIhQQMN": {
    "title": "A general framework for formulating structured variable selection",
    "volume": "main",
    "abstract": "In variable selection, a selection rule that prescribes the permissible sets of selected variables (called a \"selection dictionary\") is desirable due to the inherent structural constraints among the candidate variables. Such selection rules can be complex in real-world data analyses, and failing to incorporate such restrictions could not only compromise the interpretability of the model but also lead to decreased prediction accuracy. However, no general framework has been proposed to formalize selection rules and their applications, which poses a significant challenge for practitioners seeking to integrate these rules into their analyses. In this work, we establish a framework for structured variable selection that can incorporate universal structural constraints. We develop a mathematical language for constructing arbitrary selection rules, where the selection dictionary is formally defined. We demonstrate that all selection rules can be expressed as combinations of operations on constructs, facilitating the identification of the corresponding selection dictionary. We use a detailed and complex example to illustrate the developed framework. Once this selection dictionary is derived, practitioners can apply their own user-defined criteria to select the optimal model. Additionally, our framework enhances existing penalized regression methods for variable selection by providing guidance on how to appropriately group variables to achieve the desired selection rule. Furthermore, our innovative framework opens the door to establishing new $\\ell_0$-based penalized regression techniques that can be tailored to respect arbitrary selection rules, thereby expanding the possibilities for more robust and tailored model development",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "300a0c3e03c00714f292a29708ac5a9e46956b25",
    "semantic_title": "a machine learning framework for neighbor generation in metaheuristic search",
    "citation_count": 1,
    "authors": [
      "GUANBO WANG",
      "Mireille Schnitzer",
      "Tom Chen",
      "Rui Wang",
      "Robert W Platt"
    ]
  },
  "https://openreview.net/forum?id=gllUnpYuXg": {
    "title": "Towards fully covariant machine learning",
    "volume": "main",
    "abstract": "Any representation of data involves arbitrary investigator choices. Because those choices are external to the data-generating process, each choice leads to an exact symmetry, corresponding to the group of transformations that takes one possible representation to another. These are the passive symmetries; they include coordinate freedom, gauge symmetry, and units covariance, all of which have led to important results in physics. In machine learning, the most visible passive symmetry is the relabeling or permutation symmetry of graphs. The active symmetries are those that must be established by observation and experiment. They include, for instance, translations invariances or rotation invariances of physical law. These symmetries are the subject of most of the equivariant machine learning literature. Our goal, in this conceptual contribution, is to understand the implications for machine learning of the many passive and active symmetries in play. We discuss dos and don'ts for machine learning practice if passive symmetries are to be respected. We discuss links to causal modeling and argue that the implementation of passive symmetries is particularly valuable when the goal of the learning problem is to generalize out of sample. We conjecture that the implementation of passive symmetries might help machine learning in the same ways that it transformed physics in the twentieth century",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "f6fe532c25cd480a66f097ac1f1f9e53a7a55d26",
    "semantic_title": "towards fully covariant machine learning",
    "citation_count": 0,
    "authors": [
      "Soledad Villar",
      "David W Hogg",
      "Weichi Yao",
      "George A Kevrekidis",
      "Bernhard Schölkopf"
    ]
  },
  "https://openreview.net/forum?id=VDy6LgErFM": {
    "title": "Empowering GNNs via Edge-Aware Weisfeiler-Leman Algorithm",
    "volume": "main",
    "abstract": "Message passing graph neural networks (GNNs) are known to have their expressiveness upper-bounded by 1-dimensional Weisfeiler-Leman (1-WL) algorithm. To achieve more powerful GNNs, existing attempts either require \\emph{ad hoc} features, or involve operations that incur high time and space complexities. In this work, we propose a \\textit{general} and \\textit{provably powerful} GNN framework that preserves the \\textit{scalability} of the message passing scheme. In particular, we first propose to empower 1-WL for graph isomorphism test by considering edges among neighbors, giving rise to NC-1-WL. The expressiveness of NC-1-WL is shown to be strictly above 1-WL and below 3-WL theoretically. Further, we propose the NC-GNN framework as a differentiable neural version of NC-1-WL. Our simple implementation of NC-GNN is provably as powerful as NC-1-WL. Experiments demonstrate that our NC-GNN performs effectively and efficiently on various benchmarks",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "5036b6ddd2e19e601cc391b516daab0ba7e63761",
    "semantic_title": "empowering gnns via edge-aware weisfeiler-leman algorithm",
    "citation_count": 0,
    "authors": [
      "Meng Liu",
      "Haiyang Yu",
      "Shuiwang Ji"
    ]
  },
  "https://openreview.net/forum?id=BNP4MxzDEI": {
    "title": "To Transfer or Not to Transfer: Suppressing Concepts from Source Representations",
    "volume": "main",
    "abstract": "With the proliferation of large pre-trained models in various domains, transfer learning has gained prominence where intermediate representations from these models can be leveraged to train better (target) task-specific models, with possibly limited labeled data. Although transfer learning can be beneficial in many applications, it can transfer undesirable information to target tasks that may severely curtail its performance in the target domain or raise ethical concerns related to privacy and/or fairness. In this paper, we propose a novel approach for suppressing the transfer of user-determined semantic concepts (viz. color, glasses, etc.) in intermediate source representations to target tasks without retraining the source model which can otherwise be expensive or even infeasible. Notably, we tackle a bigger challenge in the input data as a given intermediate source representation is biased towards the source task, thus possibly further entangling the desired concepts. We evaluate our approach qualitatively and quantitatively in the visual domain showcasing its efficacy for classification and generative source models. Finally, we provide a concept selection approach that automatically suppresses the undesirable concepts",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Vijay Sadashivaiah",
      "Keerthiram Murugesan",
      "Ronny Luss",
      "Pin-Yu Chen",
      "Chris Sims",
      "James Hendler",
      "Amit Dhurandhar"
    ]
  },
  "https://openreview.net/forum?id=DPvwr4HJdt": {
    "title": "On the Choice of Learning Rate for Local SGD",
    "volume": "main",
    "abstract": "Distributed data-parallel optimization accelerates the training of neural networks, but requires constant synchronization of gradients between the workers, which can become a bottleneck. One way to reduce communication overhead is to use Local SGD, where each worker asynchronously takes multiple local gradient steps, after which the model weights are averaged. In this work, we discuss the choice of learning rate for Local SGD, showing that it faces an intricate trade-off. Unlike in the synchronous case, its gradient estimate is biased, with the bias dependent on the learning rate itself. Thus using learning rate scaling techniques designed for faster convergence in the synchronous case with Local SGD results in a performance degradation as previously observed. To analyze the manifestation of this bias, we study convergence behaviour of Local SGD and synchronous data-parallel SGD when using their optimal learning rates. Our experiments show that the optimal learning rate for Local SGD differs substantially from that of SGD, and when using it the performance of Local SGD matches that of SGD. However, this performance comes at the cost of added training iterations, rendering Local SGD faster than SGD only when communication is much more time-consuming than computation. This suggests that Local SGD may be of limited practical utility",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Lukas Balles",
      "Prabhu Teja S",
      "Cedric Archambeau"
    ]
  },
  "https://openreview.net/forum?id=bfsNmgN5je": {
    "title": "Semantic similarity prediction is better than other semantic similarity measures",
    "volume": "main",
    "abstract": "Semantic similarity between natural language texts is typically measured either by looking at the overlap between subsequences (e.g., BLEU) or by using embeddings (e.g., BERTScore, S-BERT). Within this paper, we argue that when we are only interested in measuring the semantic similarity, it is better to directly predict the similarity using a fine-tuned model for such a task. Using a fine-tuned model for the Semantic Textual Similarity Benchmark tasks (STS-B) from the GLUE benchmark, we define the STSScore approach and show that the resulting similarity is better aligned with our expectations on a robust semantic similarity measure than other approaches",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "96bfa287ace006d6b9fd9a73a84571e6c8cb7908",
    "semantic_title": "semantic similarity prediction is better than other semantic similarity measures",
    "citation_count": 0,
    "authors": [
      "Steffen Herbold"
    ]
  },
  "https://openreview.net/forum?id=R7H43YD6Lo": {
    "title": "Prismer: A Vision-Language Model with Multi-Task Experts",
    "volume": "main",
    "abstract": "Recent vision-language models have shown impressive multi-modal generation capabilities. However, typically they require training huge models on massive datasets. As a more scalable alternative, we introduce Prismer, a data- and parameter-efficient vision-language model that leverages an ensemble of task-specific experts. Prismer only requires training of a small number of components, with the majority of network weights inherited from multiple readily-available, pre-trained experts, and kept frozen during training. By leveraging experts from a wide range of domains, we show Prismer can efficiently pool this expert knowledge and adapt it to various vision-language reasoning tasks. In our experiments, we show that Prismer achieves fine-tuned and few-shot learning performance which is competitive with current state-of-the-arts, whilst requiring up to two orders of magnitude less training data. Code is available at https://github.com/NVlabs/prismer",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "f02d56e630986997e0aea3d92bf53e0f363ce401",
    "semantic_title": "prismer: a vision-language model with multi-task experts",
    "citation_count": 21,
    "authors": [
      "Shikun Liu",
      "Linxi Fan",
      "Edward Johns",
      "Zhiding Yu",
      "Chaowei Xiao",
      "Anima Anandkumar"
    ]
  },
  "https://openreview.net/forum?id=4i1MXH8Sle": {
    "title": "CAREER: A Foundation Model for Labor Sequence Data",
    "volume": "main",
    "abstract": "Labor economists regularly analyze employment data by fitting predictive models to small, carefully constructed longitudinal survey datasets. Although machine learning methods offer promise for such problems, these survey datasets are too small to take advantage of them. In recent years large datasets of online resumes have also become available, providing data about the career trajectories of millions of individuals. However, standard econometric models cannot take advantage of their scale or incorporate them into the analysis of survey data. To this end we develop CAREER, a foundation model for job sequences. CAREER is first fit to large, passively-collected resume data and then fine-tuned to smaller, better-curated datasets for economic inferences. We fit CAREER to a dataset of 24 million job sequences from resumes, and adjust it on small longitudinal survey datasets. We find that CAREER forms accurate predictions of job sequences, outperforming econometric baselines on three widely-used economics datasets. We further find that CAREER can be used to form good predictions of other downstream variables. For example, incorporating CAREER into a wage model provides better predictions than the econometric models currently in use",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Keyon Vafa",
      "Emil Palikot",
      "Tianyu Du",
      "Ayush Kanodia",
      "Susan Athey",
      "David Blei"
    ]
  },
  "https://openreview.net/forum?id=z3ZlnaOM0d": {
    "title": "Hyperspherical Prototype Node Clustering",
    "volume": "main",
    "abstract": "The general workflow of deep node clustering is to encode the nodes into node embeddings via graph neural networks and uncover clustering decisions from them, so clustering performance is heavily affected by the embeddings. However, existing works only consider preserving the semantics of the graph but ignore the inter-cluster separability of the nodes, so there's no guarantee that the embeddings can present a clear clustering structure. To remedy this deficiency, we propose Hyperspherical Prototype Node Clustering (HPNC), an end-to-end clustering paradigm that explicitly enhances the inter-cluster separability of learned node embeddings. Concretely, we constrain the embedding space to a unit-hypersphere, enabling us to scatter the cluster prototypes over the space with maximized pairwise distances. Then, we employ a graph autoencoder to map nodes onto the same hypersphere manifold. Consequently, cluster affinities can be directly retrieved from cosine similarities between node embeddings and prototypes. A clustering-oriented loss is imposed to sharpen the affinity distribution so that the learned node embeddings are encouraged to have small intra-cluster distances and large inter-cluster distances. Based on the proposed HPNC paradigm, we devise two schemes (HPNC-IM and HPNC-DEC) with distinct clustering backbones. Empirical results on popular benchmark datasets demonstrate the superiority of our method compared to other state-of-the-art clustering methods, and visualization results illustrate improved separability of the learned embeddings",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "b6dccff36f94daca36c7455517eff1b1fc317f84",
    "semantic_title": "hyperspherical prototype node clustering",
    "citation_count": 0,
    "authors": [
      "Jitao Lu",
      "Danyang Wu",
      "Feiping Nie",
      "Rong Wang",
      "Xuelong Li"
    ]
  },
  "https://openreview.net/forum?id=rFecyFpFUp": {
    "title": "AdaFed: Fair Federated Learning via Adaptive Common Descent Direction",
    "volume": "main",
    "abstract": "Federated learning (FL) is a promising technology via which some edge devices/clients collaboratively train a machine learning model orchestrated by a server. Learning an unfair model is known as a critical problem in federated learning, where the trained model may unfairly advantage or disadvantage some of the devices. To tackle this problem, in this work, we propose AdaFed. The goal of AdaFed is to find an updating direction for the server along which (i) all the clients' loss functions are decreasing; and (ii) more importantly, the loss functions for the clients with larger values decrease with a higher rate. AdaFed adaptively tunes this common direction based on the values of local gradients and loss functions. We validate the effectiveness of AdaFed on a suite of federated datasets, and demonstrate that AdaFed outperforms state-of-the-art fair FL methods",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "f87c32ce9af0da40a49382810f9f79e679f17b2f",
    "semantic_title": "adafed: fair federated learning via adaptive common descent direction",
    "citation_count": 0,
    "authors": [
      "Shayan Mohajer Hamidi",
      "EN-HUI YANG"
    ]
  },
  "https://openreview.net/forum?id=nzG9KGssSe": {
    "title": "Variational autoencoder with weighted samples for high-dimensional non-parametric adaptive importance sampling",
    "volume": "main",
    "abstract": "Adaptive importance sampling is a well-known family of algorithms for density approximation, generation and Monte Carlo integration including rare event estimation. The main common denominator of this family of algorithms is to perform density estimation with weighted samples at each iteration. However, the classical existing methods to do so, such as kernel smoothing or approximation by a Gaussian distribution, suffer from the curse of dimensionality and/or a lack of flexibility. Both are limitations in high dimension and when we do not have any prior knowledge on the form of the target distribution, such as its number of modes. Variational autoencoders are probabilistic tools able to represent with fidelity high-dimensional data in a lower dimensional space. They constitute a parametric family of distributions robust faced to the dimension and since they are based on deep neural networks, they are flexible enough to be considered as non-parametric models. In this paper, we propose to use a variational autoencoder as the auxiliary importance sampling distribution by extending the existing framework to weighted samples. We integrate the proposed procedure in existing adaptive importance sampling algorithms and we illustrate its practical interest on diverse examples",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "e1a08b6a72895499c5609cee6de40ea4bf9cf281",
    "semantic_title": "variational autoencoder with weighted samples for high-dimensional non-parametric adaptive importance sampling",
    "citation_count": 0,
    "authors": [
      "Julien Demange-Chryst",
      "Francois Bachoc",
      "Jérôme Morio",
      "Timothé Krauth"
    ]
  },
  "https://openreview.net/forum?id=ALRWXT1RLZ": {
    "title": "Separability Analysis for Causal Discovery in Mixture of DAGs",
    "volume": "main",
    "abstract": "Directed acyclic graphs (DAGs) are effective for compactly representing causal systems and specifying the causal relationships among the system's constituents. Specifying such causal relationships in some systems requires a mixture of multiple DAGs -- a single DAG is insufficient. Some examples include time-varying causal systems or aggregated subgroups of a population. Recovering the causal structure of the systems represented by single DAGs is investigated extensively, but it remains mainly open for the systems represented by a mixture of DAGs. A major difference between single- versus mixture-DAG recovery is the existence of node pairs that are separable in the individual DAGs but become inseparable in their mixture. This paper provides the theoretical foundations for analyzing such inseparable node pairs. Specifically, the notion of \\emph{emergent edges} is introduced to represent such inseparable pairs that do not exist in the single DAGs but emerge in their mixtures. Necessary conditions for identifying the emergent edges are established. Operationally, these conditions serve as sufficient conditions for separating a pair of nodes in the mixture of DAGs. These results are further extended, and matching necessary and sufficient conditions for identifying the emergent edges in tree-structured DAGs are established. Finally, a novel graphical representation is formalized to specify these conditions, and an algorithm is provided for inferring the learnable causal relations",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Burak Varici",
      "Dmitriy Katz",
      "Dennis Wei",
      "Prasanna Sattigeri",
      "Ali Tajer"
    ]
  },
  "https://openreview.net/forum?id=0CM7Hfsy61": {
    "title": "Unleashing the Potential of Acquisition Functions in High-Dimensional Bayesian Optimization",
    "volume": "main",
    "abstract": "Bayesian optimization (BO) is widely used to optimize expensive-to-evaluate black-box functions. It first builds a surrogate for the objective and quantifies its uncertainty. It then decides where to sample by maximizing an acquisition function (AF) defined by the surrogate model. However, when dealing with high-dimensional problems, finding the global maximum of the AF becomes increasingly challenging. In such cases, the manner in which the AF maximizer is initialized plays a pivotal role. An inappropriate initialization can severely limit the potential of AF. This paper investigates a largely understudied problem concerning the impact of AF maximizer initialization on exploiting AFs' capability. Our large-scale empirical study shows that the widely used random initialization strategy may fail to harness the potential of an AF. Based on this observation, we propose a better initialization approach by employing multiple heuristic optimizers to leverage the historical data of black-box optimization to generate initial points for an AF maximizer. We evaluate our approach with a variety of heavily studied synthetic test functions and real-world applications. Experimental results show that our techniques, while simple, can significantly enhance the standard BO and outperform state-of-the-art methods by a large margin in most test cases",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "d6600d43daaaeaad75e343a1a4bc8de16e9b0a79",
    "semantic_title": "unleashing the potential of acquisition functions in high-dimensional bayesian optimization",
    "citation_count": 1,
    "authors": [
      "Jiayu Zhao",
      "Renyu Yang",
      "SHENGHAO QIU",
      "Zheng Wang"
    ]
  },
  "https://openreview.net/forum?id=6SofFlwhEv": {
    "title": "On the Adversarial Robustness of Camera-based 3D Object Detection",
    "volume": "main",
    "abstract": "In recent years, camera-based 3D object detection has gained widespread attention for its ability to achieve high performance with low computational cost. However, the robustness of these methods to adversarial attacks has not been thoroughly examined, especially when considering their deployment in safety-critical domains like autonomous driving. In this study, we conduct the first comprehensive investigation of the robustness of leading camera-based 3D object detection approaches under various adversarial conditions. We systematically analyze the resilience of these models under two attack settings: white-box and black-box; focusing on two primary objectives: classification and localization. Additionally, we delve into two types of adversarial attack techniques: pixel-based and patch-based. Our experiments yield four interesting findings: (a) bird's-eye-view-based representations exhibit stronger robustness against localization attacks; (b) depth-estimation-free approaches have the potential to show stronger robustness; (c) accurate depth estimation effectively improves robustness for depth-estimation-based methods; (d) incorporating multi-frame benign inputs can effectively mitigate adversarial attacks. We hope our findings can steer the development of future camera-based object detection models with enhanced adversarial robustness. The code is available at: https://github.com/Daniel-xsy/BEV-Attack",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Shaoyuan Xie",
      "Zichao Li",
      "Zeyu Wang",
      "Cihang Xie"
    ]
  },
  "https://openreview.net/forum?id=txpYITR8oa": {
    "title": "AmbientFlow: Invertible generative models from incomplete, noisy measurements",
    "volume": "main",
    "abstract": "Generative models have gained popularity for their potential applications in imaging science, such as image reconstruction, posterior sampling and data sharing. Flow-based generative models are particularly attractive due to their ability to tractably provide exact density estimates along with fast, inexpensive and diverse samples. Training such models, however, requires a large, high quality dataset of objects. In applications such as computed imaging, it is often difficult to acquire such data due to requirements such as long acquisition time or high radiation dose, while acquiring noisy or partially observed measurements of these objects is more feasible. In this work, we propose AmbientFlow, a framework for learning flow-based generative models directly from noisy and incomplete data. Using variational Bayesian methods, a novel framework for establishing flow-based generative models from noisy, incomplete data is proposed. Extensive numerical studies demonstrate the effectiveness of AmbientFlow in learning the object distribution. The utility of AmbientFlow in a downstream inference task of image reconstruction is demonstrated",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "1356a03fcbcbfa9b5a60ccdfbd6310dcbe3ac4c1",
    "semantic_title": "ambientflow: invertible generative models from incomplete, noisy measurements",
    "citation_count": 0,
    "authors": [
      "Varun A. Kelkar",
      "Rucha Deshpande",
      "Arindam Banerjee",
      "Mark Anastasio"
    ]
  },
  "https://openreview.net/forum?id=fovUNTilp9": {
    "title": "Multi-Horizon Representations with Hierarchical Forward Models for Reinforcement Learning",
    "volume": "main",
    "abstract": "Learning control from pixels is difficult for reinforcement learning (RL) agents because representation learning and policy learning are intertwined. Previous approaches remedy this issue with auxiliary representation learning tasks, but they either do not consider the temporal aspect of the problem or only consider single-step transitions, which may cause learning inefficiencies if important environmental changes take many steps to manifest. We propose Hierarchical $k$-Step Latent (HKSL), an auxiliary task that learns multiple representations via a hierarchy of forward models that learn to communicate and an ensemble of $n$-step critics that all operate at varying magnitudes of step skipping. We evaluate HKSL in a suite of 30 robotic control tasks with and without distractors and a task of our creation. We find that HKSL either converges to higher or optimal episodic returns more quickly than several alternative representation learning approaches. Furthermore, we find that HKSL's representations capture task-relevant details accurately across timescales (even in the presence of distractors) and that communication channels between hierarchy levels organize information based on both sides of the communication process, both of which improve sample efficiency",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "50dc64ab218420b121da5c956371b2d35d1a2ae2",
    "semantic_title": "multi-horizon representations with hierarchical forward models for reinforcement learning",
    "citation_count": 1,
    "authors": [
      "Trevor McInroe",
      "Lukas Schäfer",
      "Stefano V Albrecht"
    ]
  },
  "https://openreview.net/forum?id=aYkYajcJDN": {
    "title": "Neural Task Synthesis for Visual Programming",
    "volume": "main",
    "abstract": "Generative neural models hold great promise in enhancing programming education by synthesizing new content. We seek to design neural models that can automatically generate programming tasks for a given specification in the context of visual programming domains. Despite the recent successes of large generative models like GPT-4, our initial results show that these models are ineffective in synthesizing visual programming tasks and struggle with logical and spatial reasoning. We propose a novel neuro-symbolic technique, NeurTaskSyn, that can synthesize programming tasks for a specification given in the form of desired programming concepts exercised by its solution code and constraints on the visual task. NeurTaskSyn has two components: the first component is trained via imitation learning procedure to generate possible solution codes, and the second component is trained via reinforcement learning procedure to guide an underlying symbolic execution engine that generates visual tasks for these codes. We demonstrate the effectiveness of NeurTaskSyn through an extensive empirical evaluation and a qualitative study on reference tasks taken from the Hour of Code: Classic Maze challenge by Code.org and the Intro to Programming with Karel course by CodeHS.com",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "59a4a5db0a913b99b7afe1c6b2bf6e24f0d31857",
    "semantic_title": "neural task synthesis for visual programming",
    "citation_count": 7,
    "authors": [
      "Victor-Alexandru Pădurean",
      "Georgios Tzannetos",
      "Adish Singla"
    ]
  },
  "https://openreview.net/forum?id=umggDfMHha": {
    "title": "Federated Classification in Hyperbolic Spaces via Secure Aggregation of Convex Hulls",
    "volume": "main",
    "abstract": "Hierarchical and tree-like data sets arise in many relevant applications, including language processing, graph data mining, phylogeny and genomics. It is known that tree-like data cannot be embedded into Euclidean spaces of finite dimension with small distortion, and that this problem can be mitigated through the use of hyperbolic spaces. When such data also has to be processed in a distributed and privatized setting, it becomes necessary to work with new federated learning methods tailored to hyperbolic spaces. As an initial step towards the development of the field of federated learning in hyperbolic spaces, we propose the first known approach to federated classification in hyperbolic spaces. Our contributions are as follows. First, we develop distributed versions of convex SVM classifiers for Poincar\\'e discs. In this setting, the information conveyed from clients to the global classifier are convex hulls of clusters present in individual client data. Second, to avoid label switching issues, we introduce a number-theoretic approach for label recovery based on the so-called integer $B_h$ sequences. Third, we compute the complexity of the convex hulls in hyperbolic spaces to assess the extent of data leakage; at the same time, in order to limit the communication cost for the hulls, we propose a new quantization method for the Poincar\\'e disc coupled with Reed-Solomon-like encoding. Fourth, at the server level, we introduce a new approach for aggregating convex hulls of the clients based on balanced graph partitioning. We test our method on a collection of diverse data sets, including hierarchical single-cell RNA-seq data from different patients distributed across different repositories that have stringent privacy constraints. The classification accuracy of our method is up to $\\sim11\\%$ better than its Euclidean counterpart, demonstrating the importance of privacy-preserving learning in hyperbolic spaces. Our implementation for the proposed method is available at \\url{https://github.com/sauravpr/hyperbolic_federated_classification}",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "460a12b01476b681528bb693498157795bc9c929",
    "semantic_title": "federated classification in hyperbolic spaces via secure aggregation of convex hulls",
    "citation_count": 0,
    "authors": [
      "Saurav Prakash",
      "Jin Sima",
      "Chao Pan",
      "Eli Chien",
      "Olgica Milenkovic"
    ]
  },
  "https://openreview.net/forum?id=8sg2I9zXgO": {
    "title": "Personalized Algorithmic Recourse with Preference Elicitation",
    "volume": "main",
    "abstract": "Algorithmic Recourse (AR) is the problem of computing a sequence of actions that -- once performed by a user -- overturns an undesirable machine decision. It is paramount that the sequence of actions does not require too much effort for users to implement. Yet, most approaches to AR assume that actions cost the same for all users, and thus may recommend unfairly expensive recourse plans to certain users. Prompted by this observation, we introduce PEAR, the first human-in-the-loop approach capable of providing personalized algorithmic recourse tailored to the needs of any end-user. PEAR builds on insights from Bayesian Preference Elicitation to iteratively refine an estimate of the costs of actions by asking choice set queries to the target user. The queries themselves are computed by maximizing the Expected Utility of Selection, a principled measure of information gain accounting for uncertainty on both the cost estimate and the user's responses. PEAR integrates elicitation into a Reinforcement Learning agent coupled with Monte Carlo Tree Search to quickly identify promising recourse plans. Our empirical evaluation on real-world datasets highlights how PEAR produces high-quality personalized recourse in only a handful of iterations",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "2ae21771e4d66a4835e02bdca0836a4ec5d8e7d4",
    "semantic_title": "personalized algorithmic recourse with preference elicitation",
    "citation_count": 0,
    "authors": [
      "Giovanni De Toni",
      "Paolo Viappiani",
      "Stefano Teso",
      "Bruno Lepri",
      "Andrea Passerini"
    ]
  },
  "https://openreview.net/forum?id=MppUW90uU2": {
    "title": "A Fully Decentralized Surrogate for Multi-Agent Policy Optimization",
    "volume": "main",
    "abstract": "The study of fully decentralized learning or independent learning in cooperative multi-agent reinforcement learning has a history of decades. Recent empirical studies have shown that independent PPO (IPPO) can achieve good performance, comparable to or even better than the methods of centralized training with decentralized execution, in several benchmarks. However, a decentralized actor-critic algorithm with a convergence guarantee is still an open problem. In this paper, we propose decentralized policy optimization (DPO), a decentralized actor-critic algorithm with monotonic improvement and convergence guarantee. We derive a novel decentralized surrogate for policy optimization such that the monotonic improvement of joint policy can be guaranteed by each agent independently optimizing the surrogate. For practical implementation, this decentralized surrogate can be realized by two adaptive coefficients for policy optimization at each agent. Empirically, we evaluate DPO, IPPO, and independent Q-learning (IQL) in a variety of cooperative multi-agent tasks, covering discrete and continuous action spaces, as well as fully and partially observable environments. The results show DPO outperforms both IPPO and IQL in most tasks, which serves as evidence for our theoretical results. The code is available at https://github.com/PKU-RL/DPO",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "7e7fc9a94dbced6707b3679d2f7665c5fa346347",
    "semantic_title": "a fully decentralized surrogate for multi-agent policy optimization",
    "citation_count": 0,
    "authors": [
      "Kefan Su",
      "Zongqing Lu"
    ]
  },
  "https://openreview.net/forum?id=EDqCY6ihbr": {
    "title": "A Globally Convergent Algorithm for Neural Network Parameter Optimization Based on Difference-of-Convex Functions",
    "volume": "main",
    "abstract": "We propose an algorithm for optimizing the parameters of single hidden layer neural networks. Specifically, we derive a blockwise difference-of-convex (DC) functions representation of the objective function. Based on the latter, we propose a block coordinate descent (BCD) approach that we combine with a tailored difference-of-convex functions algorithm (DCA). We prove global convergence of the proposed algorithm. Furthermore, we mathematically analyze the convergence rate of parameters and the convergence rate in value (i.e., the training loss). We give conditions under which our algorithm converges linearly or even faster depending on the local shape of the loss function. We confirm our theoretical derivations numerically and compare our algorithm against state-of-the-art gradient-based solvers in terms of both training loss and test loss",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "484108d2f939be95808d2f5c8a38f1d057b16f4e",
    "semantic_title": "a globally convergent algorithm for neural network parameter optimization based on difference-of-convex functions",
    "citation_count": 0,
    "authors": [
      "Daniel Tschernutter",
      "Mathias Kraus",
      "Stefan Feuerriegel"
    ]
  },
  "https://openreview.net/forum?id=pfbVayaUMc": {
    "title": "Online Reference Tracking For Linear Systems with Unknown Dynamics and Unknown Disturbances",
    "volume": "main",
    "abstract": "This paper presents an online learning mechanism to address the challenge of state tracking for unknown linear systems under general adversarial disturbances. The reference trajectory is assumed to be generated by unknown exosystem dynamics, which relaxes the common assumption of known dynamics for exosystems. Learning a tracking control policy for unknown systems with unknown exosystem dynamics under general disturbances is challenging and surprisingly unsettled. To face this challenge, the presented online learning algorithm has two stages: In the first stage, an algorithm identifies the dynamics of the uncertain system, and in the second stage, an online parametrized memory-augmented controller accounts for the identification error, unknown exosystem dynamics as well as disturbances. The controller's parameters are learned to optimize a general convex cost function, and learning the control parameters is formulated as an online convex optimization problem. This approach uses the memory of previous disturbances and reference values to capture their effects on performance over time. Besides, it implicitly learns the dynamics of the exosystems. The algorithm enables online tuning of controller parameters to achieve state tracking and disturbance rejection while minimizing general convex costs. It is shown that the algorithm achieves a policy regret of $\\mathcal{O}({T}^{\\frac{2}{3}})$. In the simulation results, the performance of the presented tracking algorithm was compared with the certainty equivalent $H_{\\infty}$-control and linear quadratic regulator",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "3f064ccdb4745925c3a8ba79041291db9f70c526",
    "semantic_title": "online optimal tracking of linear systems with adversarial disturbances",
    "citation_count": 0,
    "authors": [
      "Nariman Niknejad",
      "Farnaz Adib Yaghmaie",
      "Hamidreza Modares"
    ]
  },
  "https://openreview.net/forum?id=a68SUt6zFt": {
    "title": "DINOv2: Learning Robust Visual Features without Supervision",
    "volume": "main",
    "abstract": "The recent breakthroughs in natural language processing for model pretraining on large quantities of data have opened the way for similar foundation models in computer vision. These models could greatly simplify the use of images in any system by producing all-purpose visual features, i.e., features that work across image distributions and tasks without finetuning. This work shows that existing pretraining methods, especially self-supervised methods, can produce such features if trained on enough curated data from diverse sources. We revisit existing approaches and combine different techniques to scale our pretraining in terms of data and model size. Most of the technical contributions aim at accelerating and stabilizing the training at scale. In terms of data, we propose an automatic pipeline to build a dedicated, diverse, and curated image dataset instead of uncurated data, as typically done in the self-supervised literature. In terms of models, we train a ViT model with 1B parameters and distill it into a series of smaller models that surpass the best available all-purpose features, OpenCLIP on most of the benchmarks at image and pixel levels",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "5a9cb1b3dc4655218b3deeaf4a2417a9a8cd0891",
    "semantic_title": "dinov2: learning robust visual features without supervision",
    "citation_count": 430,
    "authors": [
      "Maxime Oquab",
      "Timothée Darcet",
      "Théo Moutakanni",
      "Huy V. Vo",
      "Marc Szafraniec",
      "Vasil Khalidov",
      "Pierre Fernandez",
      "Daniel HAZIZA",
      "Francisco Massa",
      "Alaaeldin El-Nouby",
      "Mido Assran",
      "Nicolas Ballas",
      "Wojciech Galuba",
      "Russell Howes",
      "Po-Yao Huang",
      "Shang-Wen Li",
      "Ishan Misra",
      "Michael Rabbat",
      "Vasu Sharma",
      "Gabriel Synnaeve",
      "Hu Xu",
      "Herve Jegou",
      "Julien Mairal",
      "Patrick Labatut",
      "Armand Joulin",
      "Piotr Bojanowski"
    ]
  },
  "https://openreview.net/forum?id=NYdThkjNW1": {
    "title": "Boomerang: Local sampling on image manifolds using diffusion models",
    "volume": "main",
    "abstract": "The inference stage of diffusion models can be seen as running a reverse-time diffusion stochastic differential equation, where samples from a Gaussian latent distribution are transformed into samples from a target distribution that usually reside on a low-dimensional manifold, e.g., an image manifold. The intermediate values between the initial latent space and the image manifold can be interpreted as noisy images, with the amount of noise determined by the forward diffusion process noise schedule. We utilize this interpretation to present Boomerang, an approach for local sampling of image manifolds exploiting the reverse diffusion process dynamics. As implied by its name, Boomerang local sampling involves adding noise to an input image, moving it closer to the latent space, and then mapping it back to the image manifold through a partial reverse diffusion process. Thus, Boomerang generates images on the manifold that are ``similar,'' but nonidentical, to the original input image. We can control the proximity of the generated images to the original by adjusting the amount of noise added. Furthermore, due to the stochastic nature of the partial reverse diffusion process in Boomerang, the generated images display a certain degree of stochasticity, allowing us to obtain ample local samples from the manifold without encountering any duplicates. Boomerang offers the flexibility to work seamlessly with any pretrained diffusion model, such as Stable Diffusion, without necessitating any adjustments to the reverse diffusion process. We present three applications for local sampling using Boomerang. First, we provide a framework for constructing privacy-preserving datasets having controllable degrees of anonymity. Second, we show that using Boomerang for data augmentation increases generalization performance and outperforms state-of-the-art synthetic data augmentation. Lastly, we introduce a perceptual image enhancement framework powered by Boomerang, which enables resolution enhancement",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "e607c4516c7f2dda67b326ddda8c5afd1b2ff2a9",
    "semantic_title": "boomerang: local sampling on image manifolds using diffusion models",
    "citation_count": 12,
    "authors": [
      "Lorenzo Luzi",
      "Paul M Mayer",
      "Josue Casco-Rodriguez",
      "Ali Siahkoohi",
      "Richard Baraniuk"
    ]
  },
  "https://openreview.net/forum?id=KcmWZSk53y": {
    "title": "Improved Regret Bounds for Linear Adversarial MDPs via Linear Optimization",
    "volume": "main",
    "abstract": "Learning Markov decision processes (MDP) in an adversarial environment has been a challenging problem. The problem becomes even more challenging with function approximation since the underlying structure of the loss function and transition kernel are especially hard to estimate in a varying environment. In fact, the state-of-the-art results for linear adversarial MDP achieve a regret of $\\tilde{\\mathcal{O}}({K^{6/7}})$ ($K$ denotes the number of episodes), which admits a large room for improvement. In this paper, we propose a novel explore-exploit algorithm framework and investigate the problem with a new view, which reduces linear MDP into linear optimization by subtly setting the feature maps of the bandit arms of linear optimization. This new technique, under an exploratory assumption, yields an improved bound of $\\tilde{\\mathcal{O}}({K^{4/5}})$ for linear adversarial MDP without access to a transition simulator. The new view could be of independent interest for solving other MDP problems that possess a linear structure",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "64c44e4d7f405ae8df334980642fbb21942a889f",
    "semantic_title": "improved regret bounds for linear adversarial mdps via linear optimization",
    "citation_count": 7,
    "authors": [
      "Fang Kong",
      "XiangCheng Zhang",
      "Baoxiang Wang",
      "Shuai Li"
    ]
  },
  "https://openreview.net/forum?id=RyZB4qXEgt": {
    "title": "Neural Circuit Diagrams: Robust Diagrams for the Communication, Implementation, and Analysis of Deep Learning Architectures",
    "volume": "main",
    "abstract": "Diagrams matter. Unfortunately, the deep learning community has no standard method for diagramming architectures. The current combination of linear algebra notation and ad-hoc diagrams fails to offer the necessary precision to understand architectures in all their detail. However, this detail is critical for faithful implementation, mathematical analysis, further innovation, and ethical assurances. I present neural circuit diagrams, a graphical language tailored to the needs of communicating deep learning architectures. Neural circuit diagrams naturally keep track of the changing arrangement of data, precisely show how operations are broadcast over axes, and display the critical parallel behavior of linear operations. A lingering issue with existing diagramming methods is the inability to simultaneously express the detail of axes and the free arrangement of data, which neural circuit diagrams solve. Their compositional structure is analogous to code, creating a close correspondence between diagrams and implementation. In this work, I introduce neural circuit diagrams for an audience of machine learning researchers. After introducing neural circuit diagrams, I cover a host of architectures to show their utility and breed familiarity. This includes the transformer architecture, convolution (and its difficult-to-explain extensions), residual networks, the U-Net, and the vision transformer. I include a Jupyter notebook that provides evidence for the close correspondence between diagrams and code. Finally, I examine backpropagation using neural circuit diagrams. I show their utility in providing mathematical insight and analyzing algorithms' time and space complexities",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "3be78b45d1cc14a496a7eafdc0e5cfec34cbb030",
    "semantic_title": "neural circuit diagrams: robust diagrams for the communication, implementation, and analysis of deep learning architectures",
    "citation_count": 0,
    "authors": [
      "Vincent Abbott"
    ]
  },
  "https://openreview.net/forum?id=YRKS2J0x36": {
    "title": "DyG2Vec: Efficient Representation Learning for Dynamic Graphs",
    "volume": "main",
    "abstract": "Temporal graph neural networks have shown promising results in learning inductive representations by automatically extracting temporal patterns. However, previous works often rely on complex memory modules or inefficient random walk methods to construct temporal representations. To address these limitations, we present an efficient yet effective attention-based encoder that leverages temporal edge encodings and window-based subgraph sampling to generate task-agnostic embeddings. Moreover, we propose a joint-embedding architecture using non-contrastive SSL to learn rich temporal embeddings without labels. Experimental results on 7 benchmark datasets indicate that on average, our model outperforms SoTA baselines on the future link prediction task by 4.23% for the transductive setting and 3.30% for the inductive setting while only requiring 5-10x less training/inference time. Lastly, different aspects of the proposed framework are investigated through experimental analysis and ablation studies. The code is publicly available at https://github.com/huawei-noah/noah-research/tree/master/graph_atlas",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "07fdc2b9c97b371b83a7596d488b0735c78400a0",
    "semantic_title": "dyg2vec: efficient representation learning for dynamic graphs",
    "citation_count": 0,
    "authors": [
      "Mohammad Alomrani",
      "Mahdi Biparva",
      "Yingxue Zhang",
      "Mark Coates"
    ]
  },
  "https://openreview.net/forum?id=nYjSkOy8ij": {
    "title": "A Survey on Out-of-Distribution Detection in NLP",
    "volume": "main",
    "abstract": "Out-of-distribution (OOD) detection is essential for the reliable and safe deployment of machine learning systems in the real world. Great progress has been made over the past years. This paper presents the first review of recent advances in OOD detection with a particular focus on natural language processing approaches. First, we provide a formal definition of OOD detection and discuss several related fields. We then categorize recent algorithms into three classes according to the data they used: (1) OOD data available, (2) OOD data unavailable + in-distribution (ID) label available, and (3) OOD data unavailable + ID label unavailable. Third, we introduce datasets, applications, and metrics. Finally, we summarize existing work and present potential future research topics",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "dcfca93185c49811ec6cf7c995eea58cf88c7bb3",
    "semantic_title": "a survey on out-of-distribution detection in nlp",
    "citation_count": 7,
    "authors": [
      "Hao Lang",
      "Yinhe Zheng",
      "Yixuan Li",
      "Jian SUN",
      "Fei Huang",
      "Yongbin Li"
    ]
  },
  "https://openreview.net/forum?id=vyRBsqj5iG": {
    "title": "Proximal Mean Field Learning in Shallow Neural Networks",
    "volume": "main",
    "abstract": "We propose a custom learning algorithm for shallow over-parameterized neural networks, i.e., networks with single hidden layer having infinite width. The infinite width of the hidden layer serves as an abstraction for the over-parameterization. Building on the recent mean field interpretations of learning dynamics in shallow neural networks, we realize mean field learning as a computational algorithm, rather than as an analytical tool. Specifically, we design a Sinkhorn regularized proximal algorithm to approximate the distributional flow for the learning dynamics over weighted point clouds. In this setting, a contractive fixed point recursion computes the time-varying weights, numerically realizing the interacting Wasserstein gradient flow of the parameter distribution supported over the neuronal ensemble. An appealing aspect of the proposed algorithm is that the measure-valued recursions allow meshless computation. We demonstrate the proposed computational framework of interacting weighted particle evolution on binary and multi-class classification. Our algorithm performs gradient descent of the free energy associated with the risk functional",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "be4c0c6d3590401ea41a0eca481beb9ea20b22c1",
    "semantic_title": "proximal mean field learning in shallow neural networks",
    "citation_count": 0,
    "authors": [
      "Alexis Teter",
      "Iman Nodozi",
      "Abhishek Halder"
    ]
  },
  "https://openreview.net/forum?id=42BKnT2qW3": {
    "title": "Synaptic Interaction Penalty: Appropriate Penalty Term for Energy-Efficient Spiking Neural Networks",
    "volume": "main",
    "abstract": "Spiking neural networks (SNNs) are energy-efficient neural networks because of their spiking nature. However, as the spike firing rate of SNNs increases, the energy consumption does as well, and thus, the advantage of SNNs diminishes. Here, we tackle this problem by introducing a novel penalty term for the spiking activity into the objective function in the training phase. Our method is designed so as to optimize the energy consumption metric directly without modifying the network architecture. Therefore, the proposed method can reduce the energy consumption more than other methods while maintaining the accuracy. We conducted experiments for image classification tasks, and the results indicate the effectiveness of the proposed method, which mitigates the dilemma of the energy--accuracy trade-off",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "bc516ba3e1b3b81061c99c3704d87569d2142d41",
    "semantic_title": "spiking synaptic penalty: appropriate penalty term for energy-efficient spiking neural networks",
    "citation_count": 0,
    "authors": [
      "Kazuma Suetake",
      "Takuya Ushimaru",
      "Ryuji Saiin",
      "Yoshihide Sawada"
    ]
  },
  "https://openreview.net/forum?id=n8fZ6mY6PB": {
    "title": "Exploring Format Consistency for Instruction Tuning",
    "volume": "main",
    "abstract": "Instruction tuning has emerged as a promising approach to enhancing large language models in following human instructions. It is shown that increasing the diversity and number of instructions in the training data can consistently enhance generalization performance, which facilitates a recent endeavor to collect various instructions and integrate existing instruction tuning datasets into larger collections. However, different users have their unique ways of expressing instructions, and there often exist variations across different datasets in the instruction styles and formats, i.e., format inconsistency. In this work, a framework named Unified Instruction Tuning (UIT) is proposed, which calls OpenAI APIs for automatic format transfer among different instruction tuning datasets such as PromptSource, FLAN and CrossFit. With the framework, we (1) demonstrate the necessity of maintaining format consistency in instruction tuning; (2) improve the generalization performance on unseen instructions on T5-LM-xl; (3) provide a novel perplexity-based denoising method to reduce the noise of automatic format transfer to make the UIT framework more practical and a smaller offline model based on GPT-J that achieves comparable format transfer capability to OpenAI APIs to reduce costs in practice. Further analysis regarding variations of targeted formats and other effects is intended. The code and trained models will soon be available",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "46ac88bb0acbf736840ff8a392cec2bf43d917e1",
    "semantic_title": "exploring format consistency for instruction tuning",
    "citation_count": 3,
    "authors": [
      "Shihao Liang",
      "Runchu Tian",
      "Kunlun Zhu",
      "Yujia Qin",
      "Huadong Wang",
      "Xin Cong",
      "Zhiyuan Liu",
      "Xiaojiang Liu",
      "Maosong Sun"
    ]
  },
  "https://openreview.net/forum?id=EWv9XGOpB3": {
    "title": "Variational Classification: A Probabilistic Generalization of the Softmax Classifier",
    "volume": "main",
    "abstract": "We present a latent variable model for classification that provides a novel probabilistic interpretation of neural network softmax classifiers. We derive a variational objective to train the model, analogous to the evidence lower bound (ELBO) used to train variational auto-encoders, that generalises the cross-entropy loss used to train classification models. Treating inputs to the softmax layer as samples of a latent variable, our abstracted perspective reveals a potential inconsistency between their anticipated distribution, required for accurate label predictions to be output, and the empirical distribution found in practice. We augment the variational objective to mitigate such inconsistency and encourage a chosen latent distribution, instead of the implicit assumption in off-the-shelf softmax classifiers. Overall, we provide new theoretical insight into the inner workings of widely-used softmax classification. Empirical evaluation on image and text classification datasets demonstrates that our proposed approach, variational classification, maintains classification accuracy while the reshaped latent space improves other desirable properties of a classifier, such as calibration, adversarial robustness, robustness to distribution shift and sample efficiency useful in low data settings",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Shehzaad Zuzar Dhuliawala",
      "Mrinmaya Sachan",
      "Carl Allen"
    ]
  },
  "https://openreview.net/forum?id=NmpjDHWIvg": {
    "title": "Wasserstein Distributionally Robust Policy Evaluation and Learning for Contextual Bandits",
    "volume": "featured",
    "abstract": "Off-policy evaluation and learning are concerned with assessing a given policy and learning an optimal policy from offline data without direct interaction with the environment. Often, the environment in which the data are collected differs from the environment in which the learned policy is applied. To account for the effect of different environments during learning and execution, distributionally robust optimization (DRO) methods have been developed that compute worst-case bounds on the policy values assuming that the distribution of the new environment lies within an uncertainty set. Typically, this uncertainty set is defined based on the KL divergence around the empirical distribution computed from the logging dataset. However, the KL uncertainty set fails to encompass distributions with varying support and lacks awareness of the geometry of the distribution support. As a result, KL approaches fall short in addressing practical environment mismatches and lead to over-fitting to worst-case scenarios. To overcome these limitations, we propose a novel DRO approach that employs the Wasserstein distance instead. While Wasserstein DRO is generally computationally more expensive compared to KL DRO, we present a regularized method and a practical (biased) stochastic gradient descent method to optimize the policy efficiently. We also provide a theoretical analysis of the finite sample complexity and iteration complexity for our proposed method. We further validate our approach using a public dataset that was recorded in a randomized stoke trial",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "96c77909fd7ee5bb27213ddf4309475873f8a958",
    "semantic_title": "wasserstein distributionally robust policy evaluation and learning for contextual bandits",
    "citation_count": 0,
    "authors": [
      "Yi Shen",
      "Pan Xu",
      "Michael Zavlanos"
    ]
  },
  "https://openreview.net/forum?id=TQfQUksaC8": {
    "title": "Pathologies of Predictive Diversity in Deep Ensembles",
    "volume": "featured",
    "abstract": "Classic results establish that encouraging predictive diversity improves performance in ensembles of low-capacity models, e.g. through bagging or boosting. Here we demonstrate that these intuitions do not apply to high-capacity neural network ensembles (deep ensembles), and in fact the opposite is often true. In a large scale study of nearly 600 neural network classification ensembles, we examine a variety of interventions that trade off component model performance for predictive diversity. While such interventions can improve the performance of small neural network ensembles (in line with standard intuitions), they harm the performance of the large neural network ensembles most often used in practice. Surprisingly, we also find that discouraging predictive diversity is often benign in large-network ensembles, fully inverting standard intuitions. Even when diversity-promoting interventions do not sacrifice component model performance (e.g. using heterogeneous architectures and training paradigms), we observe an opportunity cost associated with pursuing increased predictive diversity. Examining over 1000 ensembles, we observe that the performance benefits of diverse architectures/training procedures are easily dwarfed by the benefits of simply using higher-capacity models, despite the fact that such higher capacity models often yield significantly less predictive diversity. Overall, our findings demonstrate that standard intuitions around predictive diversity, originally developed for low-capacity ensembles, do not directly apply to modern high-capacity deep ensembles. This work clarifies fundamental challenges to the goal of improving deep ensembles by making them more diverse, while suggesting an alternative path: simply forming ensembles from ever more powerful (and less diverse) component models",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "20113225d61a160bdab4ad2228a2918e41232e29",
    "semantic_title": "pathologies of predictive diversity in deep ensembles",
    "citation_count": 1,
    "authors": [
      "Taiga Abe",
      "E. Kelly Buchanan",
      "Geoff Pleiss",
      "John Patrick Cunningham"
    ]
  },
  "https://openreview.net/forum?id=FDt2UGM1Nz": {
    "title": "DIG In: Evaluating Disparities in Image Generations with Indicators for Geographic Diversity",
    "volume": "featured",
    "abstract": "The unprecedented photorealistic results achieved by recent text-to-image generative systems and their increasing use as plug-and-play content creation solutions make it crucial to understand their potential biases. In this work, we introduce three indicators to evaluate the realism, diversity and prompt-generation consistency of text-to-image generative systems when prompted to generate objects from across the world. Our indicators complement qualitative analysis of the broader impact of such systems by enabling automatic and efficient benchmarking of geographic disparities, an important step towards building responsible visual content creation systems. We use our proposed indicators to analyze potential geographic biases in state-of-the-art visual content creation systems and find that: (1) models have less realism and diversity of generations when prompting for Africa and West Asia than Europe, (2) prompting with geographic information comes at a cost to prompt-consistency and diversity of generated images, and (3) models exhibit more region-level disparities for some objects than others. Perhaps most interestingly, our indicators suggest that progress in image generation quality has come at the cost of real-world geographic representation. Our comprehensive evaluation constitutes a crucial step towards ensuring a positive experience of visual content creation for everyone. Code is available at https://github.com/facebookresearch/DIG-In/",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "a00537a398ce1cacf3b6835a9817ade535d2dae2",
    "semantic_title": "dig in: evaluating disparities in image generations with indicators for geographic diversity",
    "citation_count": 2,
    "authors": [
      "Melissa Hall",
      "Candace Ross",
      "Adina Williams",
      "Nicolas Carion",
      "Michal Drozdzal",
      "Adriana Romero-Soriano"
    ]
  },
  "https://openreview.net/forum?id=10R6iX6JHm": {
    "title": "We're Not Using Videos Effectively: An Updated Domain Adaptive Video Segmentation Baseline",
    "volume": "reproducibility",
    "abstract": "There has been abundant work in unsupervised domain adaptation for semantic segmentation (DAS) seeking to adapt a model trained on images from a labeled source domain to an unlabeled target domain. While the vast majority of prior work has studied this as a frame-level Image-DAS problem, a few Video-DAS works have sought to additionally leverage the temporal signal present in adjacent frames. However, Video-DAS works have historically studied a distinct set of benchmarks from Image-DAS, with minimal cross-benchmarking. In this work, we address this gap. Surprisingly, we find that (1) even after carefully controlling for data and model architecture, state-of-the-art Image-DAS methods (HRDA and HRDA+MIC)} outperform Video-DAS methods on established Video-DAS benchmarks (+14.5 mIoU on Viper$\\rightarrow$CityscapesSeq, +19.0 mIoU on Synthia$\\rightarrow$CityscapesSeq), and (2) naive combinations of Image-DAS and Video-DAS techniques only lead to marginal improvements across datasets. To avoid siloed progress between Image-DAS and Video-DAS, we open-source our codebase with support for a comprehensive set of Video-DAS and Image-DAS methods on a common benchmark. Code available at https://github.com/SimarKareer/UnifiedVideoDA",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "e96e71694d02a631e48f39874c42c6480ed7078e",
    "semantic_title": "we're not using videos effectively: an updated domain adaptive video segmentation baseline",
    "citation_count": 0,
    "authors": [
      "Simar Kareer",
      "Vivek Vijaykumar",
      "Harsh Maheshwari",
      "Judy Hoffman",
      "Prithvijit Chattopadhyay",
      "Viraj Uday Prabhu"
    ]
  },
  "https://openreview.net/forum?id=tQVZgvXhZb": {
    "title": "A Unified View on Solving Objective Mismatch in Model-Based Reinforcement Learning",
    "volume": "survey",
    "abstract": "Model-based Reinforcement Learning (MBRL) aims to make agents more sample-efficient, adaptive, and explainable by learning an explicit model of the environment. While the capabilities of MBRL agents have significantly improved in recent years, how to best learn the model is still an unresolved question. The majority of MBRL algorithms aim at training the model to make accurate predictions about the environment and subsequently using the model to determine the most rewarding actions. However, recent research has shown that model predictive accuracy is often not correlated with action quality, tracing the root cause to the objective mismatch between accurate dynamics model learning and policy optimization of rewards. A number of interrelated solution categories to the objective mismatch problem have emerged as MBRL continues to mature as a research area. In this work, we provide an in-depth survey of these solution categories and propose a taxonomy to foster future research",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "690fe81e99b1486ff49c9fc4da9bcd1a7e674668",
    "semantic_title": "a unified view on solving objective mismatch in model-based reinforcement learning",
    "citation_count": 1,
    "authors": [
      "Ran Wei",
      "Nathan Lambert",
      "Anthony D McDonald",
      "Alfredo Garcia",
      "Roberto Calandra"
    ]
  },
  "https://openreview.net/forum?id=sWlHhfijcS": {
    "title": "A Survey on Graph Construction for Geometric Deep Learning in Medicine: Methods and Recommendations",
    "volume": "survey",
    "abstract": "Graph neural networks are powerful tools that enable deep learning on non-Euclidean data structures like graphs, point clouds, and meshes. They leverage the connectivity of data points and can even benefit learning tasks on data, which is not naturally graph-structured -like point clouds. In these cases, the graph structure needs to be determined from the dataset, which adds a significant challenge to the learning process. This opens up a multitude of design choices for creating suitable graph structures, which have a substantial impact on the success of the graph learning task. However, so far no concrete guidance for choosing the most appropriate graph construction is available, not only due to the large variety of methods out there but also because of its strong connection to the dataset at hand. In medicine, for example, a large variety of different data types complicates the selection of graph construction methods even more. We therefore summarise the current state-of-the-art graph construction methods, especially for medical data. In this work, we introduce a categorisation scheme for graph types and graph construction methods. We identify two main strands of graph construction: static and adaptive methods, discuss their advantages and disadvantages, and formulate recommendations for choosing a suitable graph construction method. We furthermore discuss how a created graph structure can be assessed and to what degree it supports graph learning. We hope to support medical research with graph deep learning with this work by elucidating the wide variety of graph construction methods",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": null,
    "semantic_title": "",
    "citation_count": 0,
    "authors": [
      "Tamara T. Müller",
      "Sophie Starck",
      "Alina Dima",
      "Stephan Wunderlich",
      "Kyriaki-Margarita Bintsi",
      "Kamilia Zaripova",
      "Rickmer Braren",
      "Daniel Rueckert",
      "Anees Kazi",
      "Georgios Kaissis"
    ]
  },
  "https://openreview.net/forum?id=UAT4j3Y7HP": {
    "title": "Break it, Imitate it, Fix it: Robustness by Generating Human-Like Attacks",
    "volume": "expert",
    "abstract": "Real-world natural language processing systems need to be robust to human adversaries. Collecting examples of human adversaries for training is an effective but expensive solution. On the other hand, training on synthetic attacks with small perturbations---such as word-substitution---does not actually improve robustness to human adversaries. In this paper, we propose an adversarial training framework that uses limited human adversarial examples to generate more useful adversarial examples at scale. We demonstrate the advantages of this system on the ANLI and hate speech detection benchmark datasets---both collected via an iterative, adversarial human-and-model-in-the-loop procedure. Compared to training only on observed human attacks, also training on our synthetic adversarial examples improves model robustness to future rounds. In ANLI, we see accuracy gains on the current set of attacks (44.1\\%$\\,\\to\\,$50.1\\%) and on two future unseen rounds of human generated attacks (32.5\\%$\\,\\to\\,$43.4\\%, and 29.4\\%$\\,\\to\\,$40.2\\%). In hate speech detection, we see AUC gains on current attacks (0.76 $\\to$ 0.84) and a future round (0.77 $\\to$ 0.79). Attacks from methods that do not learn the distribution of existing human adversaries, meanwhile, degrade robustness",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "9262e201ecaf678429bf86481b1c1d1ae6332b44",
    "semantic_title": "break it, imitate it, fix it: robustness by generating human-like attacks",
    "citation_count": 0,
    "authors": [
      "Aradhana Sinha",
      "Ananth Balashankar",
      "Ahmad Beirami",
      "Thi Avrahami",
      "Jilin Chen",
      "Alex Beutel"
    ]
  },
  "https://openreview.net/forum?id=ga5SNulYet": {
    "title": "Wavelet Networks: Scale-Translation Equivariant Learning From Raw Time-Series",
    "volume": "expert",
    "abstract": "Leveraging the symmetries inherent to specific data domains for the construction of equivariant neural networks has lead to remarkable improvements in terms of data efficiency and generalization. However, most existing research focuses on symmetries arising from planar and volumetric data, leaving a crucial data source largely underexplored: *time-series*. In this work, we fill this gap by leveraging the symmetries inherent to time-series for the construction of equivariant neural network. We identify two core symmetries: *scale and translation*, and construct scale-translation equivariant neural networks for time-series learning. Intriguingly, we find that scale-translation equivariant mappings share strong resemblance with the *wavelet transform*. Inspired by this resemblance, we term our networks *Wavelet Networks*, and show that they perform nested non-linear wavelet-like time-frequency transforms. Empirical results show that Wavelet Networks outperform conventional CNNs on raw waveforms, and match strongly engineered spectrogram techniques across several tasks and time-series types, including audio, environmental sounds, and electrical signals. Our code is publicly available at https://github.com/dwromero/wavelet_networks",
    "keywords": [
      "",
      ""
    ],
    "checked": false,
    "id": "1ad1d4691c74f25a6d3548214bcd1b2c10611bce",
    "semantic_title": "sossf: landsat-8 image synthesis on the blending of sentinel-1 and modis data",
    "citation_count": 0,
    "authors": [
      "David W. Romero",
      "Erik J Bekkers",
      "Jakub M. Tomczak",
      "Mark Hoogendoorn"
    ]
  },
  "https://openreview.net/forum?id=lTOku838Zv": {
    "title": "Neural Implicit Manifold Learning for Topology-Aware Density Estimation",
    "volume": "expert",
    "abstract": "Natural data observed in $\\mathbb{R}^n$ is often constrained to an $m$-dimensional manifold $\\mathcal{M}$, where $m < n$. This work focuses on the task of building theoretically principled generative models for such data. Current generative models learn $\\mathcal{M}$ by mapping an $m$-dimensional latent variable through a neural network $f_\\theta: \\mathbb{R}^m \\to \\mathbb{R}^n$. These procedures, which we call pushforward models, incur a straightforward limitation: manifolds cannot in general be represented with a single parameterization, meaning that attempts to do so will incur either computational instability or the inability to learn probability densities within the manifold. To remedy this problem, we propose to model $\\mathcal{M}$ as a neural implicit manifold: the set of zeros of a neural network. We then learn the probability density within $\\mathcal{M}$ with a constrained energy-based model, which employs a constrained variant of Langevin dynamics to train and sample from the learned manifold. In experiments on synthetic and natural data, we show that our model can learn manifold-supported distributions with complex topologies more accurately than pushforward models",
    "keywords": [
      "",
      ""
    ],
    "checked": true,
    "id": "914b2aed4d0938d7dce4695d1c25069ea68a1d37",
    "semantic_title": "neural implicit manifold learning for topology-aware density estimation",
    "citation_count": 0,
    "authors": [
      "Brendan Leigh Ross",
      "Gabriel Loaiza-Ganem",
      "Anthony L. Caterini",
      "Jesse C. Cresswell"
    ]
  }
}